[
    {
        "title": "Criteria set for BHWs serving as health education officers",
        "description": "ILOILO CITY – The local government is moving to standardize the qualifications of barangay health workers (BHWs) serving as Health Education and Promotion Officers (HEPOs) in Iloilo City, following a recommendation from the local health board. “At least we can equip them, according to the…",
        "content": "CONGRESS. More or less 10,000 barangay health workers from Iloilo gather for the Iloilo Provincial BHW Congress 2023, held at the Iloilo Sports Complex in this August 24, 2023 photo. The BHWs were recognized for their role during the health pandemic ... [1800 chars]",
        "url": "https://www.pna.gov.ph/articles/1246935",
        "image": "https://files01.pna.gov.ph/ograph/2023/08/24/iloilo-bhw-congress.jpg",
        "publishedAt": "2025-03-27T07:01:21Z",
        "source": {
            "name": "pna.gov.ph",
            "url": "https://www.pna.gov.ph"
        },
        "scrap_content": "ILOILO CITY – The local government is moving to standardize the qualifications of barangay health workers (BHWs) serving as Health Education and Promotion Officers (HEPOs) in Iloilo City, following a recommendation from the local health board.\n“At least we can equip them, according to the guidelines set by Universal Health Care, provide them with ample knowledge with regards to their responsibility, and enhance their communication skills,” Councilor Alan Zaldivar, chair of the committee on health, sanitation, and hospital services at the Sangguniang Panlungsod (City Council), said on Thursday.\nZaldivar sponsored the resolution that formally establishes the qualifications and criteria recommended by the health board, which was approved during the council’s regular session on Wednesday.\nBased on the criteria set by the local health board, health workers serving as HEPOs must be physically fit to perform their duties as front-liners in the primary healthcare systems.\nThey must know basic healthcare practices and interpersonal communication skills, be able to assess community health needs, address concerns, and rally the community towards improving overall public health.\nThey must be at least 18 years old and at most 65 years of age.\nZaldivar noted that some health programs have been underutilized due to BHWs’ lack of training in promoting health advocacy campaigns.\nHe explained that by equipping them with the necessary skills and knowledge, they could strengthen their capacity to effectively promote public health initiatives.\nCurrently, BHWs receive an allowance of about PHP3,000. (PNA)"
    },
    {
        "title": "Bianca Umali holds post-birthday celebration with children of Baseco Compound",
        "description": "Bianca Umali capped off her birth month with a special post-birthday celebration with the children of Baseco Compound.",
        "content": "Bianca Umali capped off her birth month with a special post-birthday celebration with the children of Baseco Compound.\nOn Instagram Thursday, GMA Integrated News broadcast journalist Nelson Canlas shared a heartwarming video of the Sparkle star spend... [1073 chars]",
        "url": "https://www.gmanetwork.com/news/lifestyle/hobbiesandactivities/940733/bianca-umali-holds-post-birthday-celebration-with-children-of-baseco-compound/story/",
        "image": "https://images.gmanews.tv/webpics/2025/03/Bianca_Umali_post_birthday_celebration_Baseco_Compound__2025_03_27_14_09_40.jpg",
        "publishedAt": "2025-03-27T06:42:24Z",
        "source": {
            "name": "GMA News Online",
            "url": "https://www.gmanetwork.com"
        },
        "scrap_content": "Bianca Umali capped off her birth month with a special post-birthday celebration with the children of Baseco Compound.\nOn Instagram Thursday, GMA Integrated News broadcast journalist Nelson Canlas shared a heartwarming video of the Sparkle star spending time with the kids at the event, which was in partnership with humanitarian organization World Vision.\nBianca can be seen reading a children's book to the kids and doing arts and crafts with them. They also donned party hats together. The clip ended with a birthday cake for the actress.\n\"The day was filled with laughter and connection, highlighted by storytelling and craft making. The celebration ended on the most touching note as the kids surprising Bianca with handmade birthday cards, each one a little piece of their love and gratitude,\" Nelson said in the caption.\nBianca celebrated her 25th birthday with family and friends early this March.\nShe has been a World Vision ambassador since 2017, advocating for education for children and ending violence against children. She has also led the organization's Sponsor and Child and #GirlsCan campaign.\nBianca is set to star as Terra in \"Sang'gre,\" the upcoming Kapuso spin-off series to \"Encantadia.\" The series also stars Kelvin Miranda, Faith Da Silva, and Angel Guardian, among others.\n—CDC, GMA Integrated News"
    },
    {
        "title": "Long Covid patients report dismissal and lack of support from healthcare providers",
        "description": "People living with Long Covid often feel dismissed, disbelieved and unsupported by their healthcare providers, according to a new study from the University of Surrey.",
        "content": "People living with Long Covid often feel dismissed, disbelieved and unsupported by their healthcare providers, according to a new study from the University of Surrey.\nThe study, which was published in the Journal of Health Psychology, looked at how p... [1602 chars]",
        "url": "https://www.news-medical.net/news/20250327/Long-Covid-patients-report-dismissal-and-lack-of-support-from-healthcare-providers.aspx",
        "image": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Fatigue-620x480.jpg",
        "publishedAt": "2025-03-27T06:17:00Z",
        "source": {
            "name": "News-Medical.Net",
            "url": "https://www.news-medical.net"
        },
        "scrap_content": null
    },
    {
        "title": "AirAsia flight to China turns back due to engine issue, lands safely",
        "description": "KUALA LUMPUR: An AirAsia flight bound for China returned to Kuala Lumpur due to an engine issue shortly after takeoff and landed safely with no injuries reported, Malaysian authorities and the airline said on Thursday (Mar 27). Flight AK128, an Airbus A320, was on its way to Shenzhen but turned back to Kua",
        "content": "KUALA LUMPUR: An AirAsia flight bound for China returned to Kuala Lumpur due to an engine issue shortly after takeoff and landed safely with no injuries reported, Malaysian authorities and the airline said on Thursday (Mar 27).\nFlight AK128, an Airbu... [1036 chars]",
        "url": "https://www.channelnewsasia.com/asia/airasia-kuala-lumpur-china-flight-ak128-engine-issue-5027216",
        "image": "https://dam.mediacorp.sg/image/upload/s--0gZ9b2oS--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2023-11:afp_watermark_14112023,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2025/03/27/000_34m88gy_mod.jpg?itok=V1IqGX9D",
        "publishedAt": "2025-03-27T06:10:00Z",
        "source": {
            "name": "CNA",
            "url": "https://www.channelnewsasia.com"
        },
        "scrap_content": "KUALA LUMPUR: An AirAsia flight bound for China returned to Kuala Lumpur due to an engine issue shortly after takeoff and landed safely with no injuries reported, Malaysian authorities and the airline said on Thursday (Mar 27).\nFlight AK128, an Airbus A320, was on its way to Shenzhen but turned back to Kuala Lumpur International Airport due to \"an abnormal indication in one of the engines\", budget airline AirAsia said in a statement.\nMalaysia's Selangor state fire department said earlier that a \"pneumatic ducting burst\" started a fire in the right engine shortly after the flight's 9.59pm departure on Wednesday.\nCapital A-owned AirAsia said its inspection showed there was no engine fire but that a damaged duct had caused hot air to be released into the engine.\nFirefighters ensured all passengers and crew exited the aircraft after the plane landed safely slightly past midnight, the fire department said, adding that no one was hurt.\nAirAsia said all 171 passengers were transferred to another aircraft, which landed at Shenzhen Bao'an International Airport on Thursday morning.\nThe initial aircraft is expected to return to service on Mar 31, the airline added.\nMalaysia's aviation authority will investigate the incident, local media reported, citing the transport minister."
    },
    {
        "title": "WA Health on alert as state braces for what could be worst measles outbreak in five years",
        "description": "Western Australia could be on track for its worst outbreak of measles in the past five years, as infections in Hakea Prison cause chaos in the courts and the list of exposure sites grows.",
        "content": "Western Australia could be on track for its worst outbreak of measles in the past five years, as infections in Hakea Prison causes chaos in the courts and the list of exposure sites grows.\nThe state has recorded three cases of the highly contagious d... [5331 chars]",
        "url": "https://www.abc.net.au/news/2025-03-27/measles-in-australia-fears-of-worst-wa-outbreak-in-five-years/105103230",
        "image": "https://live-production.wcms.abc-cdn.net.au/a413e91c1e7172c20b49c0cfc119f820?impolicy=wcms_watermark_news&cropH=241&cropW=428&xPos=0&yPos=42&width=862&height=485&imformat=generic",
        "publishedAt": "2025-03-27T06:08:39Z",
        "source": {
            "name": "ABC News",
            "url": "https://www.abc.net.au"
        },
        "scrap_content": "In short:\nSo far in 2025, WA has had three measles notifications — already half the number recorded last year.\nCases linked to Hakea Prison have caused delays to proceedings in Perth's District Court in recent days.\nWhat's next:\nSenior medical advisor from the WA Department of Health Dr Paul Effler urged people to get vaccinated against the disease.\nWestern Australia could be on track for its worst outbreak of measles in the past five years, as infections in Hakea Prison cause chaos in the courts and the list of exposure sites grows.\nThe state has recorded three cases of the highly contagious disease this year just three months in, and that figure is already half the total count in 2023 and 2024.\nIt adds to a growing tally of measles cases around the country, with more than 30 confirmed so far, mostly in New South Wales and Victoria.\nIt would be WA's worst year since 2020, when there were four notifications of the disease, if the spread continues at its current rate.\nA case of the potentially deadly illness was recorded on Thursday at Bunbury Regional Hospital.\nPrison outbreak causes court delays\nSenior medical advisor from the WA Department of Health Paul Effler said the infection was linked to an outbreak at Hakea Prison in Perth's south-east suburbs, where people awaiting court appearances are held in custody.\n\"It was actually a prisoner that was being treated at the hospital that was the likely exposure for the case associated with Bunbury hospital,\" he said.\n\"There's a couple cases related to the Hakea exposure right now and others are under investigation.\"\nWA Health confirmed one case at the male prison on Tuesday and assured staff had \"well-practised\" systems and protocols to manage these types of outbreaks.\nThe Health Department said it was helping the Department of Justice to offer vaccines to prisoners and staff who weren't already protected.\nIt was heard in a WA District Court trial on Thursday that two of the accused have measles and the trial, which had already started, was unable to continue this week.\nA decision will be made on Monday whether that trial can go ahead depending on the health of the accused.\nAnother Hakea inmate was unable to attend a hearing in a separate case, with the court hearing he was in isolation.\nWho is vulnerable to measles?\nMost older Australians contracted measles as a child and are now immune for life, but those born after 1994 need two doses of the vaccine to be highly protected.\nIt's those aged between 30 and 60 who have only received one vaccine that are susceptible, health experts say.\nDr Effler said all the cases in WA this year have been within that age bracket.\nThe Australian Medical Association said its concern about measles has increased amid a growing outbreak in the United States.\n\"Measles is a really deadly illness,\" AMA President Dr Danielle McMullen said.\n\"Immunisation is the way to prevent the deaths and long-term disability from measles and it's really important that we maintain out fantastic immunisation rates in Australia.\"\nAccording to government statistics, the US had recorded 378 confirmed cases and two deaths this year, as of March 20.\nDr Effler said the disease also circulates Asia.\n\"When we get cases introduced from overseas, they usually don't spread very widely, because the vaccine coverage is so good,\" he said.\n\"Measles is so infectious, it's the most infectious disease known to humans.\n\"But there's a very effective vaccine available.\"\nIs vaccine hesitancy to blame?\nEpidemiologist Raina MacIntyre said vaccine hesitancy is likely contributing to the rise in cases across the country.\n\"The issue is we've had a falling rate of vaccination,\" she said.\n\"Our childhood vaccination rates have dropped from about 94 per cent to 91 per cent.\n\"That's part of a worldwide trend we've seen after the COVID pandemic of increasing vaccine hesitancy.\n\"It is a real problem because it makes us vulnerable to these outbreaks.\"\nDoctors in Australia are worried vaccine fatigue and misinformation may be contributing to a drop in flu vaccinations this year.\nFederal government data revealed a 15 per cent drop in flu vaccines in 2024 compared to the previous year.\nDr McMullen said it's concerning after the northern hemisphere experience a \"horror\" season this winter.\n\"It's a huge drop. We've seen that right around the country and across all age groups,\" she said.\n\"We had seen an increase in vaccination rates during COVID when everyone was worried about respiratory illness, but we can't afford to see that drop.\n\"The protection only does last a season, and it also gets updated every year to match the strains that are circulating around.\""
    },
    {
        "title": "Australia’s PM Anthony Albanese set to call election ‘imminently’",
        "description": "Prime Minister Albanese’s Labor Party has introduced new tax cuts in advance of general election due before May 17.",
        "content": "Prime Minister Albanese’s Labor Party has introduced new tax cuts in advance of general election due before May 17.\nAustralia’s Prime Minister Anthony Albanese says he plans to call a national election “imminently” as the May 17 deadline for electing... [2220 chars]",
        "url": "https://www.aljazeera.com/news/2025/3/27/australias-pm-anthony-albanese-set-to-call-election-imminently",
        "image": "https://www.aljazeera.com/wp-content/uploads/2025/02/2024-06-18T055803Z_654581855_RC2QC8AWKMCV_RTRMADP_3_AUSTRALIA-CHINA-1-1739951525.jpg?resize=1920%2C1440",
        "publishedAt": "2025-03-27T06:06:39Z",
        "source": {
            "name": "Al Jazeera English",
            "url": "https://www.aljazeera.com"
        },
        "scrap_content": "Australia’s Prime Minister Anthony Albanese says he plans to call a national election “imminently” as the May 17 deadline for electing a new parliament is fast approaching.\n“It will be in May, I can guarantee that. And it will be called pretty imminently,” Albanese told radio station Triple M on Thursday.\nRecommended Stories\nlist of 4 items“I’m not calling it today but I will call it soon. I think that Australians want to get on with it,” he said.\nSeparate reports from The Sydney Morning Herald and The Australian newspapers said Albanese is scheduled to visit Governor-General Sam Mostyn’s in Canberra on Friday to call the election.\nAlbanese must receive Mostyn’s authorisation, who as governor-general represents the United Kingdom’s King Charles – Australia’s official head of state – to dissolve parliament and declare a general election.\nThe Australian reported that the vote would take place on May 3, though Albanese’s office has yet to comment on the claim.\nPrime Minister Anthony Albanese is expected to call the federal election tomorrow, ending months of speculation about when the date would be. Several government sources confirmed Albanese will visit Governor-General Sam Mostyn’s residence in Canberra tomorrow morning to finally… pic.twitter.com/aVD11WCABA\n— 7NEWS Australia (@7NewsAustralia) March 27, 2025\nAlbanese’s Labor Party has introduced a slew of measures to appease voters as they prepare to head to the polls amid high costs of living.\nOn Tuesday, the government announced two new rounds of tax cuts in the federal budget worth 17.1 billion Australian dollars ($10.7bn), where a person earning an average income would be eligible for a 268-Australian-dollar ($170) tax cut in the fiscal year ending June 2027, and a 536-Australian-dollar cut ($338) the following year.\nThough welcome, the cuts are still more modest than the 1,654-Australian-dollar ($1,044) tax relief introduced during the current fiscal year.\nMaking his pre-election promises, the leader of the opposition Liberal-National coalition, Peter Dutton, said his party would cut the fuel excise tax by half, calling it a “real, immediate relief” that could save families with a single car 750 Australian dollars ($473) over the course of a year.\nDutton said the fuel excise tax would be reduced on the day he takes office, if elected prime minister, and would last for 12 months."
    },
    {
        "title": "Chris Mason: Trump means uncertainty is the new certainty for the UK",
        "description": "The strategy from the UK government has been to wrangle in private and say as little as possible in public, our political editor writes.",
        "content": "For the UK, the US is the second largest car export market after the EU, according to the Society of Motor Manufacturers and Traders.\nTwo and a bit months in to Trump's second term, the strategy from the government in the UK has been to wrangle in pr... [2137 chars]",
        "url": "https://www.bbc.co.uk/news/articles/c1jp6n82k4xo",
        "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/57a2/live/a1ce5160-0aa5-11f0-97d3-37df2b293ed1.jpg",
        "publishedAt": "2025-03-27T06:05:09Z",
        "source": {
            "name": "bbc.co.uk",
            "url": "https://www.bbc.co.uk"
        },
        "scrap_content": "- Published\nThe world has changed, said the chancellor -- and hours later it did, again.\nIt is a phrase that has become a familiar one at Westminster in the last few days and the line used to justify the shift in priorities and spending cuts Rachel Reeves announced in her Spring Statement.\nWhen folk in government say the world has changed what they mean, at least in part, is Donald Trump is back in the White House and they can't be remotely certain what is going to happen next.\nIn the latest example of stagecraft and statecraft amounting to the same thing for America's president, he set out in a news conference that Washington would be imposing an import tax or tariff of 25% on all cars America buys from abroad.\nFor the UK, the US is the second largest car export market after the EU, according to the Society of Motor Manufacturers and Traders.\nTwo and a bit months in to Trump's second term, the strategy from the government in the UK has been to wrangle in private and say as little as possible in public.\n\"If in doubt, say nowt\" is how you might colloquially describe the approach, resisting the temptation to be drawn into commentary about the president's actions for fear of provoking a blast of his ire.\nAnd alongside this, work has been under way to agree a US-UK trade deal, which may provide some insulation from the whims and broadsides of Trump.\nBut all this underlines that uncertainty is the new certainty and considerable bandwidth is absorbed within government anticipating what might be around the corner and then seeking to negotiate about and/or mitigate the consequences of whatever is expected to change.\nThe independent forecaster, the Office for Budget Responsibility (OBR), tasked with the near impossible job of economic projections amid such swirling uncertainty, nonetheless has a go.\nWith more than a splash of understatement, the OBR writes in its latest economic and fiscal outlook - which accompanied the chancellor's Spring Statement - that \"following the election of a new US administration in November, US trade policies and those of its major trading partners remain in flux\".\nYou can say that again.\nAcross five pages, the OBR works through various scenarios following a hike in tariffs of 20 percentage points by the US.\nFirstly on countries other than the UK, then on all countries including the UK and finally again on all countries including the UK but where those countries reciprocate with equivalent tariffs on US goods.\nThe most severe, involving retaliation, the forecaster reckons, \"would almost entirely eliminate the headroom against the fiscal mandate\" – in other words, near nuke on its own all the budgetary shuffling and trade-offs Reeves has been juggling with in recent weeks.\nBlimey.\nFor this reason among many ministers will be desperate to avoid anything close to this scenario playing out.\nAnd all of this just days before what Trump has dubbed \"Liberation Day\" next Tuesday, when, yes, a huge number of new tariffs are anticipated.\nThe world has changed, and continues to change."
    },
    {
        "title": "Trump floats easing tariffs on China in return for TikTok deal",
        "description": "US president acknowledges Beijing’s role in any sale as app’s owner faces 5 April deadline to find non-Chinese buyer or be hit with US ban",
        "content": "Donald Trump has said he would be willing to reduce tariffs on China to get a deal done with TikTok’s Chinese parent company ByteDance to sell the social media app used by 170 million Americans.\nHe acknowledged the role China would play in any agreem... [2710 chars]",
        "url": "https://www.theguardian.com/technology/2025/mar/27/donald-trump-china-tariffs-tiktok-deal",
        "image": "https://i.guim.co.uk/img/media/dc1241e4b4ae0afd8812cee48bdd267017520667/0_0_3496_2098/master/3496.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6147711d68000834aa64f3492ac89441",
        "publishedAt": "2025-03-27T06:03:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "Donald Trump has said he would be willing to reduce tariffs on China to get a deal done with TikTok’s Chinese parent company ByteDance to sell the social media app used by 170 million Americans.\nHe acknowledged the role China would play in any agreement. “With respect to TikTok, and China is going to have to play a role in that, possibly in the form of an approval, maybe, and I think they’ll do that,” Trump told reporters on Wednesday. “Maybe I’ll give them a little reduction in tariffs or something to get it done,” he added.\nTrump’s comment suggests the sale of TikTok’s is a priority for his administration and important enough to use tariffs as a bargaining chip with Beijing.\nTikTok did not immediately comment.\nByteDance has a 5 April deadline to find a non-Chinese buyer for TikTok or face a US ban on national security grounds that was supposed to have taken effect in January under a 2024 law.\nThe move is the result of concern in Washington that TikTok’s ownership by ByteDance makes it beholden to the Chinese government and that Beijing could use the short video app to conduct influence operations against the US and collect data on Americans.\nIn February and earlier this month, Trump added levies totalling 20% to existing tariffs on all imports from China.\nGetting China to agree to any deal to give up control of a business worth tens of billions of dollars has always been the biggest sticking point to getting any agreement finalised. Trump has used tariffs as a bargaining chip in the TikTok negotiations in the past.\nOn 20 January, his first day in office, he warned that he could impose tariffs on China if Beijing failed to approve a US deal with TikTok.\nVice-president JD Vance has said he expects the general terms of an agreement that resolves the ownership of the social media platform to be reached by 5 April.\nReuters reported last week that White House-led talks among investors are coalescing around a plan for the biggest non-Chinese backers of ByteDance to increase their stakes and acquire the video app’s US operations, according to two sources familiar with the discussions.\nThe future of the app used by nearly half of all Americans has been up in the air since a law – passed with overwhelming bipartisan support – required ByteDance to divest TikTok by 19 January.\nThe app briefly went dark in January after the US supreme court upheld the ban, but flickered back to life days later once Trump took office. Trump quickly issued an executive order postponing enforcement of the law to 5 April and said last month that he could further extend that deadline to give himself time to shepherd a deal.\nThe White House has been involved to an unprecedented level in the closely watched deal talks, in effect playing the role of investment bank.\nFree speech advocates have argued that the ban unlawfully threatens to restrict Americans from accessing foreign media in violation of the first amendment of the US constitution."
    },
    {
        "title": "Thai police looking for Singaporean man after girlfriend found dead in Bangkok room: Reports",
        "description": "Thai police are searching for a Singaporean man after his girlfriend was found dead in a room in Bangkok, local media reported on Thursday (Mar 27). Two women informed police at Thong Lor station on Wednesday that they had lost contact with their friend Praopila",
        "content": "Thai police are searching for a Singaporean man after his girlfriend was found dead in a room in Bangkok, local media reported on Thursday (Mar 27).\nTwo women informed police at Thong Lor station on Wednesday that they had lost contact with their fri... [1150 chars]",
        "url": "https://www.channelnewsasia.com/asia/thailand-police-singaporean-man-girlfriend-found-dead-bangkok-5027161",
        "image": "https://dam.mediacorp.sg/image/upload/s--jBy1a1Rg--/c_crop,h_786,w_1398,x_154,y_0/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2025/03/27/royal_thai_police_headquarters.jpg?itok=zBgyKns2",
        "publishedAt": "2025-03-27T05:59:53Z",
        "source": {
            "name": "CNA",
            "url": "https://www.channelnewsasia.com"
        },
        "scrap_content": "Thai police are searching for a Singaporean man after his girlfriend was found dead in a room in Bangkok, local media reported on Thursday (Mar 27).\nTwo women informed police at Thong Lor station on Wednesday that they had lost contact with their friend Praopilat Paladon, 30. They had not heard from her since Monday, the Bangkok Post reported.\nOfficers went to a building at Sukhumvit Soi 39 in Watthana district on Wednesday and found that the room was unlocked, with the air-conditioning switched on.\nThey found her body in the bathroom. It was wrapped in a bedsheet and blanket, according to local news outlet Khaosod English.\nBoth news outlets said the women told police that Praopilat had a 32-year-old Singaporean boyfriend.\nClosed circuit television footage from the building showed the couple in an elevator at about 6.45pm on Sunday before they left the building.\nAt about 9.15pm on the same night, the Singaporean man was seen walking her back to the room.\nShortly after midnight on Monday, he was filmed going back into the elevator to go up to the room. CCTV cameras caught him leaving the room with his luggage at about 3.15pm on Tuesday.\nTwo minutes later, he left the building and got into a black Mercedes car.\nThe police have since discovered that the car was registered in Bangkok to a dead Thai man.\nCNA has contacted Singapore's Ministry of Foreign Affairs for more information."
    },
    {
        "title": "GE2025: S’poreans can check names from March 28 in voter rolls based on new electoral boundaries",
        "description": "The updated voter rolls have taken into account the new electoral boundaries. Read more at straitstimes.com.",
        "content": "The checks can be done online, or physically at a community centre or club or a ServiceSG Centre. ST PHOTO: KUA CHEE SIONG\nGE2025: S’poreans can check names from March 28 in voter rolls based on new electoral boundaries\nSINGAPORE - From March 28, Sin... [2722 chars]",
        "url": "https://www.straitstimes.com/singapore/politics/ge2025-sporeans-can-check-names-from-march-28-in-voter-rolls-based-on-new-electoral-boundaries",
        "image": "https://cassette.sphdigital.com.sg/image/straitstimes/6acd2606abba29ebe06c96a6df6299bc392c356d09ef71c835ef2d521efcd9b8",
        "publishedAt": "2025-03-27T05:57:29Z",
        "source": {
            "name": "The Straits Times",
            "url": "https://www.straitstimes.com"
        },
        "scrap_content": "SINGAPORE - From March 28, Singaporeans who are eligible to vote in the upcoming general election can check their names in the voter rolls, which have been updated based on the new electoral boundaries.\nThey can access the Registers of Electors either through the Elections Department (ELD) website by clicking on the “Voter Services” section, or logging in through Singpass and going to “My Profile”.\nThose who cannot do so online can visit a community centre or club or a ServiceSG Centre, said ELD in a statement on March 27.\nSingaporeans can also visit the ELD office by making an appointment online through its website or by calling 1800-225-5353.\nThe latest update to voter rolls includes transferring the relevant polling district or districts to the new electoral division, based on the recommendations by the Electoral Boundaries Review Committee (EBRC).\nOn March 11, the EBRC published its report – a key sign that the next general election is around the corner. A general election must be held by November 2025.\nSingaporeans living overseas and are unable to verify their particulars online can go to a Singapore overseas mission that also serves as an overseas registration centre, of which there are 10, said ELD.\nThe missions are in Beijing, Canberra, Dubai, Hong Kong, London, New York, San Francisco, Shanghai, Tokyo and Washington, DC.\nSingaporeans whose names were removed from the voter rolls because they failed to vote in a past election can still apply to have their names restored, ELD said.\nUnder the law, Singaporeans will not be able to restore their names during the period between the Writ of Elections being issued until after Nomination Day if the election is not contested or until after Polling Day, if there is a contest.\n“They will consequently not be able to cast their vote at GE2025,” ELD said.\nIt added that overseas Singaporeans whose names are in the Registers of Electors can register to vote by post or in person at one of the 10 overseas polling stations.\nRegistration can be done through the ELD website or physically at one of the 10 Singapore overseas missions.\nTo qualify, overseas Singaporeans would have needed to have resided in Singapore for an aggregate of at least 30 days within a three-year period before the day they register to be an overseas voter.\nRegistration is open throughout the year but applications will not be processed from the third day after the election writ is issued until after Nomination Day if the election is not contested or until after Polling Day if there is a contest.\n“We encourage eligible overseas Singaporeans to register as overseas electors early if they wish to vote overseas at GE2025,” ELD said.\nJoin ST's WhatsApp Channel and get the latest news and must-reads."
    }
]