[
    {
        "title": "2025 NFL mock draft: Huge trade for Ashton Jeanty shakes up the top 10; Giants move back into Round 1 for QB",
        "description": "One last mock before the real thing",
        "content": "Round 1 - Pick 1 Cam Ward QB Miami (FL) • Sr • 6'2\" / 219 lbs Projected Team Tennessee PROSPECT RNK 3rd POSITION RNK 1st PAYDS 4313 RUYDS 204 INTS 7 TDS 43 General manager Mike Borgonzi confirmed that the Titans aren't trading the No. 1 overall selec... [11613 chars]",
        "url": "https://www.cbssports.com/nfl/news/2025-nfl-mock-draft-huge-trade-for-ashton-jeanty-shakes-up-the-top-10-giants-move-back-into-round-1-for-qb/",
        "image": "https://sportshub.cbsistatic.com/i/r/2025/04/23/1991df74-5250-4b20-8bc6-d54bfd8d43f0/thumbnail/1200x675/916a3eec2f9d2a4e6408882c8190eb48/ashton-jeanty.jpg",
        "publishedAt": "2025-04-23T23:00:46Z",
        "source": {
            "name": "CBS Sports",
            "url": "https://www.cbssports.com"
        },
        "scrap_content": "Welcome to my final mock draft of the 2025 NFL Draft cycle, where I spew incorrect takes throughout the first round that will kick off from Green Bay, Wisconsin, on Thursday night.\nWell, they won't all be wrong. The first three picks (and maybe even the Patriots' selection at No. 4) seem to be set with Cam Ward going to the Titans, Travis Hunter ending up with the Browns, Abdul Carter landing with the Giants and Will Campbell off to New England. But from when the Jaguars are on the clock at No. 5 to when the Eagles close out Round 1 at No. 32? Who the hell knows.\nIn my attempt at predicting the unpredictable, I have the Bears trading up to the fifth pick for Ashton Jeanty and the Jaguars moving back to 10th to snag Tetairoa McMillan. The Rams and Bills also trade up -- one for a tight end, the other for a cornerback -- while the Giants jump back into the first round, but not for Shedeur Sanders. And to close things out, Philadelphia gets yet another playmaker in an offense full of them.\nWe'll know soon enough who your favorite team selects in Round 1, but for now, sit back, relax, and take a gander at who your franchise will almost certainly not take (aside from the first four picks!).\nFor more draft coverage, you can hear in-depth analysis on \"With the First Pick\" -- our NFL Draft podcast with analyst Ryan Wilson and former Titans general manager Ran Carthon. You can find \"With the First Pick\" wherever you get your podcasts: Apple Podcasts, Spotify, YouTube, etc. Listen below!\nThe 2025 NFL Draft will take place from Thursday to Saturday at Lambeau Field in Green Bay, Wisconsin. More draft coverage can be found at CBSSports.com, including daily mock drafts, consensus prospect rankings, and more."
    },
    {
        "title": "Pradel perfect in U18 opener",
        "description": "Slovakian goaltender stops 34 shots and also shuts the door in the shootout",
        "content": "Casual hockey fans might scroll through the scores and see a 1-0 final and think, ‘what a yawner of a game’.But, no, the game between Finland and Slovakia was anything but boring as this game had a bit of everything – Grade A chances by both teams, a... [3739 chars]",
        "url": "https://www.iihf.com/en/events/2025/wm18/news/66643/svk_fin",
        "image": "https://blob.iihf.com/iihf-media/iihfmvc/media/2025/wm18/wm18/games/g01_svk_v_fin/gm_01_141951_svk_fin_ta_029.jpg",
        "publishedAt": "2025-04-23T22:47:29Z",
        "source": {
            "name": "IIHF",
            "url": "https://www.iihf.com"
        },
        "scrap_content": "But, no, the game between Finland and Slovakia was anything but boring as this game had a bit of everything – Grade A chances by both teams, a number of ten-bell saves by Finland’s Patrik Kerkola and Slovakia’s Michal Pradel and, even, a penalty shot goal that was determined to be no goal.\nThe Finns and Slovaks put it all out there to entertain fans during the opener of the 2025 IIHF World Men’s Under-18 Championship at the Credit Union of Texas Event Center in Allen and the exciting game ended in an exciting manner. Three periods and the three-on-three overtime settling nothing before Michal Svrcek and Alex Misiak scored in the shootout to give Slovakia a thrilling 1-0 victory over Finland.\n\"Amazing feeling for me, for our team,\" said Misiak. \"Our first win in our first game for the tournament and we hope we will have many more.\"\nAnd though it was Misiak’s beautiful backhand to forehand shootout goal that gave Slovakia the win and two points in the standings (Finland settled for one point in the shootout loss), the Slovakian hero on this day was goaltender Pradel, who out-dueled his Finnish counterpart Patrik Kerkola just a bit for the win. Both goaltenders were tremendous and Pradel and Kerkola were named players of the game for their respective teams.\nPradel stopped 34 shots through three periods in overtime and then added four more stops in the shootout for good measure. Kerkola was perfect through 65 minutes as well with 26 saves, but couldn’t stop them all, with Svrcek’s snapshot and Misiak’s perfect deke producing the only shootout goals in this game.\n\"The game was good and I think I played a good game,\" said a disappointed Kerkola.\nPradel had a number of incredible saves but one in overtime sticks out as the best. With just under three minutes to play in the three-on-three frame, Finland’s Jesper Kotajarvi found some open ice in the slot, and awaited a perfect pass from Juho Piiparinen. Kotajarvi one-timed the puck but Pradel slid across and kicked out his toe to keep the game scoreless.\nPradel said he wasn't feeling extra pressure as the game wore on, knowing that the goalie at the other end wasn't allowing anything in, either.\n\"It was a good game from our side. We tried hard and we won so that’s the main point,\" said Pradel. \"I think I always try to be focused. I don’t think about what other players do, just focus on myself and my job.\"\nThe Slovaks appeared to take a 1-0 lead in the second period. Tomas Chrenko had a breakaway but was slashed by Finland’s Appo Vanninen. Although Chrenko didn’t get a shot off, he was awarded a penalty shot.\nOn the ensuing penalty shot, Chrenko went forehand to backhand back to forehand and stuffed the puck in past Kerkola. One zip Slovakia, right? Not so fast. The referees on the ice determined that Chrenko took a second shot to jam the puck in on the penalty shot and that decision was upheld a few minutes later upon video review.\nTo make matters worse, the Slovaks weren’t able to score on a powerplay they were awarded moments after Chrenko’s breakaway, with Finland’s Kotajarvi in the box for slashing. It was a bit of a double whammy on Team Slovakia and gave the Finns a boost.\nWith under five minutes to play in the second, Finland’s Max Westergard forced a turnover and had a breakaway but his quick snap shot was turned aside by Pradel, another memorable moment of the game.\nThe teams showed their competitive fire with an after-whistle scrum in Slovakia’s end late in the second as the Slovakia defence didn’t like Westerberg stabbing at what looked like a loose puck that was grabbed by Pradel.\nBoth teams return to action on Thursday, with Finland taking on Norway and Slovakia facing Canada. The Slovaks have finished fourth in back-to-back U18s and would love to reach the podium for the first time since 2003. Finland won brone in 2022 but had disappointing finishes the past two years."
    },
    {
        "title": "Knicks' Jalen Brunson named Kia NBA Clutch Player of the Year Award winner",
        "description": "No player was more effective than Knicks guard Jalen Brunson in the final 5 minutes of the 4th quarter or OT in close games.",
        "content": "• Download the NBA App\n• 2024-25 NBA Awards:Complete coverage\n• Kia Clutch Player Award: All-Time Winners\nNew York Knicks guard Jalen Brunson is the recipient of the Jerry West Trophy as the 2024-25 Kia NBA Clutch Player of the Year.\nThe award, which... [1177 chars]",
        "url": "https://www.nba.com/news/kia-clutch-player-award-2024-25-jalen-brunson",
        "image": "https://cdn.nba.com/manage/2025/04/16x9jb.png",
        "publishedAt": "2025-04-23T22:46:52Z",
        "source": {
            "name": "NBA",
            "url": "https://www.nba.com"
        },
        "scrap_content": "• Download the NBA App\n• 2024-25 NBA Awards:Complete coverage\n• Kia Clutch Player Award: All-Time Winners\nNew York Knicks guard Jalen Brunson is the recipient of the Jerry West Trophy as the 2024-25 Kia NBA Clutch Player of the Year.\nThe award, which was first presented in the 2022-23 season, honors the NBA player who best comes through for his teammates late in close games. A global media panel of 100 voters selected the winner based on nominations from NBA head coaches.\nIn the 2024-25 regular season, Brunson averaged an NBA-high 5.6 points in clutch situations, which are defined as possessions in the final five minutes of the fourth quarter or overtime when the score is within five points. In those instances, he also led the league in field goals made (52) and ranked second in total points (156) and third in total assists (28).\nBrunson shot 51.5% from the field and 84.0% from the free throw line in clutch time. In the 28 clutch games in which he played, the Knicks had a record of 17-11.\nOverall, Brunson averaged 26.0 points and 7.3 assists in 35.4 minutes in 65 games this season. He ranked eighth in the NBA in both points and assists per game. Brunson was selected as an NBA All-Star for the second season in a row.\nThe complete voting results for the 2024-25 Kia NBA Clutch Player of the Year Award are below. The balloting was tabulated by the independent accounting firm Ernst & Young LLP."
    },
    {
        "title": "Cubs Sign Nicky Lopez, Designate Gage Workman",
        "description": "The Cubs signed free agent infielder Nicky Lopez to a big league contract. Read more about the move at MLB Trade Rumors.",
        "content": "The Cubs announced Wednesday that they’ve signed infielder Nicky Lopez to a big league deal. Infielder and Rule 5 pick Gage Workman was designated for assignment to open a spot on the roster. Photographer Sam Bernero first spotted Lopez heading into ... [4005 chars]",
        "url": "https://www.mlbtraderumors.com/2025/04/cubs-sign-nicky-lopez-designate-gage-workman.html",
        "image": "https://cdn.mlbtraderumors.com/files/2025/03/nicky-lopez-cubs-1024x683.jpg",
        "publishedAt": "2025-04-23T22:35:25Z",
        "source": {
            "name": "MLB Trade Rumors",
            "url": "https://www.mlbtraderumors.com"
        },
        "scrap_content": "The Cubs announced Wednesday that they’ve signed infielder Nicky Lopez to a big league deal. Infielder and Rule 5 pick Gage Workman was designated for assignment to open a spot on the roster. Photographer Sam Bernero first spotted Lopez heading into Wrigley Field this afternoon and tweeted out a photo she snapped. Shane Riordan of 670 The Score subsequently reported that Lopez, an Octagon client, was signing a major league deal.\nChicago also selected the contract of recently acquired lefty Drew Pomeranz, optioned righty Gavin Hollowell to Triple-A Iowa and transferred lefty Justin Steele from the 15-day IL to the 60-day IL (thus opening a 40-man spot for Pomeranz). Steele recently underwent elbow surgery and will miss the remainder of the 2025 season, so his move to the 60-day IL was a formality.\nLopez was with the Cubs as a non-roster invitee in spring training but didn’t make the Opening Day club. He opted out of that deal and signed with the Angels, who needed some infield depth due to a handful of injuries. The Halos reinstated shortstop Zach Neto last week and designated Lopez for assignment, after which he elected free agency.\nThe 30-year-old Lopez appeared in five games and was hitless in six plate appearances in his short stint with the Angels. He’ll hope for a larger look with the Cubs, who have some questions in the infield after optioning struggling top prospect Matt Shaw and seeing the now-designated-for-assignment Workman struggle at the hot corner as well. Veteran utilityman Jon Berti has been seeing more time at third base recently, though he hasn’t hit much either — just .250/.344/.250 in an admittedly small sample of 32 plate appearances.\nLopez, like Berti, brings a versatile and high quality glove to the Cubs. He’s spent the bulk of his career in the middle infield where he grades as a plus-plus defender at both positions. He’s less experienced at third base but still has strong grades in nearly 400 frames there (7 Defensive Runs Saved, 6 Outs Above Average).\nExcellent as Lopez is on the defensive side of the coin, his bat leaves plenty to be desired. He’s a career .247/.311/.313 hitter in 2352 plate appearances at the MLB level, and even that modest production is skewed by what now looks like a clear outlier campaign in 2021, when he batted .300/.365/.378. In three-plus seasons since that time, Lopez has limped to a .232/.301/.286 line between the Royals, Braves, White Sox and Angels.\nWorkman, 25, was selected out of the Tigers organization in December’s Rule 5 Draft and made the Opening Day roster after he hit .364/.420/.705 in 50 spring plate appearances. He hasn’t carried that outstanding production over to the regular season. He’s appeared in nine games but tallied only 15 plate appearances, during which he’s gone 2-for-14 with a walk. Workman never got a true look with the Cubs, which isn’t surprising, as it’s difficult for contending clubs to carry a career minor leaguer who can’t be optioned to the minors.\nWorkman is viewed as a plus defender at third base with plenty of raw power and too much swing-and-miss in his offensive profile. He spent the 2024 season with the Tigers’ Double-A affiliate, where he batted .280/.366/.476 with 18 homers, 30 steals, an 11.7% walk rate and a bloated 27.5% strikeout rate in his third season of action at that level. He’s yet to appear in a Triple-A game.\nNow that he’s been designated for assignment, Workman will be placed on outright waivers and offered to the rest of the league (excluding the Tigers). If he goes unclaimed, he will by rule be offered back to the Tigers for $50K.\nThe veteran Pomeranz hasn’t pitched in the majors since 2021 due to a lengthy series of injuries. He inked a minor league deal with the Mariners in the offseason and tossed 9 2/3 frames with their Triple-A affiliate in Tacoma before being traded to the Cubs for cash. He allowed five earned runs (4.66 ERA) on nine hits and six walks (plus two hit batsmen) during that short stint with Tacoma. Clearly, Pomeranz’s command was an issue, but he also fanned 14 of his 43 opponents (32.6%) and sat 92.3 mph on his heater — a good bit north of the 90-91 mph he was sitting at during minor league stints with the Padres and Dodgers over the past two seasons."
    },
    {
        "title": "NRL approves fresh Perth bid to bring back the Bears",
        "description": "The ARL Commission on Wednesday morning agreed to an increased offer from Western Australia premier Roger Cook.",
        "content": "The ARL Commission has agreed in principle to a revised proposal from the Western Australia government for an NRL team in Perth.\nThe Herald can reveal that the ARLC met on Wednesday morning and signed off on an increased offer from WA Premier Roger C... [428 chars]",
        "url": "https://www.smh.com.au/sport/nrl/nrl-approves-fresh-perth-bid-to-bring-back-the-bears-20250423-p5ltss.html",
        "image": "https://static.ffx.io/images/$zoom_0.4483%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_52/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/1376a68c1703fccf3397d51288027bca1b533ba1",
        "publishedAt": "2025-04-23T22:30:00Z",
        "source": {
            "name": "The Sydney Morning Herald",
            "url": "https://www.smh.com.au"
        },
        "scrap_content": "The ARL Commission has agreed in principle to a revised proposal from the Western Australia government for an NRL team in Perth.\nThe Herald can reveal that the ARLC met on Wednesday morning and signed off on an increased offer from WA Premier Roger Cook, paving the way for the Bears to return on the west coast from 2027.\nThe in-principle agreement must also be signed off by the clubs and the Rugby League Players’ Association (RLPA) before the NRL can go back to the WA government with its position.\nSources with knowledge of the situation, speaking on the condition of anonymity, told the Herald the NRL had organised a meeting for Thursday with a subcommittee of NRL clubs.\nThe NRL will also discuss the submission with the RLPA after receiving the tick of approval from the commission to take the proposal to the sport’s major stakeholders.\nNegotiations between the NRL and WA government appeared to have ended earlier in the month, with both parties unable to find common ground.\nAfter rejecting a bid from a private consortium, the NRL has been in negotiations with the WA government for several months about a franchise in Perth and a formal affiliation with former first grade team the North Sydney Bears.\nEarlier this month, the Perth NRL expansion bid was on life support when Cook accused the NRL of treating the state as a “cash cow”.\nAt the time, the government was willing to commit to a $20 million centre of excellence at the Malaga Sports Precinct development, situated 13km from the Perth CBD.\nThere was also a commitment to invest up to $35 million over five years in grassroots development, through the secondary schools system and the Indigenous Clontarf Foundation. The NRL was seeking $120 million over 10 years. Sources with knowledge of the situation said both parties had given ground in the negotiations to find a compromise.\nThe NRL had previously rejected a bid by a private consortium headed by Cash Converters boss Peter Cummins after it decided it would not pay a licence fee. The bid later proposed a $20 million licence fee, but the NRL said it would instead work with the WA government to set up a team.\nUnder the operating model proposed, the NRL will have control of the team in its start-up years before handing over the organisation to the club’s members and elected directors.\nFor its part, the WA government would help fund community, pathways, development and infrastructure projects.\nMichael Chammas and Andrew “Joey” Johns dissect the upcoming NRL round, plus the latest footy news, results and analysis. Sign up for the Sin Bin newsletter.\nNRL is Live and Free on Channel 9 & 9Now"
    },
    {
        "title": "Mikel Arteta reaction - What did Arsenal boss say after conceding late equalizer vs Crystal Palace?",
        "description": "Liverpool are on the brink of clinching the Premier League title after Jean-Philippe Mateta scored a brilliant chip for a 2-2 draw with Mikel Arteta's side on Tuesday.",
        "content": "So, the Premier League title race will go until at least Sunday, when Liverpool host Tottenham Hotspur at Anfield (11:30 am ET), but only just barely after Arsenal conceded late and settled for a 2-2 draw with Crystal Palace in north London on Tuesda... [2483 chars]",
        "url": "https://www.nbcsports.com/soccer/news/mikel-arteta-reaction-what-did-arsenal-boss-say-after-conceding-late-equalizer-vs-crystal-palace",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/5a1f162/2147483647/strip/true/crop/5868x3301+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F8a%2F8c%2F5fbb77564f6289ccb26f0d15ebcf%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2211113611",
        "publishedAt": "2025-04-23T22:22:37Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "scrap_content": "So, the Premier League title race will go until at least Sunday, when Liverpool host Tottenham Hotspur at Anfield (11:30 am ET), but only just barely after Arsenal conceded late and settled for a 2-2 draw with Crystal Palace in north London on Tuesday.\nARSENAL 2-2 CRYSTAL PALACE - Highlights, recap & analysis\nMikel Arteta’s side remains largely focused on their upcoming UEFA Champions League semifinal tie against PSG which begins next Tuesday (3 pm ET), but the Gunners are still the only side that could delay the Reds clinching the title any longer, even if they accepted their fate as likely runners-up weeks ago. Regardless, Liverpool’s fate is in their own hands with a 12-point lead and five games left to play; a win or draw on Sunday would make it an insurmountable 15- or 13-point gap with four to go for both sides.\nMikel Arteta reaction — What did Arsenal boss say after late draw with Crystal Palace?\n“We are disappointed with the result and performance. We didn’t find enough consistency in actions to dominate the game. It’s part of football and cost us two points. It can be difficult. In many aspects of the game, we should have done better today. We require the consistency. Today they were very organized and deserved credit. We have to do much better.”\n…\n“It can be very difficult, but that’s the standard required in the Premier League. In many aspects of the game we should have done better today.”\n…\n\"[Crystal Palace] were very organized and they deserve the credit, but as well we have to be critical with ourselves and we know that we have to do much better.”\nOn mistakes costing them: “For sure, it costs you points. It’s part of football. We have the most important game of the season in six games. We need to get our energy back.”\n…\n“We haven’t been able to see the games off and the margins have been too small, several times with ten men. Especially when we have been ahead in games, especially in the second half we have to be able to see the game off.”\nLeandro Trossard, on the disappointing result vs Crystal Palace\n“The quality just wasn’t there today. Compared to the last game [vs Ipswich], we were nowhere near it. It has to be better, because there’s a big game coming up for [vs PSG] and we need to raise the level.”\n…\n\"[Minds] shouldn’t be [elsewhere], we want to win every game in any competition. Especially today after the last game, we had a good feeling and it just needs to be better.”\n…\n“I think just the basics [are missing] sometimes. Not passing on the right foot or taking it too easy, a touch too much. I speak for myself as well, just in general it wasn’t good enough. We need to raise that level in the next few days, rest up now and in a week’s time we have to be out there.”"
    },
    {
        "title": "Palace’s Mateta punishes Arsenal muddle to leave Liverpool one point from title",
        "description": "Crystal Palace substitute Jean-Philippe Mateta finished superbly after slack defending to make it 2-2 as the Premier League title slipped further out of Arsenal’s sight",
        "content": "Liverpool’s coronation as Premier League champions will have to wait a few more days, although it’s only a matter of when, not if. In a match that could have represented a microcosm of their domestic season, Arsenal appeared to be heading towards a n... [5456 chars]",
        "url": "https://www.theguardian.com/football/2025/apr/23/arsenal-crystal-palace-premier-league-match-report",
        "image": "https://i.guim.co.uk/img/media/f1df68339cbeb92b4ccfed0158e96954f9928c40/0_135_4842_2905/master/4842.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=72bc2e880048e2a75a2688a5925a6224",
        "publishedAt": "2025-04-23T22:16:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "Liverpool’s coronation as Premier League champions will have to wait a few more days, although it’s only a matter of when, not if. In a match that could have represented a microcosm of their domestic season, Arsenal appeared to be heading towards a narrow victory against a dogged Crystal Palace side. Eberechi Eze’s brilliant volley had cancelled out Jakub Kiwior’s early opener but Leandro Trossard then restored the Gunners’ lead.\nHowever, an uncharacteristic mistake from William Saliba allowed Jean-Philippe Mateta, on as a substitute, to equalise with seven minutes to play and secure a deserved point for Palace, who will now head to Wembley for their FA Cup semi-final against Aston Villa on Saturday brimming with confidence.\nLiverpool’s players had gathered to watch events unfold in north London knowing that a defeat would seal a record-equalling 20th league title with five games still to play. As it is, they have a 12-point lead and a vastly superior goal difference, with a draw against Tottenham on Sunday all that is required to make it official.\nAt least Arsenal – who look destined to end up as runners-up for a third year in row, having drawn nine games this season from winning positions and 13 in total – still have the consolation of their Champions League semi-final against Paris Saint-Germain next week.\n“The game wasn’t grabbed like we normally do,” said Mikel Arteta, who revealed that Ben White and Mikel Merino are doubts to face PSG after being left out due to unspecified injuries. “We have to wait and see but they weren’t able to be in the squad tonight.”\nArteta insisted beforehand that, as well as delaying Liverpool’s title procession, Arsenal had an incentive to win this game to maintain the momentum of their victories against Real Madrid. Reports emerged just before kick-off that Arsenal have opened talks with Thomas Partey over extending his contract which expires in the summer having previously seemed set to depart – surely a reward for some consistently commanding performances in central midfield this season, even if his suspension from the first leg against PSG will give Arteta a headache.\nPalace have previously played the role of party poopers when they famously came back from 3-0 down against Liverpool in 2014 to virtually assure Manchester City of the title. With one eye on their own big day out at Wembley, there didn’t seem to be much chance of history repeating itself this time – especially when Kiwior rose unmarked to head in Martin Ødegaard’s free-kick in the third minute.\nOliver Glasner, who complained that Palace had been put at a disadvantage after getting 24 hours less than Villa to prepare for their meeting on Saturday, was delighted with how his much-changed team refused to give up. “The response of the players was unbelievable,” the Palace manager said. “I’m very proud of them.”\nArsenal’s unbeaten record in all competitions stretches back to the end of February, although four draws in their previous seven Premier League matches had undermined any chance of catching Liverpool.\nDeclan Rice was inches away from doubling his side’s lead when he flashed a shot just wide but Palace had been more than holding their own when they summoned up a spectacular equaliser. Arsenal’s defenders didn’t seem to have noticed Eze on the edge of the box for a corner and he was picked out perfectly by Adam Wharton to volley the ball in off the post.\nIt could have been even better for Palace had Kiwior not been on hand to block Eddie Nketiah’s shot after another immaculate piece of skill from Eze to set him up. Suddenly Arsenal’s supporters were venting their frustrations. Yet after scoring twice at the weekend, Trossard continued his rich vein of form when he squeezed a shot past Dean Henderson via a deflection off Jefferson Lerma on the stroke of half-time to restore their lead.\nThe Palace goalkeeper needed treatment at the start of the second half when Nketiah clattered into him as he attempted to head away a free-kick but Henderson was able to continue. The introduction of Bukayo Saka off the bench on the hour drew almost as big a roar as either of the home side’s goals as Arsenal attempted to put the game to bed.\nJustin Devenny spurned a massive opportunity for Palace to draw level again when he failed to make proper contact with an Ismaïla Sarr cross before David Raya denied Marc Guéhi from the resulting corner. Somehow Sarr could not get enough power behind his header after Daniel Muñoz headed another corner across the face of goal as Palace piled on the pressure.\nGabriel Martinelli thought he had settled matters when he touched in Jurriën Timber’s cross but VAR eventually ruled that the ball had already gone out of play. A stunning save from Henderson kept out Saka’s volley from close range and it was to prove vital as Mateta pounced on the ponderous Saliba’s error and chipped the stranded Raya to send the travelling supporters behind his goal home ecstatic."
    },
    {
        "title": "Mike Patrick, Voice of Sunday Night N.F.L. Games on ESPN, Dies at 80",
        "description": "He did the cable network’s play-by-play for college basketball, football and baseball games, but his most important assignment was “Sunday Night Football.”",
        "content": "Mike Patrick, a versatile sportscaster for ESPN who called National Football League games on Sunday nights for 18 years, died on Sunday in Fairfax, Va. He was 80.\nHis death, in a hospital, was confirmed by his physician, Dr. Mark Vasiliadis. Kevin Ki... [601 chars]",
        "url": "https://www.nytimes.com/2025/04/23/sports/football/mike-patrick-dead.html",
        "image": "https://static01.nyt.com/images/2025/04/23/multimedia/23Patrick--03-gvjk/23Patrick--03-gvjk-facebookJumbo.jpg",
        "publishedAt": "2025-04-23T22:09:21Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "scrap_content": null
    },
    {
        "title": "Arsenal 'dropped standards' in Crystal Palace draw",
        "description": "Mikel Arteta admitted Arsenal \"dropped our standards\" in Wednesday's 2-2 draw against Crystal Palace, which leaves Liverpool on the brink of winning the Premier League.",
        "content": "Shaka Hislop and the \"ESPN FC\" crew discuss what went wrong for Arsenal in their 2-2 draw against Crystal Palace. (2:28)\nShaka Hislop: Arsenal never got out of 2nd gear vs. Crystal Palace (2:28)\nOpen Extended Reactions\nLONDON -- Mikel Arteta admitted... [2191 chars]",
        "url": "https://www.espn.com/soccer/story/_/id/44822951/arsenal-dropped-standards-crystal-palace-draw-mikel-arteta",
        "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0423%2Fr1483019_1296x729_16%2D9.jpg",
        "publishedAt": "2025-04-23T22:07:00Z",
        "source": {
            "name": "ESPN",
            "url": "https://www.espn.com"
        },
        "scrap_content": "LONDON -- Mikel Arteta admitted Arsenal \"dropped our standards\" in Wednesday's 2-2 draw against Crystal Palace, which leaves Liverpool on the brink of winning the Premier League.\nJean-Philippe Mateta's 83rd-minute equaliser denied Arsenal victory at Emirates Stadium, meaning Arne Slot's side only need a point against Tottenham Hotspur on Sunday to be crowned English champions for a record-equalling 20th time.\nArsenal took the lead through Jakub Kiwior's third-minute header before Eberechi Eze equalised on 27 minutes with a superb volley from Adam Wharton's corner.\nLeandro Trossard restored Arsenal's advantage three minutes before the break but Arsenal were never convincing at the back and William Saliba's late error gave Mateta, on as a substitute just three minutes earlier, a chance he took brilliantly, beating David Raya from 30 yards as he scrambled back towards goal.\n\"We dropped our standards today and credit to Crystal Palace,\" Arteta said.\n\"We struggled to find consistency in the game. We gave the ball away in simple ways and we were late in everything we did. I am disappointed.\"\nTrossard vowed Arsenal will deliver a much better display when hosting Paris Saint-Germain in Tuesday's Champions League semifinal first leg.\n\"The quality today wasn't there compared to our last game [a 4-0 win at Ipswich Town],\" Trossard said.\n\"We were nowhere near that and we got punished. We need to raise the level with our big game coming up. It will be good to have six days now and prepare for this [PSG] game with 100% focus.\n\"It will be a different performance.\"\nPalace remained in 12th place and have little to play for in the Premier League. They are, however, heading into an FA Cup semifinal game against Aston Villa on Saturday in better heart.\n\"It's important to keep this energy and confidence for the semifinal on Saturday,\" Palace manager Oliver Glasner said.\n\"It was not our goal to decide the title, it was our goal to win the game. I think a draw is a very good result. More important is the performance. We are back on the track.\"\nInformation from The Associated Press was used in this report."
    },
    {
        "title": "Virgil van Dijk: How Liverpool captain became world's best",
        "description": "As Virgil van Dijk prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.",
        "content": "Van Dijk joined Willem II's then-acclaimed academy in 2001 as a 10-year-old.\nIt was a club that had defied the odds just a few years earlier by finishing second in the Eredivisie in 1998-99 and reaching the Champions League.\nShortly after his arrival... [1679 chars]",
        "url": "https://www.bbc.com/sport/football/articles/cd9le3v7n8eo",
        "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c618/live/bf741ef0-1f92-11f0-9060-674316cb3a1f.png",
        "publishedAt": "2025-04-23T22:00:37Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "Suddenly he was back where it all began.\nLast month Virgil van Dijk made a secret visit to his old Dutch club Willem II to bring back a youth football tournament.\nHe said: \"It's my way of giving back and helping nurture the next generation of world-class talent. This tournament gives rising stars the platform they need to take the next step towards their dreams.\"\nFittingly, the next edition of the 'Virgil Legacy Trophy' in September will feature all of the clubs where Van Dijk played in his career, plus the likes of Arsenal, Manchester City and PSG.\nAnd it was in Tilburg, a Dutch city in the southern province of North Brabant, where the current Liverpool captain gained invaluable insights about football and life.\nAs he prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.\n'Some youth managers even saw him as lazy'\nVan Dijk joined Willem II's then-acclaimed academy in 2001 as a 10-year-old.\nIt was a club that had defied the odds just a few years earlier by finishing second in the Eredivisie in 1998-99 and reaching the Champions League.\nShortly after his arrival, Jan van Loon was installed as academy director.\n\"There was actually no striker who stood a chance against him,\" Van Loon said. \"He was physically strong and he had a natural talent to take balls off opponents at exactly the right moment.\n\"I remember in games we would sometimes say to him: 'Watch out Virgil, there is an opponent behind you.' He would be very relaxed, like: 'Yeah, OK, no worries.'\n\"I recall a game against Ajax, where he would mark their best player. We were saying 'make sure he doesn't touch any ball,' and that's exactly what Virgil would do.\"\nYet there was still room for improvement,\nVan Loon, added: \"So now and then he could come across as laconic, a bit too easy going. Maybe at times some youth managers even thought of him as lazy.\"\nThat image was partly created by his timekeeping, as Van Dijk would sometimes arrive late for training sessions.\nIt even got to the point where some coaches wondered whether the young defender should remain at the club.\nBut when Van Loon took a closer interest in the young footballer, he also gained insight into Van Dijk's personal life.\nHe said: \"His parents were divorced and at times he had to look after his younger brother and sister. Sometimes he had to take them from school and make them lunch, before jumping on the bus to Willem II.\n\"That meant he could be late now and then, and if I asked him about the reasons he would always explain in detail what had happened.\n\"One time I remember his little brother had asked him for peanut butter on his bread, something he had to go and get in the supermarket - and subsequently he just missed the bus. That period has shaped him both as a human and footballer.\"\n'It takes a village to raise a child'\nVan Dijk's impressive performances finally saw him offered a chance to play for the second team, when he was playing for Willem's under-19s.\nBut on the day of the match he had to submit a report for school, which he hadn't completed. School was paramount for the club, so he risked missing his big break,\n\"I said to Virgil: 'Let's look for a solution together',\" Van Loon added. \"He was really popular with his classmates, not because he was a footballer but just as a human being.\n\"He asked a few of his peers and everything was done in time. Not that they wrote the assignment, but they did help him. The night before the game I got a message from the teacher saying everything was fine.\n\"That teacher also played his part. That's why I always say it takes a village to raise a child. You need several people around you to push you in the right direction.\"\nVan Loon, who also had a spell as head of coaching at Arsenal's academy, noticed how Van Dijk nurtured his people skills by recognising who could help him.\nHe said: \"He developed a skill to assemble people around him who would be best for his career. He would ask for extra attention from the best staff members, because he instinctively felt they could make him better.\n\"That was very special, I also saw that with players like Bukayo Saka and Frenkie de Jong, who was also in the academy of Willem II.\n\"At the club there was an exercise physiologist, who knew how to relate strength training to the role of centre-back. When exercises were finished, Virgil said: 'No, we'll continue for a while.' There you could see his inner drive, even though some other coaches had an impression that he was lazy.\"\n'My body was broken and I couldn't do anything'\nAs a teenager, Van Dijk combined his time playing at the Willem II academy with a part-time job as a dishwasher.\nBut, despite growing in stature and switching from right-back to centre-back, not everyone was convinced by Van Dijk at Willem and clubs hesitated to offer him a first professional contract.\n\"Inside the club there wasn't a unanimous opinion about him and I think Virgil felt that, that the opinions of the technical people were divided,\" Van Loon said.\nFC Groningen took the opportunity and signed a 19-year-old Van Dijk in 2010 - despite Willem finally making him an offer.\nThe defender felt his own club were late with their offer and opted to take a different path in his career.\nHe made his professional debut in May 2011 and impressed in his first full season the year after - until serious illness stopped him in his tracks.\nIt took two trips to different hospitals to diagnose him with appendicitis, peritonitis and a kidney infection, and he had to be operated on straight away.\nVan Dijk, said at the time: \"My body was broken and I couldn't do anything. At such a moment, the worst scenarios are whizzing around your head. For the first time in my life, football was very much a side issue. My life was at risk.\n\"At some point I had to sign some papers. It was a kind of testament. If I died, a part of my money would go to my mum.\"\n'Probably the best I've worked with as a manager'\nThe operation went well but, despite a quick recovery and some impressive performances, the top clubs in Holland didn't express a big interest.\nIt was then Celtic signed him for about £2.5m in 2013.\n\"He came in the first day and trained. I had a chat with him and said 'enjoy yourself here because I don't think you'll be here long',\" then manager Neil Lennon recalls.\n\"He's got pace, composure, physicality, technically brilliant. The progress was impossible to stop. He was such a good player - probably the best I've worked with as a manager.\"\nAfter two seasons, including two league titles and a Scottish Cup, Van Dijk moved to Southampton.\n\"I always thought he had the game and he's proven that,\" said Lennon. \"He could play for any team in the world and I'm surprised Manchester United or Manchester City, Barcelona or Real Madrid didn't come in and buy him rather than Liverpool at the time.\"\nVan Dijk became the world's most expensive defender when he signed for Liverpool in 2018 for £75m.\nHe has since won the Champions League, Premier League, an FA Cup, two League Cups, the Club World Cup and won the 2019 UEFA player of the year award. He is now just one win away from his second Premier League title.\nVan Loon, said: \"He has adapted to new and more challenging situations. He has become captain and the way he deals with the coaching staff and press is very impressive.\n\"I'm very proud of what he has achieved. And he did it himself, there is no-one who solved things for him.\n\"He had to pull the strings and take the initiative. It gives such a boost to young people who may also start with nothing and who work to achieve their goals in life.\""
    }
]