[
    {
        "title": "Joyous junkyard beauties: how Leilah Babirye fled death to create towering works of togetherness",
        "description": "The UK supreme court’s recent gender ruling made me think of the sublime sculptures – created from trash – by this artist who escaped persecution in Uganda. They stand for peace over prejudice, unity over division",
        "content": "In 2022, two wooden sculptures stood on the riverbanks of Brooklyn. Configured as bodies with multiple heads, the monumental works – part of a larger group titled Agali Awamu, which translates as “Togetherness” – towered over those who interacted wit... [4729 chars]",
        "url": "https://www.theguardian.com/artanddesign/2025/apr/25/leilah-babirye-togetherness-supreme-court-ruling-sculptures",
        "image": "https://i.guim.co.uk/img/media/e80c7ca4afdb717e3a2e91307362fc3bf0939463/26_111_1604_962/master/1604.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fc7e4934ab12533ba7c3a5fef9b4a8df",
        "publishedAt": "2025-04-25T17:02:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "In 2022, two wooden sculptures stood on the riverbanks of Brooklyn. Configured as bodies with multiple heads, the monumental works – part of a larger group titled Agali Awamu, which translates as “Togetherness” – towered over those who interacted with them. They appeared as an antidote to the silver, white or green reflective buildings that stood behind them: hand-carved and human-like, with mouths that appeared to be singing or whistling, and eyes barely open, perhaps to signify a joyous introspection. While one was made up of two bodies conjoined at the hip, the other had billowing hair and carried faces on its back and belly, which seemed to be singing in harmony. The sculptures looked peaceful, and protective of each other and of those who walked past them.\nFrom far away these figures, created by the Ugandan-born, New York-based artist Leilah Babirye, looked regal. They stood tall, adorned with glistening belts and jewellery. But up close, you noticed that their ornaments were made up of rusty chains, old wire, used bolts and bicycle parts – objects once discarded, deemed as meaningless, but whose beauty had been noticed by the artist. She reused them for a celebratory monument of power and protection.\nBabirye is known for recycling discarded items for her sculptures. Consider it a metaphor for how she and her LGBTQ+ community have been treated in her native Uganda, where being queer is still punishable by death. After the country’s anti-homosexuality bill was passed in 2013, and the artist was publicly outed in the homophobic Ugandan press, Babirye fled to the US to seek asylum, having initially been awarded a residency on Fire Island, New York.\nUsing art to upend negative stereotypes and challenge dismissive remarks, Babirye’s huge sculptures stand up to the silencing of her communities, transforming rubbish into a site of possibility: recycling pens and bottle-caps to make a crown; evoking long hair with an old bike chain.\n“When you look at trash, it’s something that everybody throws out,” she told me. “It’s something that doesn’t hold any value any more to a person who considers it trash at that particular time […] So the only way to bring the value of us – the ‘trash’ – is by showing how important we are, how vocal we can be, how professional we can be, and how talented we are.”\nI thought of Babirye’s sculptures – that can range from single heads and talismans to giant ceramic clan-like communities – in the wake of the UK supreme court’s ruling that trans women are not recognised as women, nor trans men as men, under the 2010 Equality Act. The judgment has not only caused distraction from other urgent court rulings and news, but will inflate culture wars and boost violence towards an already extremely vulnerable group who make up less than 1% of the population.\nThe ruling will surely have a detrimental health and emotional impact on trans and non-binary people, and could force public organisations to change their policies on inclusion and single-sex spaces in ways that puts trans people at risk. But, as the artist Victoria Cantons reminds me, the decision is also “a gateway for more control on women” and will “push women’s and men’s roles into more binary structures, which will be detrimental for women’s rights in general”. She also pointed out that not a single trans group was even heard on the panel before the decision was made.\nWhile our prime minister and government have become increasingly hostile to trans rights since being elected, the fact is that trans communities have existed, and always will. It’s more important than ever to champion, promote and celebrate them – echoing the spirit of last weekend’s protests, which were peaceful and full of love.\nArt can be a powerful way to promote the voices of those who aren’t being heard in society, but also as a tool for helping us see the beauty, possibility and basic humanity in each other.\nI am reminded of something that the artist Martha Rosler – who, like Babirye, works in collage, assembling images and objects that create new possibilities – once told me: “This habit of division, of breaking things apart, holds us back from being whole people, and from building a whole society. On this spinning blue marble we all share, there is no ‘here’ or ‘there’. As a species, our destinies are increasingly intertwined: we are one. Cooperation isn’t just wise; it’s essential. And recognising that isn’t just important; it’s crucial.”How can anyone look at Babirye’s Togetherness and not want unity rather than division?",
        "custom_category": "Entertainment"
    },
    {
        "title": "Season 14 is Full of Friends, Family, and the Ultimate Battle for Number 1!",
        "description": "Season 14 is packed with new challenges and features! Take on the challenge of Heroic Molten Core or throw down the gauntlet and challenge friends or foes to a duel in the new Friendly Duels feature. Unlock and upgrade Minis with the new Split Leader Star Tomes and Login event or discover Split Leaders and Headless Horseman in the G.R.I.D!",
        "content": "Season 14 is packed with a horde of new challenges and features! Take on the challenge of Heroic Molten Core or throw down the gauntlet and electrify friends with your Rumble skills in the new Friendly Duels feature. Unlock and upgrade Minis with the... [3444 chars]",
        "url": "https://news.blizzard.com/en-us/article/24194655/season-14-is-full-of-friends-family-and-the-ultimate-battle-for-number-1",
        "image": "https://bnetcmsus-a.akamaihd.net/cms/blog_header/5r/5R7HYTY5HTD91692143927633.png",
        "publishedAt": "2025-04-25T17:00:00Z",
        "source": {
            "name": "Blizzard News",
            "url": "https://news.blizzard.com"
        },
        "scrap_content": "Season 14 is packed with a horde of new challenges and features! Take on the challenge of Heroic Molten Core or throw down the gauntlet and electrify friends with your Rumble skills in the new Friendly Duels feature. Unlock and upgrade Minis with the new Split Leader Star Tomes and Login event or discover Split Leaders and Headless Horseman in the G.R.I.D!\nNormal and Heroic Molten Core\nIf you skipped leg day, you’d have a Molten Core too! Grab a partner and dive into the warm and inviting lava pools of Molten Core. Battle against all the fearsome foes some may expect to see in Molten Core, including the Firelord himself! Defeat Normal and Heroic difficulty to unlock Ragnaros as a Leader, Boost Slots, Valor, new golden Master Skins, and much more!\n[Learn More]\nLogin Event\nLog in to Warcraft Rumble each day starting on May 21, 2025, to claim daily rewards. The login event will run for 3 weeks and end on June 10, 2025.\nLimited-time Minis\nPrevious Limited-time Minis have been permanantly added to the G.R.I.D!\nMalfurion Stormrage, Anub'arak, Orgrim Doomhammer, and the Lich King. Split Leaders will have a slightly lower chance to appear in G.R.I.D than other Leaders. Split Leaders will only appear in G.R.I.D during their appropriate family weeks.\nHeadless Horseman has been added to the G.R.I.D and will have the same chance to appear in the G.R.I.D as any other Troop. Headless Horseman can appear on the G.R.I.D at any time and will not be affected by the current dungeon (family) week.\nChanges to Experience\nWe've made some experience (XP) adjustments to smooth out leveling for Minis from level 1 to 20. These changes will not affect max level Minis that are no longer able to benefit from XP.\nQuests- Experience earned from Quests has been doubled.\n- Experience needed to level a Mini from level 1 to level 19 has been reduced by approximatly 20%. Since we're reducing the experience needed for each level, Minis will automatically gain progress towards their next level after the update.\n- Victories in Raid and Siege will give the full bonus experience even if players have already beaten the map. This will also apply when partnering with another player who has already beaten the map.\nBorn a serf, destined for greatness.\nFriendly Duels\nThrow down the gauntlet and challenge friend or foe to a duel with the new Friendly Duels feature. To duel, tap the PvP tab and then tap on Friendly Duels, copy the code and share it with an opponent. Duels will not count towards any challenges, missions, quests or rewards.\nFriendly Duels Privacy Option\nFor those who stream gameplay, there is an option to hide and copy the duel code without it being visible to others. Tap the eye icon on the left to hide the code.\nPlayer Versus Player Leaderboard\nA PvP leaderboard has been added! Tap the PvP tab and then tap the blue leaderboard button in the top left to see your placement and the top 100 players. The PvP leaderboard will show as close to a real-time placement as possible and reset at the end of each season. Please note, a reliable internet connection is required to see the most up to date leaderboard placements.\nEvent Schedule\nLatest News\nGet ready to smash that button, load up your favorite Minis, and jump into the action-packed fun of Warcraft Rumble.\nStay on top of the latest Warcraft Rumble news on the official site and follow us on our social channels: Instagram, X, YouTube, Facebook, and Twitch.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Tove Jansson’s Moomin books explore the power of adventure and transformation",
        "description": "This year marks the 80th anniversary of the publication of the first Moomin tale, The Moomins and the Great Flood.",
        "content": "This year marks the 80th anniversary of the first Moomin tale, The Moomins and the Great Flood. In the book, Moomintroll and his friends embark on a journey to find their home after a great flood devastates Moominvalley, meeting odd creatures and new... [5189 chars]",
        "url": "https://theconversation.com/tove-janssons-moomin-books-explore-the-power-of-adventure-and-transformation-245969",
        "image": "https://images.theconversation.com/files/638523/original/file-20241213-15-v5025g.jpg?ixlib=rb-4.1.0&rect=0%2C225%2C3080%2C1540&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-04-25T16:59:47Z",
        "source": {
            "name": "The Conversation",
            "url": "https://theconversation.com"
        },
        "scrap_content": "This year marks the 80th anniversary of the first Moomin tale, The Moomins and the Great Flood. In the book, Moomintroll and his friends embark on a journey to find their home after a great flood devastates Moominvalley, meeting odd creatures and new friends along their journey.\nThe book was first published in creator Tove Jansson’s native Swedish in 1945. However, the first Moomin book to have an English edition was in fact the third of the Moomin books, Trollkarlens Hatt (The Hobgoblin’s Hat). It was translated by Jansson’s friend Elizabeth Portch and reached its widest English-speaking audience when it was published by Puffin Books in 1961 as Finn Family Moomintroll.\nAt the beginning of the story Moomintroll finds a magical top hat. It can transform anything that is placed inside of it into something else entirely – and so the adventures begin.\nThis is part of a series of articles celebrating the 80th anniversary of the Moomins. Want to celebrate their birthday with us? Join The Conversation and a group of experts on May 23 in Bradford for a screening of Moomins on the Riviera and a discussion of the refugee experience in Tove Jansson’s work. Click here for more information and tickets.\nUnlike the Swedish-language edition, Portch’s translation of Finn Family Moomintroll begins with a letter from Moominmamma. It’s written in a curly cursive and dotted with love-hearts and an image of an apparently “hand-drawn” troll. The letter is addressed to a “dear child” who is “overseas”.\nIn it, Moominmamma expresses disbelief at the idea that there may not be any Moomins “there over” and that the child she is addressing may “not even know what a troll is” (hence the illustration).\nMoominmamma’s wonder at the differences in custom between her own land and “your country” is based on an assumption that the two must be somewhat alike. Similarly, her explanation of what Moomintrolls are depends on their difference from the “usual common trolls”, which means there must be familial similarity between them.\nBoth Moominmamma’s wonder at and explanation of difference assume an underlying essential similarity or sameness between Moominvalley, where she lives, and the reader’s home. This is significant in a story that explores ideas of foreignness and translation, change and transformation.\nThough the adventures in Finn Family Moomintroll might be said to only truly begin on the spring morning when Moomintroll, Sniff and Snufkin find “a tall black hat”, the book opens with the Moomins settling down for their winter hibernation and closes with the valley in autumn.\nThe changes wrought by the Hobgoblin’s hat are “quite different” because “you never know beforehand” what they will be. However, their extreme nature is framed and contained by a world in which there are known and predictable changes in the seasons, as well as routine – though sometimes dramatic – changes in the weather.\nThe Hemulen is unperturbed by the hat’s transformation of eggshells into fluffy little clouds that Moomintroll and his friends are able to ride. That’s because he is “so used to [them] doing extraordinary things”. But when Moomintroll is transformed by the hat into “a very strange animal indeed”, so much so that his friends do not recognise him, it’s a very different matter.\nA moment of real jeopardy occurs when Moomintroll’s own mother does not seem to recognise him either. But this is soon dispelled when Moominmamma looks “into his frightened eyes for a very long time” and quietly declares: “Yes, you are my Moomintroll.”\nThis moment of recognition breaks the spell and Moomintroll changes back into “his old self again”. One of the crucial features of the hat is the changes it makes are only temporary and this, together with Moominmamma’s reassurance that she will “always know [Moomintroll], whatever happens”, suggests an ultimately unchanging essence to things that cannot be denied.\nChangelessness as deadening\nOn the other hand, the book suggests that some change is to be embraced.\nSniff’s desire for things to stay the same “for ever and ever” is portrayed as immature and wrong-headed. As is the Muskrat’s obsessive quest for peace and stillness which ends up with his apparent, though temporary, transformation into a monster.\nSnufkin’s point that “life is not peaceful” offers a gentle rebuke to the Hemulen, who also wishes to “live his life in peace and quiet”. But perhaps the clearest indication of the book’s attitude to changelessness is the monstrous Groke. She is motivated by an unwavering drive to recover the “King’s Ruby”, not because this thing which “changes colour all the time” is “the most beautiful thing in the world”, but because it is “the most expensive”.\nThe Groke’s inability to appreciate the ruby aesthetically is presented as being rooted in her own immutability. That the Groke’s hostility to change is itself deadening, becomes evident when she sits “motionless” before the Moomins and their friends, staring at them in a way that makes them feel “she would wait for ever” and eventually departs leaving the ground behind her frozen in the wrong season.\nThis, then, is key. Adventure, transformation and change in Finn Family Moomintroll are both necessary and desirable, but they are also contained within a reassuring frame of reliable predictability. The final lines of the English translation are: “It is autumn in Moomin Valley, for how else can spring come back again?”",
        "custom_category": "Entertainment"
    },
    {
        "title": "Warfare is Band of Brothers for the ‘war on terror’ generation",
        "description": "The film is an unrelenting depiction of 21st-century battle.",
        "content": "Back in 1998, Steven Spielberg’s Saving Private Ryan was widely acclaimed for the bloody realism of its opening scenes. In Warfare, co-directors Ray Mendoza and Alex Garland have achieved something very similar for the Iraq war (2003-2011).\nThis time... [4757 chars]",
        "url": "https://theconversation.com/warfare-is-band-of-brothers-for-the-war-on-terror-generation-255349",
        "image": "https://images.theconversation.com/files/664032/original/file-20250425-62-27yxg5.jpg?ixlib=rb-4.1.0&rect=0%2C439%2C5989%2C2994&q=45&auto=format&w=1356&h=668&fit=crop",
        "publishedAt": "2025-04-25T16:59:38Z",
        "source": {
            "name": "The Conversation",
            "url": "https://theconversation.com"
        },
        "scrap_content": "Back in 1998, Steven Spielberg’s Saving Private Ryan was widely acclaimed for the bloody realism of its opening scenes. In Warfare, co-directors Ray Mendoza and Alex Garland have achieved something very similar for the Iraq war (2003-2011).\nThis time, however, the assault on the senses lasts for almost the entire duration of the film – around 95 mins. The result is an unrelenting depiction of 21st-century battle which both invokes and disrupts the generic conventions of the combat film.\nWarfare begins by staking a claim to authenticity. The opening credits tell us that it is based entirely on the memories of those who were there: the members of a US Navy Seal platoon involved in an operation in the immediate aftermath of the 2006 Battle of Ramadi.\nIn pre-release interviews, Mendoza – a Seal veteran and former member of the platoon – explained that Warfare was made as a purposeful attempt to provide a visual account of what happened for a comrade (Elliott Miller, played in the film by Cosmo Jarvis) who lost his memory after a horrific battlefield injury.\nLooking for something good? Cut through the noise with a carefully curated selection of the latest releases, live events and exhibitions, straight to your inbox every fortnight, on Fridays. Sign up here.\nIt is by no means the only war film to find inspiration in the memories of veterans. From The Best Years of Our Lives (1946) to Lone Survivor (2013), traumatic first-hand experiences have long informed Hollywood’s depictions of war and its aftermath.\nBut in Warfare this framing has a very deliberate consequence. It telescopes the action so that questions of broader political context are necessarily sidelined in favour of the visceral experiences of those on the ground. The Seals are there because they are there – no other rationale for their mission is offered.\nTowards the start, Warfare also follows some well-trodden ground when it pointedly lingers on the boredom before battle. This is reminiscent of another work of filmic war memoir, 2005’s Jarhead.\nThe Seals sweat and swear until, suddenly, chaos is catalysed. What follows is among the most intense depictions of combat ever seen on the big screen. Besieged by an ever-present, yet largely out-of-sight enemy, the embattled soldiers fight to protect one another, rescue their wounded and escape. As they do so, the fog of war descends.\nThis is where the film most clearly reveals its debt to the war film genre. Indeed, for all the originality of its screenplay Warfare actually invokes several familiar generic motifs of the combat film. The most obvious is the focus on a platoon, but two others also stand out.\nOne concerns the film’s narrative centre: a band of isolated and outnumbered American warriors battling heroically against the odds. A popular motif in American culture since at least the 1836 Battle of the Alamo (during the Texas Revolution), it has been used and reused over the years in countless westerns and war films, perhaps most explicitly in 2016’s 13 Hours: The Secret Soldiers of Benghazi. In its underlying structure, the story told by Warfare is informed by this very same trope.\nA second familiar motif is the film’s Shakespearean meditation on the brotherhood of battle. Like 2001’s HBO mini-series Band of Brothers (about a company of second world war paratroopers), this is a story of men at war. Blood is shed and unbreakable bonds are forged.\nIt is here though that Garland and Mendoza also disrupt. For where Henry V offers his “happy few” a validating cause, no such higher purpose reveals itself in Warfare.\nIn fact, these undoubtedly brave warriors are clearly unwelcome invaders. The fraught interactions with the frightened (and unnamed) Iraqi civilians whose home they have occupied makes this obvious, as do the persistent attempts by Iraqi insurgents to kill them.\nWhatever happens, therefore, one thing is certain: these Seals, unlike their second world war predecessors, will not be greeted as liberators by flag-waving locals casting garlands of flowers.\nThis is where Warfare reveals that for all its telescoped focus it is not apolitical after all. Quite the contrary; the film is inescapably a product of its moment.\nThe fighting “out there”, says Warfare, offered no redeeming purpose and so for veterans all that is left are memories of the love and the loyalty between those who went into battle, together.\nSeen like this, Warfare’s place in the genre also now becomes clear. This is a Band of Brothers for those who fought the war on terror. It’s a point made especially apparent in the closing credits which feature photos of the real Seal veterans next to those of the actors who played them (not unlike how each episode of Band of Brothers included veterans’ testimony).\nWarfare’s structure, focus, and elisions speak volumes about the chasm in American culture – particularly in the eyes of veterans – that separates the “good war” of the 1940s from the far less popular conflicts of the early 21st century.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Judge allows Cassie video to be shown at Sean 'Diddy' Combs trial",
        "description": "A judge in New York on Friday allowed a video depicting Sean Combs kicking and dragging then-girlfriend Cassie Ventura in a hotel in March 2016 into his trial.",
        "content": "Judge allows Cassie video to be shown at Sean 'Diddy' Combs trial\nRapper P. Diddy arrives at the 2018 Vanity Fair Oscar Party in Beverly Hills, Calif., on April 3, 2018.\nRapper P. Diddy arrives at the 2018 Vanity Fair Oscar Party in Beverly Hills, Ca... [2500 chars]",
        "url": "https://abcnews.go.com/US/judge-allows-cassie-video-shown-sean-diddy-combs/story?id=121166588",
        "image": "https://i.abcnewsfe.com/a/7602c71b-cd57-44cd-ac0f-d6275a8647d7/diddy-mo_1745598828126_hpMain_16x9.jpg?w=1600",
        "publishedAt": "2025-04-25T16:53:57Z",
        "source": {
            "name": "ABC News",
            "url": "https://abcnews.go.com"
        },
        "scrap_content": "Judge allows Cassie video to be shown at Sean 'Diddy' Combs trial\nDiddy's lawyers unsuccessfully argued the video was manipulated.\nA federal judge in New York on Friday allowed a video depicting Sean Combs kicking and dragging then-girlfriend Cassie Ventura in a Los Angeles hotel in March 2016 into his upcoming sex trafficking and racketeering conspiracy trial.\n\"The defense can't show the footage is inadmissible,\" Judge Arun Subramanian said in a ruling from the bench. \"There's no unfair prejudice to Mr. Combs.\"\nThe defense had argued the video, first obtained by CNN, had been manipulated. CNN has denied it was manipulated.\nAlso, during Friday's hearing, a defense strategy came into sharper focus when Combs' lawyer, Marc Agnifilo, suggested he would describe Combs as a \"swinger\" to explain why he invited prostitutes to join his sexual activity, as has been alleged by prosecutors.\n\"There's a lifestyle, call it swingers, that he was in that he thought was appropriate,\" Agnifilo said. \"The reason he thought it was appropriate is because it's so common.\"\nCombs has denied the charges and said his sexual encounters were consensual. He pleaded not guilty.\nJury selection in the trial begins on May 5.\nProsecutors are seeking to include testimony about a \"medical procedure\" that was not described but that they argued is \"directly relevant\" to the sex-trafficking allegations.\nProsecutor Meredith Foster said the medical procedure \"shows the degree of control Combs had over\" an alleged victim.\n\"Was the procedure the result of one of the claimed sex-trafficking events?\" Subramanian asked.\n\"Yes,\" Foster responded.\nThe judge said he would decide later whether to allow the testimony about the unnamed medical procedure.\nThe indictment, originally filed in September and followed by multiple superseding indictments, accuses Combs of being the ringleader of a criminal \"enterprise\" that allowed him to sexually, physically, emotionally and verbally abuse his victims for years.\nCombs \"abused, threatened, and coerced women and others around him to fulfill his sexual desires, protect his reputation, and conceal his conduct,\" the indictment states. He also stands accused of narcotics offenses, arson, bribery, kidnapping, forced labor and other offenses.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Essex model Jodie Marsh tells court why she took meerkat to pub",
        "description": "Jodie Marsh is appealing against a decision to refuse her application for a wild animal licence.",
        "content": "Ex-model tells court why she took meerkat to pub\n17 minutes ago Share Save Aimee Dexter BBC News, Essex Share Save\nLucy North/PA Jodie Marsh told a hearing at Chelmsford Magistrates' Court \"it's not illegal to take a meerkat in a pub\"\nFormer model Jo... [2760 chars]",
        "url": "https://www.bbc.com/news/articles/c3v966l3ed7o",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc2b/live/89ece500-21e0-11f0-9caa-ff1d4b434821.jpg",
        "publishedAt": "2025-04-25T16:48:25Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "Ex-model tells court why she took meerkat to pub\nFormer model Jodie Marsh defended taking a meerkat called Mabel to the pub as she appealed against a licencing decision involving her animal sanctuary.\nMs Marsh was at Chelmsford Magistrates' Court on Friday to fight the refusal of an application for a wild animal licence to keep lemurs.\nThe media personality, who trained as a bodybuilder, said online trolls were behind much of the criticism of Fripps Farm in Lindsell, near Braintree, in Essex.\nMs Marsh, 46, said: \"When I was bodybuilding they trolled me for that, when I was modelling they trolled me for that; now it's the animals.\"\nUttlesford District Council rejected her application in September 2024.\nAt Friday's hearing, Ms Marsh's lawyer, Paul Oakley, asked her about a report, prepared for the council by vet Dr Stephen Philp, which raised questions about whether it was appropriate to grant the licence.\nMs Marsh said the vet was \"basing his evidence off my trolls and neighbours\".\nMr Oakley asked her about a comment she made in an interview with Nigel Farage on GB News that she took a meerkat called Mabel to the pub \"four nights per week\".\nMs Marsh told the hearing: \"That was banter, that was me being funny.\"\nShe said she had taken the meerkat to a pub \"on a few occasions\" when the animal was being hand-reared.\nMs Marsh added: \"It's not illegal to take a meerkat in a pub\".\nShe was asked about an incident where she lifted a goose by the neck while filming a video about ducklings.\n\"I plopped it [the goose] on to the pond,\" she said.\nMs Marsh said it had not been hurt in the incident, and she had stopped it attacking the ducklings.\nShe told the court the animal sanctuary was \"not overstocked, we have that in writing from Defra who are the only people who matter when it comes to animal welfare\".\nAsked by Mark Smith, for the council, about issues of noise in relation to lemurs, Ms Marsh said \"the noise was never a factor\".\n\"We're all set in five acres of land,\" she said.\nShe added that her application \"didn't get rejected because of noise - it got rejected because I touched a goose by its neck and took a meerkat to bed with me\".\nMs Marsh appeared in the ITV series Essex Wives in 2002 and went on to feature in several reality shows and magazines.\nShe founded Fripps Farm, which looks after animals including alpacas, emus and reptiles, in 2020.\nShe has previously spoken of how she has helped fund the animal sanctuary through her use of the website OnlyFans.\nIn 2023, she told BBC Essex that OnlyFans was \"amazing\" and \"paid my staff wages for the first year\".\nThe case was adjourned part-heard until May 28, when it will resume at Colchester Magistrates' Court.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Disney Auctioning Animation Artifacts to Support LA Fire Relief",
        "description": "To support local animators and their families who were impacted by the LA wildfires in January 2025, Disney is participating in the Sotheby’s AnimAID | The Art of Animation online auction.",
        "content": "As part of The Walt Disney Company’s ongoing commitment to help its hometown of Los Angeles recover from the devastating wildfires in January 2025, Disney is participating in the Sotheby’s AnimAID | The Art of Animation online auction. The auction wi... [4068 chars]",
        "url": "https://thewaltdisneycompany.com/animation-artifacts-auction-la-fire-relief/",
        "image": "https://thewaltdisneycompany.com/app/uploads/2025/04/Animation-Auction-Triptych-2.jpg",
        "publishedAt": "2025-04-25T16:43:21Z",
        "source": {
            "name": "The Walt Disney Company",
            "url": "https://thewaltdisneycompany.com"
        },
        "scrap_content": "As part of The Walt Disney Company’s ongoing commitment to help its hometown of Los Angeles recover from the devastating wildfires in January 2025, Disney is participating in the Sotheby’s AnimAID | The Art of Animation online auction. The auction will offer a treasure trove of rare and one-of-a-kind pieces of animation history with proceeds benefiting local animators and their families who have been affected by the fires.\nThere will be historical offerings from the company’s vast animation libraries — inclusive of Walt Disney Animation Studios, Pixar Animation Studios, Disney Television Animation, 20th Century Television, Lucasfilm, and Marvel Animation — that go back over a century, along with new original pieces from its world-class animators, like Pete Docter, Pixar’s Chief Creative Officer.\n“Los Angeles is our hometown and the heart of the animation community,” Meredith Roberts, EVP, Television Animation, Disney Branded Television, said. “Rallying the creative community to donate artwork felt like the most meaningful way we could support our own.”\nThe auction takes place from April 23-30, 2025. Other participating Studios include Warner Bros., DreamWorks Animation, Sony Pictures Animation, and Paramount.\nUniting to Support the Animation Community\nAccording to Fox Carney, Manager, Research at the Walt Disney Animation Research Library, the question in the animation community in the wake of the fires quickly became, “What can our community do for each other?”\nWith the help of the International Animated Film Society (ASIFA-Hollywood) and its wildfire relief fund, AnimAID, Disney banded together with other studios to launch this auction.\n“It’s a testament to just how close-knit this community is,” Roberts said.\nThe excitement for this effort has been palpable within the halls of Pixar.\n“When we announced this, so many people came out of the woodwork to do anything they could to support the cause,” Docter said.\nCarney concurs, noting that, “we want to let those who work in animation know that companies such as ourselves support them, that we care about them, that we’re here for them, that we want to be able to provide resources in any way that we can.”\nAnd it wasn’t just for the community to help itself. The auction is also a way for fans who have enjoyed the art and made memories from the work of these animators to contribute to them during challenging times. “How can they step in to help the artists who have created those moments?” Carney said.\nA Treasure Trove of Animation History\n“This company started from animation. Animation is in our DNA,” Carney noted. Given that, it’s no surprise that there’s a very wide array of offerings from Disney at the auction. In the Disney Animation research library alone there’s an estimated 65 million physical pieces of artwork and production materials across the studio’s hundred-year history.\nDisney Animation, Pixar, and Disney Television Animation will be offering selected artwork and items from their archives that cover decades of history, as well as new items made just for the auction.\n“The collection reflects the history of the studio and appeals to collectors and fans of all ages,” Roberts said.\nThere’s everything from new character statues signed by the directors of Disney Animations’ Frozen 2, to original character designs and storyboards from series like Disney’s Darkwing Duck and Kim Possible, in addition to original artwork from Pixar’s Turning Red director Domee Shi.\n“It is very unique and rare to be able to own some of the pieces,” Docter said.\nDisney’s Fire Relief Efforts\nThis auction is just one of the many ways that The Walt Disney Company is working to support its community and employees in the wake of the LA wildfires.\nEarlier this month, Disney hosted Disney Field Days! at local schools for students displaced from their schools by the fires, with plans to host more throughout the area.\nAs the fires were still raging, Disney committed $15 million to LA fire relief and rebuilding efforts. On top of that, those affected by the fires have been supported by Disney through donations, care packages, and private screenings. The company also provided the brave first responders at the frontlines of the recent fires with complimentary tickets to Disneyland. Read more about Disney’s efforts here.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Francis Ford Coppola unveils Megalopolis graphic novel",
        "description": "In a statement, the 86-year-old director of the critical and box-office flop said the book confirms his feeling that ‘art can never be constrained’",
        "content": "Megalopolis, Francis Ford Coppola’s $120m passion project, was neither a box office nor a critical success on release last year. Largely funded by the sale of Coppola’s own vineyards, the sci-fi epic starring Adam Driver took around $14m at the globa... [1927 chars]",
        "url": "https://www.theguardian.com/film/2025/apr/25/francis-ford-coppola-unveils-megalopolis-graphic-novel",
        "image": "https://i.guim.co.uk/img/media/f4dd5d3331014fab823d6b366c5fd0c99b0cbba1/69_296_3635_2184/master/3635.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=79a18140f0187e39bd5aa37a3c984962",
        "publishedAt": "2025-04-25T16:07:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "Megalopolis, Francis Ford Coppola’s $120m passion project, was neither a box office nor a critical success on release last year. Largely funded by the sale of Coppola’s own vineyards, the sci-fi epic starring Adam Driver took around $14m at the global box office amid unconvinced reviews and rumours of abnormal on-set behaviour by its director.\nA marketing campaign attempted to leverage bad critical notices by flagging that previous works by Coppola now acclaimed as masterpieces – including Apocalypse Now and The Godfather – had been dismissed by critics at the time. But this backfired after it emerged all of the sniffy historical reviews had been fabricated.\nThe film failed to earn the attention of awards bodies other than the Golden Raspberries for bad movies, which voted the film both worst director and worst supporting actor (for Jon Voight).\nNow, a new attempt to ensure the legacy of what may be the 86-year-old director’s final film has been announced: a comic book re-interpretation by Chris Ryall, titled Francis Ford Coppola’s Megalopolis: An Original Graphic Novel.\nIn a statement on Thursday, Coppola explained that the book would not simply be a re-rendering of his film. “I was pleased to put the idea of a graphic novel in the competent hands of Chris Ryall with the idea that, although it was inspired by my film Megalopolis, it didn’t necessarily have to be limited by it,” he said.\n“I hoped the graphic novel would take its own flight, with its own artists and writer so that it would be a sibling of the film, rather than just an echo. That’s what I feel Chris, Jacob Phillips and the team at Abrams ComicArts have accomplished. It confirms my feeling that art can never be constrained, but rather always a parallel expression, and part of the bounty we can make available to our patrons, audiences and readers.”\nSaid Ryall: “Coppola’s storytelling challenged and inspired me at every turn,” adding that he hoped he had “created something that both honours and expands the world of the original film.”\nAlthough graphic novels are often used as source material for film, in particular for superhero movies, the reverse is considerably more unusual.",
        "custom_category": "Entertainment"
    },
    {
        "title": "The Guide #188: How 25 years of music has shaped the charts from monoculture to mass playlists",
        "description": "In the first in a new miniseries, we look back at the biggest songs of the 21st century to trace how music – and the way we consume it – has evolved",
        "content": "Somehow we’re a quarter of the way through the 21st century (or 1/40th through the new millennia, for those taking a really long view of things). How did that happen? It doesn’t seem long ago that I was sitting on a translucent orange inflatable sofa... [8511 chars]",
        "url": "https://www.theguardian.com/culture/2025/apr/25/how-25-years-of-music-has-shaped-the-charts-from-monoculture-to-mass-playlists",
        "image": "https://i.guim.co.uk/img/media/c96d684c8169ce9e721b663e078740dfa61868b6/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2c3a541ce9dcfe9cd0b16301672aca2d",
        "publishedAt": "2025-04-25T16:02:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "Somehow we’re a quarter of the way through the 21st century (or 1/40th through the new millennia, for those taking a really long view of things). How did that happen? It doesn’t seem long ago that I was sitting on a translucent orange inflatable sofa, clad in jeans so baggy that you could fit your entire face in one leghole, Discman in hand, wondering what the next century might bring. Time really does slip by quickly, doesn’t it?\nOn the other hand, quite a lot has been stuffed into those 25 years, politically, technologically, environmentally and, of course, culturally. Now seems a good time to take stock. Once a month over the next three months we’ll be looking at how music, TV and film have evolved since 2000, as seen through the most popular songs, shows and movies – the pop in pop culture. In July, we’ll be sharing our favourite culture of the 21st century so far to coincide with the 200th issue of this newsletter.\nWe’ll start with music, a medium that has been upturned more than maybe any other in the past 25 years. We’ll be trying to understand how that happened via the No 1 selling UK single of each year, seeing how tastes shift as the 00s give way to the 10s and then the 20s.\nTo help make sense of it all, I spoke to music journalist Michael Cragg. As the author of one of the best music books of recent years, the oral history of turn-of-the-century British pop Reach for the Stars, Michael is better placed than most (and definitely me) to explain how popular music’s tectonic plates have shifted. Here then are the biggest selling singles of each year from 2020 onwards, and what they tell us about how music has changed in that time.\nThe full list\n2000 | Can We Fix It? – Bob the Builder\n2001 | It Wasn’t Me – Shaggy featuring Rikrok\n2002 | Anything Is Possible/Evergreen – Will Young\n2003 | Where Is the Love? – The Black Eyed Peas\n2004 | Do They Know It’s Christmas? – Band Aid 20\n2005 | Is This the Way to Amarillo – Tony Christie featuring Peter Kay\n2006 | Crazy – Gnarls Barkley\n2007 | Bleeding Love – Leona Lewis\n2008 | Hallelujah – Alexandra Burke\n2009 | Poker Face – Lady Gaga\n2010 | Love the Way You Lie – Eminem featuring Rihanna\n2011 | Someone like You – Adele\n2012 | Somebody That I Used to Know – Gotye featuring Kimbra\n2013 | Blurred Lines – Robin Thicke featuring TI and Pharrell Williams\n2014 | Happy – Pharrell Williams\n2015 | Uptown Funk – Mark Ronson featuring Bruno Mars\n2016 | One Dance – Drake featuring Wizkid & Kyla\n2017 | Shape of You – Ed Sheeran\n2018 | One Kiss – Calvin Harris and Dua Lipa\n2019 | Someone You Loved – Lewis Capaldi\n2020 | Blinding Lights – The Weeknd\n2021 | Bad Habits – Ed Sheeran\n2022 | As It Was – Harry Styles\n2023 | Flowers – Miley Cyrus\n2024 | Stick Season –Noah Kahan\nStreaming changed everything\nThe most significant year in this list is 2014: when the UK chart company changed their calculations, including streaming numbers alongside physical sales to more accurately represent changing listening habits. That shift, says Michael, can be seen in the sorts of songs on this list before and after that big bang.\n“It’s interesting that pre-streaming, the biggest songs on the list are often linked to a sense of monoculture, be it the dominance of TV talent shows like The X Factor, or the anniversary of Band Aid and how that would have captured people’s collective imaginations.” Often buying these singles, felt like a cause: “having watched a contestant on a TV talent show for 10 weeks, you then want to buy the CD in order to help them achieve their dreams.”\nIn the years since, the list aligns closely to the biggest songs on streaming platforms: four of the top five of Spotify’s most listened to songs appear on this list (Blinding Lights, Shape of You, Someone You Loved and As It Was). But is number of streams really the best metric of popularity? After all, says Michael, in the age of endlessly self-recycling playlists, “you may listen to a song and not really know who sings it, or care who sings it. Are people as invested in those artists as they were now that they pay a tenner a month for all music?”\nGenre has become less important\nWhat’s striking about the list is perhaps what is absent: rock music, as you might expect of a scene that people regularly declare dead, isn’t anywhere to be seen. And the list is light on dance music, bar an appearance from Calvin Harris, and rap – particularly UK rap – feels under-represented too. (“It’s surprising that a song like Dave and Central Cee’s Sprinter doesn’t appear, but 1.3 million sales isn’t too shabby”, says Michael.)\nIn fact “genre” as a whole seems largely absent from the list, perhaps underscoring the magpie nature of pop music in the streaming age, where artists incorporate multiple influences into their sound. Some of the later songs, says Michael “almost act as placeholders for lots of genres and sub-genres that don’t appear. Shape of You, which was originally written for Rihanna, has a hint of dancehall and tropical house, as of course does Drake’s One Dance the year before.”\nOf course music has also become more globalised in that time, with non-English language artists becoming huge in the west. That though isn’t quite reflected in the most popular songs list. “I’m surprised we’re not seeing a big Latin pop breakthrough hit, or a K-pop one – something that speaks to the fact that pop has opened out beyond the Anglosphere in the last few years”, says Michael.\nThe rise of the individual\nThere’s only one recognisable group on this list, excluding Band Aid: The Black Eyed Peas. Otherwise it’s solo artists, or collaborations between solo artists, all the way down.\nThe dominance of TV talent shows definitely skews this, says Michael. “No band won the X Factor until Little Mix in 2011. Then later you have the dominance of streaming, which encourages collaboration but ideally between two massively successful solo acts, like Dua Lipa (above) and Calvin Harris.” That post-genre landscape also suits solo artists, “who are able to flit more easily between genres”, over bands, who “tend to be in a specific genre lane, which doesn’t help with playlisting.\n… and of the ‘new boring’\nIt’s hard not to notice the plethora of beige on our list: a whitewashing of singer-songwriters offering up syrupy ballads – Adele, Capaldi, Sheeran et al. The critic Peter Robinson coined a term for this music – The new boring – back in 2011, and it shows little sign of slowing more than a decade on.\n“The pop characters – the Gagas, the Rihannas, the Bob the Builders, start to fade away,” notes Michael. “Instead we’re left with nicely melodic but playlist-bland weepies that don’t demand that much attention. Even the Harry Styles and Miley Cyrus songs are towards the blander end of their respective outputs.”\nWho sums up 21st-century pop?\nFor all the recognisable names on this list there are some striking absences: One Direction (though they are represented by Styles), Beyoncé, and Taylor Swift. Which isn’t to say that those artists are somehow less popular than assumed, but rather that their popularity can be measured in other ways, through touring, perhaps. In the case of Swift, says Michael, “her main dominance comes via album sales, where physical product is all-important and she can sell 26 variants of one album.”\nDiscounting those absent big beasts, I ask Michael who on the list he feels sums up 21st-century popular music the best. His answer, perhaps inevitably, is Ed Sheeran, who he describes as a “streaming native”, his popularity having coincided with the rise of Spotify.\n“Sheeran appearing twice makes sense, especially when you think of the streaming era,” says Michael. “Looking at the pattern he seems to have the biggest song every four years – so 2025’s crown could be his for the taking.”\nEd Sheeran haters: your long nightmare is not yet over, it seems.\nIf you want to read the complete version of this newsletter please subscribe to receive The Guide in your inbox every Friday",
        "custom_category": "Entertainment"
    },
    {
        "title": "2025 Lynn Harrell Concerto Competition winners announced",
        "description": "Violinist Alette Williams, 15, receives the first prize of $5,000 and a concert engagement with the Dallas Symphony Orchestra",
        "content": "Violinist Alette Williams, 15, receives the first prize of $5,000 and a concert engagement with the Dallas Symphony Orchestra\nRead more news stories here\nThe Dallas Symphony Orchestra (DSO) has announced the results of its 23rd annual Lynn Harrell Co... [1586 chars]",
        "url": "https://www.thestrad.com/news/2025-lynn-harrell-concerto-competition-winners-announced/19602.article",
        "image": "https://dnan0fzjxntrj.cloudfront.net/Pictures/1024x536/8/5/6/38856_alette_williams_489499_crop.jpeg",
        "publishedAt": "2025-04-25T15:57:46Z",
        "source": {
            "name": "The Strad",
            "url": "https://www.thestrad.com"
        },
        "scrap_content": "Violinist Alette Williams, 15, receives the first prize of $5,000 and a concert engagement with the Dallas Symphony Orchestra\nThe Dallas Symphony Orchestra (DSO) has announced the results of its 23rd annual Lynn Harrell Concerto Competition, which took place on 19 April at the Morton H. Meyerson Symphony Center in Dallas, TX, US.\nThe first prize was awarded to violinist Alette Williams, 15, who performed Vieuxtemps’s Violin Concerto No. 5. She receives $5,000 and the opportunity to perform the work in a future engagement with the DSO. The $3,500 second prize was won by pianist Andrew Petrescu, 15, playing Rachmaninoff’s Piano Concerto No. 1, and the $2,000 third prize by cellist Sophie Deng, 18, playing Kabalevsky’s Cello Concerto No. 2.\nCellist Jin Han, 18, received an honourable mention and $500 for his performance of Dvořák’s Cello Concerto. Cellist Ryan Nam, 14, double bassist Tae Han, 18, and violinist Elim Wong, 14, each received a $250 cash prize as finalists.\nWilliams studies with Julia Bushkova at the University of North Texas and is currently the assistant concertmaster of the Greater Dallas Youth Orchestra (GDYO). She previously won first prize in the 2024 GDYO Concerto Competition, the 2024 TexASTA Concerto Competition, and the 2020 Boston Youth Symphony Repertory Orchestra Concerto Competition. In 2023, she also received second prize in the Collin County Young Artist Competition and an honourable mention in the Sphinx Competition.\nThe Lynn Harrell Concerto Competition was founded by Harrell in 2001 to encourage musical talent in the South Central United States. It is open to students aged 8–18 that attend school in Texas, Arkansas, Louisiana, Oklahoma, or New Mexico. This year’s jury comprised Jenna Barghouti, Anastasia Markina, Shira Samuels-Shragg, and Nan Zhang.\nThe number one source for playing and teaching books, guides, CDs, calendars and back issues of the magazine.\nIn The Best of Technique you’ll discover the top playing tips of the world’s leading string players and teachers. It’s packed full of exercises for students, plus examples from the standard repertoire to show you how to integrate the technique into your playing.\nThe Strad’s Masterclass series brings together the finest string players with some of the greatest string works ever written. Always one of our most popular sections, Masterclass has been an invaluable aid to aspiring soloists, chamber musicians and string teachers since the 1990s.\nThe Canada Council of the Arts’ Musical Instrument Bank is 40 years old in 2025. This year’s calendar celebrates some its treasures, including four instruments by Antonio Stradivari and priceless works by Montagnana, Gagliano, Pressenda and David Tecchler.",
        "custom_category": "Entertainment"
    }
]