[
    {
        "title": "Gold price climbs past $3,300 on uncertainty about trade and weak USD",
        "description": "Gold price snapped two days of losses on Thursday and rose $50, or more than 1.50%, amid renewed concerns about the US-China trade war.",
        "content": "Gold snaps two-day losing streak, gaining 1.5% on fresh trade war fears.\nTrump softens tariff talk, but China denies negotiations and demands full rollback.\nFed rate cut bets rise as yields drop and economic uncertainty builds.\nGold price snapped two... [2741 chars]",
        "url": "https://www.fxstreet.com/news/gold-price-surges-past-3-300-on-trade-jitters-yield-slump-reviving-haven-demand-202504241910",
        "image": "https://editorial.fxsstatic.com/images/i/Commodities_Gold-1_Large.jpg",
        "publishedAt": "2025-04-24T21:58:18Z",
        "source": {
            "name": "FXStreet",
            "url": "https://www.fxstreet.com"
        },
        "scrap_content": "- Gold snaps two-day losing streak, gaining 1.5% on fresh trade war fears.\n- Trump softens tariff talk, but China denies negotiations and demands full rollback.\n- Fed rate cut bets rise as yields drop and economic uncertainty builds.\nGold price snapped two days of losses on Thursday and rose $50, or more than 1.50%, amid renewed concerns about the US-China trade war. Even though US President Donald Trump softened his stance on sticking to 145% tariffs on Beijing, the XAU/USD trades at $3,338 after jumping off daily lows of $3,287.\nMarket mood remains upbeat with Wall Street posting gains. Although traders seem relieved by Trump’s willingness to reach a deal with Beijing, China plays hardball and asks to cancel all “unilateral” US tariffs, clarifying that they have not held talks with the US government.\nBullion prices advance underpinned by the plunge in US Treasury bond yields. The US Dollar Index (DXY) is also feeling the pain after hitting four-day peaks against a basket of six currencies.\nUS economic data witnessed the release of Initial Jobless Claims for the last week, which was aligned with estimates. Durable Goods Orders jumped sharply in March, sponsored by airplane orders.\nMeanwhile, a wave of Federal Reserve (Fed) officials grabbed the headlines. Cleveland Fed President Beth Hammack stated the Fed could act as soon as June if the data supports it but emphasized that uncertainty is weighing on business planning.\nFed Governor Christopher Waller echoed a similar tone, noting that while action in June remains on the table, rate cuts may be driven by a weakening labor market. Waller said, “rate cuts could come from rising unemployment.”\nRegarding the chances of the Fed reducing interest rates at the upcoming meeting, traders see a 94% chance of keeping them unchanged, according to Prime Market Terminal. Nevertheless, traders expect the Fed funds rate to end at 3.45%, equal to 86 basis points of easing (bps).\nSource: Prime Market Terminal\nDaily digest market movers: Gold price climbs boosted by weak US Dollar\n- The yield on the US 10-year Treasury note has decreased by seven-and-a-half basis points, reaching 4.31%.\n- US real yields collapsed seven bps to 2.023%, as shown by the US 10-year Treasury Inflation-Protected Securities yields.\n- US Durable Goods Orders soared in March from 0.9% to 9.2%, sponsored by aircraft bookings. Initial Jobless Claims for the week ending April 19 rose by 222K as expected, up from 216K in the previous reading.\nXAU/USD technical outlook: Gold price uptrend resumes as buyers reclaim $3,300\nThe Gold price uptrend resumed, yet buyers must clear the April 22 high of $3,386 to prevent sellers from dragging lower prices. The next key resistance level would be $3,400, followed by the $3,450 and the $3,500 figure.\nOn the other hand, if XAU/USD tumbles below $3,300, this could open the door to test $3,200 ahead of the April 3 peak of $3,167. A breach of the latter will expose the 50-day Simple Moving Average (SMA) at $3,041.\nUS-China Trade War FAQs\nGenerally speaking, a trade war is an economic conflict between two or more countries due to extreme protectionism on one end. It implies the creation of trade barriers, such as tariffs, which result in counter-barriers, escalating import costs, and hence the cost of living.\nAn economic conflict between the United States (US) and China began early in 2018, when President Donald Trump set trade barriers on China, claiming unfair commercial practices and intellectual property theft from the Asian giant. China took retaliatory action, imposing tariffs on multiple US goods, such as automobiles and soybeans. Tensions escalated until the two countries signed the US-China Phase One trade deal in January 2020. The agreement required structural reforms and other changes to China’s economic and trade regime and pretended to restore stability and trust between the two nations. However, the Coronavirus pandemic took the focus out of the conflict. Yet, it is worth mentioning that President Joe Biden, who took office after Trump, kept tariffs in place and even added some additional levies.\nThe return of Donald Trump to the White House as the 47th US President has sparked a fresh wave of tensions between the two countries. During the 2024 election campaign, Trump pledged to impose 60% tariffs on China once he returned to office, which he did on January 20, 2025. With Trump back, the US-China trade war is meant to resume where it was left, with tit-for-tat policies affecting the global economic landscape amid disruptions in global supply chains, resulting in a reduction in spending, particularly investment, and directly feeding into the Consumer Price Index inflation.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.",
        "custom_category": "India"
    },
    {
        "title": "No, AI systems cannot feel self-aware or conscious in any way, says Google DeepMind CEO Demis Hassabis",
        "description": "Demis Hassabis, Google DeepMind CEO, believes current AI lacks consciousness but acknowledges its potential emergence. He stresses the importance of a",
        "content": "What Google DeepMind CEO Demis Hassabis said about AI consciousness\n“I don’t think any of today’s systems feel self-aware or conscious in any way,”\n“these systems might acquire some feeling of self-awareness.”\n“That is possible,”\n\"Teaching morality t... [2622 chars]",
        "url": "https://timesofindia.indiatimes.com/technology/tech-news/no-ai-systems-cannot-feel-self-aware-or-conscious-in-any-way-says-google-deepmind-ceo-demis-hassabis/articleshow/120595153.cms",
        "image": "https://static.toiimg.com/thumb/msid-120595177,width-1070,height-580,imgsize-30694,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-24T19:12:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    },
    {
        "title": "Gilbert Arenas' first post after son Alijah's LA car crash saddens fans: ‘Prayers up..’",
        "description": "Gilbert Arenas' first social media post since his son Alijah's car crash in Los Angeles has saddened thousands of his fans",
        "content": "Gilbert Arenas' first social media post since his son Alijah's car crash in Los Angeles has saddened thousands of his fans. On Thursday, the NBA legend posted that his much-anticipated show about draft picks had been canceled. This comes after TMZ Sp... [1741 chars]",
        "url": "https://www.hindustantimes.com/world-news/us-news/gilbert-arenas-first-post-after-son-alijahs-la-car-crash-saddens-fans-prayers-up-101745520369735.html",
        "image": "https://www.hindustantimes.com/ht-img/img/2025/04/24/1600x900/Gilbert_Arenas_Alijah_1745520768118_1745520768503.jpg",
        "publishedAt": "2025-04-24T18:53:14Z",
        "source": {
            "name": "Hindustan Times",
            "url": "https://www.hindustantimes.com"
        },
        "scrap_content": "Gilbert Arenas' first post after son Alijah's LA car crash saddens fans: ‘Prayers up..’\nGilbert Arenas' first social media post since his son Alijah's car crash in Los Angeles has saddened thousands of his fans\nGilbert Arenas' first social media post since his son Alijah's car crash in Los Angeles has saddened thousands of his fans. On Thursday, the NBA legend posted that his much-anticipated show about draft picks had been canceled. This comes after TMZ Sports reported that Alijah was in a crash and has been placed in an induced coma.\nThe high school basketball star is 18 years old. He was rushed to the hospital with serious injuries after he crashed his Tesla Cybertruck early on Thursday, the report added. TMZ further cited images from the scene to report that the vehicle was ‘completely mangled on the side of the road of a Los Angeles neighborhood’.\nRead More: What is Shannon Sharpe’s net worth? A look at NFL legend's earnings amid $50m lawsuit row\nGilbert Arenas, meanwhile, posted about his show's cancellation.\n“Man i hope little dude is okay. We all watching n praying for good news,” one fan wrote on X, platform formerly known as Twitter.\n“Hey what's going on? Hope everythings good 🙏🏿” another one added.\n“Prayers For You And Your Family 🙏🏾” a third fan tweeted.\nOnly earlier this month did Alijah tell TMZ Sports that he was signing a contract with Adidas. The 18-year-old added that he's planning to follow in his father's footsteps and ink an endorsement deal with the three stripes. However, he did not reveal any contract details.\nWho is Alijah Arenas?\nAlijah Arenas, born March 16, 2007, is a top American high school basketball player at Chatsworth High School, Los Angeles. Son of former NBA All-Star Gilbert Arenas, he’s a 6’6” shooting guard with a 7-foot wingspan, known for elite scoring (33 points, 8.6 rebounds per game as a sophomore). A five-star recruit, he reclassified from the 2026 to 2025 class, committing to USC over Arizona, Kansas, and Kentucky. Selected for the 2025 McDonald’s All-American Game, Alijah’s smooth scoring and athleticism draw NBA comparisons, with potential as a one-and-done first-round draft pick.",
        "custom_category": "India"
    },
    {
        "title": "Josh Hazlewood’s death‑over masterclass delivers RCB’s first Chinnaswamy win of IPL 2025",
        "description": "Cricket News: Royal Challengers Bengaluru secured a crucial victory against Rajasthan Royals, fueled by Virat Kohli's composed seventy and Josh Hazlewood's game-cha",
        "content": "Josh Hazlewood (PTI Photo)\nGo Beyond The Boundary with our YouTube channel.\nSachin Tendulkar at 52: Power, Pride, and a Nation’s Pulse\nNEW DELHI: Royal Challengers Bengaluru finally treated their home fans to a victory, defeating Rajasthan Royals by ... [2698 chars]",
        "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/josh-hazlewoods-deathover-masterclass-delivers-rcbs-first-chinnaswamy-win-of-ipl-2025/articleshow/120593644.cms",
        "image": "https://static.toiimg.com/thumb/msid-120594376,width-1070,height-580,imgsize-220986,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-24T18:33:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    },
    {
        "title": "World Malaria Day 2025: Theme, Significance And Effective Measures To Prevent This Lethal Disease",
        "description": "World Malaria Day 2025 highlights prevention, awareness, and action against mosquito-borne diseases. Learn the theme, significance, and key protection tips.",
        "content": "World Malaria Day is observed on April 25 annually to raise awareness about the serious effects of malaria and to promote efforts to eradicate this deadly illness. This health event is organised by the World Health Organisation (WHO) and funded by th... [4919 chars]",
        "url": "https://www.netmeds.com/health-library/post/world-malaria-day-2025-theme-significance-and-effective-measures-to-prevent-this-lethal-disease",
        "image": "https://www.netmeds.com/images/cms/magefan_blog/nmslite/1745477591_Cover_480x180_(16).jpg",
        "publishedAt": "2025-04-24T18:30:00Z",
        "source": {
            "name": "Netmeds",
            "url": "https://www.netmeds.com"
        },
        "scrap_content": "World Malaria Day is observed on April 25 annually to raise awareness about the serious effects of malaria and to promote efforts to eradicate this deadly illness. This health event is organised by the World Health Organisation (WHO) and funded by the global healthcare partners. The day emphasises the progress made in malaria control and calls to take continuous efforts to eliminate the spread of this febrile disease.\nMalaria is a life-threatening sickness caused by the Plasmodium parasite, transmitted to human beings through the bites of infected female Anopheles mosquitoes. Fever, chills and flu-like illness are common symptoms observed; if left untreated can lead to severe complications. Most patients recover rapidly from malaria symptoms post-treatment, but serious complications like severe malarial anaemia, cerebral malaria, coma or death can develop if not promptly treated.\nThis health campaign aims to focus on the ongoing global malaria crisis and highlight innovations in the field of malaria prevention, diagnostics, and treatment. Malaria still remains a serious public health threat in several countries, particularly in sub-Saharan Africa.\nThe theme for this year’s World Malaria Day 2025 is “Malaria Ends with Us: Reinvest, Reimagine, Reignite”, which emphasises re-energising efforts at all levels, from global policy to community action, to accelerating progress towards malaria eradication.\nSignificance of World Malaria Day\nAs per the World Health Organisation (WHO), malaria continues to affect millions globally, with an estimated 249 million cases and 608,00 malaria deaths reported in 2022. Malaria has been a major health concern in India; however, progress has been made in recent times. Higher malaria incidence is reported in certain regions, mainly tribal, hilly and inaccessible areas.\nTo curb the spread of this lethal disease, it is important to increase awareness about malaria, and its prevention is a key priority, which includes educating the public on early symptoms, precautions, and available treatment options. As researchers reveal that early diagnosis and treatment of malaria can lessen the mortality rate.\n5 Effective Measures To Eradicate Malaria\nUse of Insecticide/Treated Mosquito Nets (ITNs)\nThe best way to shield yourself against this deadly disease is to sleep under treated mosquito nets (ITNs), which are regarded as one of the most effective methods to avert mosquito bites, mainly at night when mosquitoes are most active.\nIndoor Residual Spraying (IRS)\nThe use of insecticide residual sprays on indoor walls kills mosquitoes that rest there, reducing transmission in high-risk regions\nPreventive Medication\nAntimalarial prophylaxis medications are prescribed for travellers and pregnant women in endemic regions, which helps prevent infection.\nMosquito Repellents /Protective Clothing\nUsing repellents on areas exposed and wearing long sleeves and pants, mainly during nighttime, offers extra protection.\nElimination Of Breeding Sites\nRemoving standing water in and around homes where mosquitoes breed like old tires, home plants and uncovered tanks.\nPrompt Diagnosis\nEarly detection and the right treatment mode with antimalarial medications can prevent severe illness and mortality.\nConclusion\nWorld Malaria Day serves as a powerful tool, though malaria is preventable and treatable, it still claims thousands of lives every year. It calls upon each one of us, governments, individuals, communities and healthcare providers, to work together towards malaria prevention, control and elimination.\n(This article is reviewed by Kalyani Krishna, Chief Content Editor)\nAuthor Profile\nM Sowmya Binu:\nWith over 15 years of expertise and a Postgraduate degree in Nutrition, M Sowmya Binu is a seasoned professional in the field of nutrition. Specialising in tailoring personalised diet plans, she underscores the significance of a balanced approach to health, emphasising the integration of medication with dietary intake for holistic wellness. Passionate about equipping individuals with knowledge to make informed decisions, Sowmya adeptly develops insightful content encompassing a wide array of topics, including food, nutrition, supplements, and overall health.\nReferences\nhttps://www.who.int/campaigns/world-malaria-day\nhttps://endmalaria.org/events/world-malaria-day-2025\nhttps://www.cdc.gov/malaria/prevention/index.html\nhttps://www.who.int/campaigns/world-malaria-day/2025\nDisclaimer:\nThe content provided here is for informational purposes only. This blog is not intended to substitute for medical advice, diagnosis, or treatment. Always seek the advice of a qualified healthcare provider for any questions or concerns you may have regarding a medical condition. Reliance does not endorse or recommend any specific tests, physicians, procedures, opinions, or other information mentioned on the blog.",
        "custom_category": "India"
    },
    {
        "title": "Gujarat launches drive to eradicate measles, rubella by 2026",
        "description": "Gandhinagar: The state govt on Thursday announced that it will launch an intensive drive to immunise children against measles and rubella, aiming to e.",
        "content": "Gandhinagar: The state govt on Thursday announced that it will launch an intensive drive to immunise children against measles and rubella, aiming to eradicate the diseases in the state by 2026.State health minister Rushikesh Patel and officials from ... [1716 chars]",
        "url": "https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-launches-drive-to-eradicate-measles-rubella-by-2026/articleshow/120593599.cms",
        "image": "https://static.toiimg.com/thumb/msid-117516826,width-1070,height-580,imgsize-95471,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-24T17:46:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    },
    {
        "title": "Pahalgam terror attack: Tourists taken to meadow without police permission, government informs all-party meeting",
        "description": "Pahalgam terror attack: Defence Minister Rajnath Singh chairs all-party meeting; Home Ministry and Intelligence Bureau officials inform meeting that there was no police permission to open Baisaran meadow",
        "content": "An all-party meeting held on Thursday in the wake of the Pahalgam terrorist attack unanimously promised support to the Centre in its war against terrorism, Union Parliamentary Affairs Minister Kiren Rijiju said. There was no police permission for tou... [3104 chars]",
        "url": "https://www.thehindu.com/news/national/pahalgam-terror-attack-tourists-taken-to-meadow-without-police-permission-government-informs-all-party-meeting/article69488066.ece",
        "image": "https://th-i.thgim.com/public/incoming/baigh3/article69488132.ece/alternates/LANDSCAPE_1200/PTI04_24_2025_000518A.jpg",
        "publishedAt": "2025-04-24T17:37:00Z",
        "source": {
            "name": "The Hindu",
            "url": "https://www.thehindu.com"
        },
        "scrap_content": "An all-party meeting held on Thursday in the wake of the Pahalgam terrorist attack unanimously promised support to the Centre in its war against terrorism, Union Parliamentary Affairs Minister Kiren Rijiju said. There was no police permission for tourists to visit the Baisaran meadow, where the incident that claimed 26 lives on Tuesday occurred, officials told the meeting. Defence Minister Rajnath Singh chaired the meeting that lasted for more than two hours.\nMr. Rijiju said the Defence Minister detailed the decisions taken by the government following the terror attack. “IB and Home Ministry officials briefed the all-party meeting on how the incident took place and where the lapses occurred,” Mr. Rijiju said. He added that the meadow was away from the main road and was accessible only by foot or pony. “It takes two to two-and-a-half hours to reach there,” he said.\nAccording to Opposition sources, Union Home Minister Amit Shah informed the meeting that the meadow was opened to tourists without police permission, and in two days, more than 1,000 people had visited.\nHe said while there was no security presence at Baisaran on the day of the incident, 500 security personnel were present in Pahalgam on the day and that it took around 45 minutes to trek to the spot.\nThe Minister also stated that they could not trace any communication signal within a radius of 50 km of Baisaran for at least five days before the attack. The terrorists did not use any communication device, the Minister is said to have informed the parliamentarians.\nLeader of the Opposition in the Lok Sabha Rahul Gandhi reportedly remarked that it was a “glaring security failure” and it was astonishing that thousands of people were roaming in an area without the knowledge of the police. He is learnt to have said that it was sheer luck that more people were not killed.\nObjecting to statistics comparing the casualties and terror attacks during the NDA and Congress-led UPA regimes, given in the presentation by the Home Ministry, Mr. Gandhi reportedly said that instead of admitting that there was a dramatic security failure the government gave a long lecture on its achievements in the past 10 years and plans for the next 10 years. He said that if the terrorist group Lashkar-e-Taiba (LeT) was using new tactics, using American weapons, using different ammunition coming from Afghanistan, then what was the preparedness of the security forces.\nEditorial | Unity and resolve: On the Pahalgam terror attack\nAccording to sources, BJP ally Telugu Desam Party, which was represented by Lok Sabha MP Lavu Sri Krishna Devarayalu, asked if by putting the 1960 Indus Waters Treaty in abeyance, the government was setting a precedent.\n“Do we have a contingency plan, if China takes a similar measure on Brahmaputra,” Mr. Devarayalu reportedly asked.\nAlMIM chief and Lok Sabha MP Asaduddin Owaisi, who was invited only after he protested against the exclusion of parties with less than five MPs, as per sources, asked why the response from the security personnel was delayed. He also asked whether the CRPF unit posted there was removed. To this, Mr. Shah explained that the terrain of the meadow is such that it is accessible by foot or on a pony and it is away from the main road, taking security personnel 45 minutes to reach the spot.\nPublished - April 24, 2025 11:07 pm IST",
        "custom_category": "India"
    },
    {
        "title": "How has India reacted to attack in Kashmir and why are tensions in region so high?",
        "description": "Kashmir, where 26 people were killed on Tuesday, is claimed in full by the arch-rivals India and Pakistan",
        "content": "Tensions between the arch-rivals India and Pakistan have escalated rapidly after the massacre of 25 Indian tourists and a Nepalese citizen in the disputed Himalayan Kashmir region on Tuesday, prompting warnings of a return to conflict.\nA previously u... [4120 chars]",
        "url": "https://www.theguardian.com/world/2025/apr/24/how-has-india-reacted-to-attack-in-kashmir-and-why-are-tensions-in-region-so-high",
        "image": "https://i.guim.co.uk/img/media/1f3f453d0cab713764e05e75776b738564d75a03/0_279_5482_3290/master/5482.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7d6e67c8962bdd67ad4d1c517329dec0",
        "publishedAt": "2025-04-24T17:35:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "Tensions between the arch-rivals India and Pakistan have escalated rapidly after the massacre of 25 Indian tourists and a Nepalese citizen in the disputed Himalayan Kashmir region on Tuesday, prompting warnings of a return to conflict.\nA previously unknown Islamic militant group calling itself the Resistance Front has claimed responsibility for the attack, which India immediately linked to Pakistan, although it did not publicly produce any evidence. Pakistan has denied any involvement.\nAmong a string of punitive measures announced since Tuesday, India has downgraded diplomatic ties, suspended a crucial water-sharing treaty and revoked all visas issued to Pakistani nationals.\nIn retaliation, Pakistan has closed its airspace for all Indian-owned or Indian-operated airlines, and suspended all trade with India, including to and from any third country.",
        "custom_category": "India"
    },
    {
        "title": "Apple Stores Giving Away a Limited-Edition Pin For Free Today",
        "description": "Starting today, April 24, Apple Stores around the world are giving away a special pin for free to customers who request one, while supplies last. ...",
        "content": "Starting today, April 24, Apple Stores around the world are giving away a special pin for free to customers who request one, while supplies last.\nThe enamel pin's design is inspired by the Global Close Your Rings Day award in the Activity app, which ... [1492 chars]",
        "url": "https://www.macrumors.com/2025/04/24/apple-stores-to-give-away-special-pin/",
        "image": "https://images.macrumors.com/t/HDst_1PuD9uyLIe8E_ZvtSluGnU=/1600x/article-new/2025/04/Apple-Activity-Rings-Graphic.jpg",
        "publishedAt": "2025-04-24T17:15:00Z",
        "source": {
            "name": "MacRumors",
            "url": "https://www.macrumors.com"
        },
        "scrap_content": "Starting today, April 24, Apple Stores around the world are giving away a special pin for free to customers who request one, while supplies last.\nThe enamel pin's design is inspired by the Global Close Your Rings Day award in the Activity app, which Apple Watch users can receive by closing all three Activity rings today. The limited-edition pin is the physical counterpart to that digital award.\nTo receive the pin, simply visit an Apple Store and ask an employee about it. We were able to receive the pin without having our Activity rings closed yet today, so that does not appear to be a requirement, but your mileage may vary.\nGiven that Apple says the pin is only available while supplies last, keep in mind that some stores might already be out of them.\nHere is what Apple said about the pin in a press release:\nTo celebrate Global Close Your Rings Day, customers can obtain a special pin inspired by the award. Customers can pick up a pin at Apple Store locations worldwide starting April 24, while supplies last.\nThe original Apple Watch launched 10 years ago today, on April 24, 2015, so the pin is a tiny momento of the anniversary.\nHere is what Apple Watch chief Jeff Williams said about the 10-year anniversary:\nApple Watch has changed the way people think about, monitor, and engage with their fitness and health. A decade ago, we introduced Activity rings — and since then, Apple Watch has grown to offer an extensive set of features designed to empower every user. People write to us almost every day sharing how Apple Watch has made a difference in their life, from motivating them to move more throughout the day, to changing the trajectory of their health.\nIf you received the pin, feel free to share a photo in our forums.",
        "custom_category": "India"
    },
    {
        "title": "US asks for home addresses, biometrics of H-1B applicants first time ever: 'Highly unusual'",
        "description": "US News: In a fresh trouble for H-1B applicants, federal immigrant authorities are asking for home addresses and biometrics for H-1B and employment-based immig.",
        "content": "USCIS is seeking home address and biometrics as additional data from H-1B applicants, if there is any 'adverse information' about the applicant.\nIs it targeting H-1Bs amid crackdown on immigrants?\nIn a fresh trouble for H-1B applicants, federal immig... [1983 chars]",
        "url": "https://timesofindia.indiatimes.com/world/us/us-asks-for-home-addresses-biometrics-of-h-1b-applicants-first-time-ever-highly-unusual/articleshow/120592299.cms",
        "image": "https://static.toiimg.com/thumb/msid-120592248,width-1070,height-580,imgsize-35582,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-24T17:10:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    }
]