[
    {
        "title": "Publisher Ziff Davis sues OpenAI for copyright infringement",
        "description": "Digital media publisher Ziff Davis sued OpenAI in Delaware federal court on Thursday, accusing the Microsoft-backed artificial-intelligence company of misusing its publications to train the model behind popular chatbot ChatGPT.Ziff Davis argues that OpenAI \"intentionally and relentlessly\" exploited copyrighte",
        "content": "Digital media publisher Ziff Davis sued OpenAI in Delaware federal court on Thursday, accusing the Microsoft-backed artificial-intelligence company of misusing its publications to train the model behind popular chatbot ChatGPT.\nZiff Davis argues that... [1643 chars]",
        "url": "https://www.channelnewsasia.com/business/publisher-ziff-davis-sues-openai-copyright-infringement-5087931",
        "image": "https://dam.mediacorp.sg/image/upload/s--K6V4Pttl--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-04-24t224757z_2_lynxmpel3n19h_rtroptp_3_openai-chatgpt.jpg?itok=6axxo486",
        "publishedAt": "2025-04-24T22:47:57Z",
        "source": {
            "name": "CNA",
            "url": "https://www.channelnewsasia.com"
        },
        "scrap_content": "Digital media publisher Ziff Davis sued OpenAI in Delaware federal court on Thursday, accusing the Microsoft-backed artificial-intelligence company of misusing its publications to train the model behind popular chatbot ChatGPT.\nZiff Davis argues that OpenAI \"intentionally and relentlessly\" exploited copyrighted content for its AI systems, according to a copy of the lawsuit provided by the media company.\n\"OpenAI seeks to move fast and break things on the assumption that the federal courts will not be able to effectively redress content owners' sometimes existential concerns before it is too late,\" the complaint said.\nThe new lawsuit adds to a web of high-stakes copyright cases brought by news outlets, authors, visual artists and others against OpenAI and other technology companies for allegedly misusing thousands of copyrighted works to train their generative AI systems without permission.\nZiff Davis' publications include tech news outlets ZDNet, PCMag, CNET and IGN and advice website Lifehacker. Other news publishers that have sued AI companies for copyright infringement include the New York Times and Dow Jones.\nOpenAI and other defendants, including Google and Meta Platforms, have argued that their AI systems make fair use of copyrighted material by studying it to learn to create new, transformative content.\nAn OpenAI spokesperson said in a statement on Thursday that its AI models \"empower innovation, and are trained on publicly available data and grounded in fair use.\"\nA spokesperson for Ziff Davis declined to comment on the lawsuit.",
        "custom_category": "Trending"
    },
    {
        "title": "Scientists Spotted Signs of a Hidden Structure Inside Earth's Core",
        "description": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history.",
        "content": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history. Our history.\nResearch shows there are little-known chapters in that history, deep within Earth's past. In ... [3246 chars]",
        "url": "https://www.sciencealert.com/scientists-spotted-signs-of-a-hidden-structure-inside-earths-core",
        "image": "https://www.sciencealert.com/images/2023/02/EarthsInnermostInnerCore.jpg",
        "publishedAt": "2025-04-24T22:43:21Z",
        "source": {
            "name": "ScienceAlert",
            "url": "https://www.sciencealert.com"
        },
        "scrap_content": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history. Our history.\nResearch shows there are little-known chapters in that history, deep within Earth's past. In fact, Earth's inner core appears to have another even more inner core within it.\n\"Traditionally we've been taught the Earth has four main layers: the crust, the mantle, the outer core and the inner core,\" Australian National University geophysicist Joanne Stephenson explained in 2021.\nOur knowledge of what lies beneath Earth's crust has been inferred mostly from what volcanoes have divulged and what seismic waves have whispered.\nFrom these indirect observations, scientists have calculated that the scorchingly hot inner core, with temperatures surpassing 5,000 degrees Celsius (9,000 Fahrenheit), makes up only 1 percent of Earth's total volume.\nBut a few years ago, Stephenson and colleagues found evidence Earth's inner core may actually have two distinct layers.\n\"It's very exciting – and might mean we have to re-write the textbooks!\" Stephenson explained at the time.\nThe team used a search algorithm to trawl through and match thousands of models of the inner core with observed data across many decades about how long seismic waves take to travel through Earth, gathered by the International Seismological Centre.\nSo what's down there? The team looked at some models of the inner core's anisotropy – how differences in the make-up of its material alters the properties of seismic waves – and found some were more likely than others.\nWhile some models suggest the material of the inner core channels seismic waves faster parallel to the equator, others indicate the mix of materials allows for faster waves more parallel to Earth's rotational axis. Even then, there are arguments about the exact degree of difference at certain angles.\nThe study here didn't show much variation with depth in the inner core, but it did find there was a change in the slow direction to a 54-degree angle, with the faster direction of waves running parallel to the axis.\n\"We found evidence that may indicate a change in the structure of iron, which suggests perhaps two separate cooling events in Earth's history,\" Stephenson said.\n\"The details of this big event are still a bit of a mystery, but we've added another piece of the puzzle when it comes to our knowledge of the Earth's inner core.\"\nThese findings may explain why some experimental evidence has been inconsistent with our current models of Earth's structure.\nThe presence of an innermost layer has been suspected before, with hints that iron crystals that compose the inner core have different structural alignments.\n\"We are limited by the distribution of global earthquakes and receivers, especially at polar antipodes,\" the team writes in their paper, explaining the missing data decreases the certainty of their conclusions.\nBut their conclusions align with other studies on the anisotropy of the innermost inner core.\nFuture research may fill in some of these data gaps and allow scientists to corroborate or contradict their findings, and hopefully translate more stories written within this early layer of Earth's history.\nThis research was published in the Journal of Geophysical Research.\nAn earlier version of this article was published in March 2021.",
        "custom_category": "Trending"
    },
    {
        "title": "Ontario School Safety calls for 'urgent action' to combat measles surge",
        "description": "As of April 17, Public Health Ontario reports 925 measles cases in the province, more than five times the number of cases than total number of cases over last 12 years",
        "content": "As of April 17, Public Health Ontario reports 925 measles cases in the province, more than five times the number of cases than total number of cases over last 12 years\nNEWS RELEASE\nONTARIO SCHOOL SAFETY\n************************\nIn an urgent appeal to... [8839 chars]",
        "url": "https://www.orilliamatters.com/local-news/ontario-school-safety-calls-for-urgent-action-to-combat-measles-surge-10567359",
        "image": "https://www.vmcdn.ca/f/files/shared/health/measles-adobestock_174366084.jpeg;w=1200;h=800;mode=crop",
        "publishedAt": "2025-04-24T22:31:18Z",
        "source": {
            "name": "OrilliaMatters.com",
            "url": "https://www.orilliamatters.com"
        },
        "scrap_content": "NEWS RELEASE\nONTARIO SCHOOL SAFETY\n************************\nIn an urgent appeal to protect the health and safety of Ontario’s students, education workers, and families, Ontario School Safety (OSS) has issued an open letter (see below) asking the Ontario provincial government and Public Health Ontario for an immediate vaccine-PLUS strategy, which includes the essential role of healthy indoor air, to curtail the spread of measles.\nThis critical request comes in the wake of concerning measles infection rates — as of April 17, 2025, Public Health Ontario is reporting 925 measles cases in the province, more than five times the number of cases than the total number of cases over the last 12 years.\nEncouraging a vaccine-only strategy is insufficient due to barriers to access, and because measles spreads not only through direct contact with secretions or contaminated surfaces, but through the air we breathe.\nThe letter urges the Ontario government and Public Health Ontario to fund improvements and public education campaigns on vaccination and clean indoor air. This plan requires ventilation and filtration upgrades, carbon dioxide monitoring systems, and free N95/KN95 respirators (masks).\nThese initiatives underscore the importance of creating a safer, healthier learning environment that reduces the spread of airborne diseases, such as measles, which pose serious and highly preventable risks to students, teachers and the wider community.\n“Improving indoor air quality reduces the spread of viruses like measles, and also helps with other air quality issues – wildfire smoke, extreme heat, allergens, and other airborne pathogens. This would be a wise economic investment in the health and well-being of Ontarians, especially in our children and staff in Ontario schools and school buses. It’s about ensuring students and staff can thrive in their learning and working environments by keeping schools open safely”, stated OSS spokesperson Mary Jo Nabuurs.\n“OSS believes the government should provide additional funding to school boards specifically for these much needed air quality improvements because improving the indoor air quality in schools and school buses has positive impacts in our communities, workplaces and health-care settings,\" Nabuurs added.\nThe open letter concludes with an offer from Ontario School Safety to consult on the implementation of a vaccine-PLUS strategy as soon as possible. Ontario School Safety remains committed to working alongside the government and educational stakeholders to expedite the deployment of necessary health and safety measures.\nFor further information, updates, or to contact OSS, please visit www.ontarioschoolsafety.com.\nFind the open letter below:\nDear Premier Ford, Dr. Moore, and Hon. Ministers Jones, Calandra, Piccini and Dunlop:\nWe are writing on behalf of Ontario School Safety (OSS), a grassroots, fully volunteer organization dedicated to promoting the health and well-being of students, education workers, and families across Ontario. Once again, we urgently bring to your attention the escalating threat of measles outbreaks in Ontario and the need for an immediate vaccine-PLUS strategy, which includes cleaning indoor air to help curtail the spread.\nAs of April 17th, 2025, Public Health Ontario is reporting 925 measles cases in the province, more than five times the number of cases than the total number of cases over the last 12 years. Alarmingly, Public Health Ontario is also reporting breakthrough cases among individuals between the ages of five and 40+ who have two or more doses of the measles vaccine.\nWhile vaccination remains the cornerstone of measles prevention through 95% herd immunity, there are several reasons why a vaccine-only strategy is not enough to curtail the spread at the rate needed in 2025:\n- Public Health Ontario reports that only 70% of seven-year-olds are considered fully immunized as of the 2023-2024 school year.\n- People living with certain disabilities, those living in remote or underserviced areas, and individuals facing socio-economic challenges can encounter significant barriers to accessing vaccination services.\n- Newcomers may also find it challenging to obtain accurate information about vaccines and vaccine-preventable diseases in their home language and to access a family doctor or other trusted healthcare workers.\n- Individuals with compromised immune systems or specific health conditions may have contraindications for immunization, rendering them reliant on herd immunity for protection.\nAs measles floats through the air and can linger in a space for up to two hours, we urge the Government of Ontario and Public Health Ontario to put equal focus on cleaning the air in places we inhabit the most, especially in schools and on school buses. Cleaning indoor air can reduce the amount of measles virus students, staff, and bus drivers inhale (which will, by extension, reduce the amount of measles virus in the community), while the province simultaneously works to increase vaccination rates to a level for herd immunity; clean air can also help reduce infections from other airborne pathogens (Strep, influenza, Covid-19, RSV, whooping cough, TB, the common cold, etc.) and reduce other recurrent health threats (like allergens, pollution, wildfire smoke).\nThere are several science-backed ways to improve air quality in schools and on school buses, many of which are readily available now and others that the Government of Ontario can make available quickly. We consider these the “low-hanging fruit” of a vaccine-PLUS strategy.\n- Following our “Investigating Indoor Air Quality at Your Child’s School” guide, which was reviewed and endorsed by the Ontario Society of Professional Engineers, this includes: Ventilation - Opening windows, ensuring mechanical ventilation is running when the building is occupied, using the highest rated filters that can be accommodated (MERV-13, if possible), and regularly inspecting filters for proper fit and replacement.\n- Filtration - Turning on HEPA air purifiers and running them continuously; if noise is an issue (as it sometimes is in classrooms, depending on the purifier model), combine two or more units and turn them to a lower setting when the classrooms are occupied.\nAdditional measures that can be taken to make the air safer to breathe include:\n- Holding more events and assemblies outside.\n- Providing those who are unwell or have been exposed with the support/ability to stay home.\n- Holding a DIY air purifier workshop (great for a STEAM, life-skills, community service project) and placing them in all school spaces where people gather (gyms, libraries, cafeterias, bathrooms, offices, custodian workrooms, food services, classrooms and buses). These DIY air purifiers can be quieter than commercial devices, customizable for size, and cost-effective.\n- Encouraging and modeling the continuous wearing of a respirator mask. Respirator masks are a small “filter for the face” that can stop the spread of an airborne virus at its source and prevent people from breathing in airborne particles. They are a valuable and scientifically-supported community tool that, for the sake of each other’s health and futures, should be a welcome layer of protection. Please make CSA-approved CA-N95, KN95, and/or NIOSH N95 respirator masks free and available at all schools and on all school buses. Please encourage staff to model mask-wearing behaviour so that measles does not spread unnecessarily among them or among the students they serve.\nAlthough taking these measures to clean indoor air is an immediate initiative to help reduce the spread of measles, we urge the Government of Ontario and Public Health Ontario to also engage in longer-term initiatives. Some of these longer-term initiatives include adopting ASHRAE 241 into Ontario’s Building Code, facilitating widespread public health campaigns about measles transmission and the importance of vaccination, creating a provincial vaccination database, as well as promoting a culture of shared responsibility to reduce the spread of measles and other viruses and bacteria.\nWe urge the Ontario government and Public Health Ontario to intensify measles vaccination campaigns while acknowledging the vital role clean indoor air plays in safeguarding the health of all Ontarians against preventable airborne illnesses, like measles, and begin educating on, and encouraging the use of, all the tools currently available to reduce transmission. If you would like to discuss these recommendations and use our wealth of accumulated knowledge, please reach out—Ontario School Safety is always ready to collaborate with you for the sake of the people, staff, and students of Ontario, so we can put an end to these preventable health threats and emergencies once and for all.\nYours truly,\nMary Jo Nabuurs\nSpokesperson and Officer of Media Relations and Outreach\nOntario School Safety\n************************",
        "custom_category": "Trending"
    },
    {
        "title": "Police shoot man at Toronto's international airport",
        "description": "Authorities said the police officers involved were unharmed, and that there was no further threat to public safety.",
        "content": "Police fatally shoot man at Toronto's international airport\nToronto's Pearson Airport is the busiest airport in Canada.\nAuthorities say that the shooting happened after they were called to a \"dispute\". After several minutes of de-escalation attempts,... [2076 chars]",
        "url": "https://www.bbc.com/news/articles/cly1xw5qe7qo",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3a2f/live/6a3a62d0-2110-11f0-83a1-1998ef896e82.jpg",
        "publishedAt": "2025-04-24T22:16:23Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "Police fatally shoot man at Toronto's international airport\nPolice shot and killed an armed 30-year-old man at Toronto's Pearson International Airport on Thursday morning, police said.\nTwo officers shot at the man around 07:00 local time (12:00 GMT), Ontario police's Special Investigations Unit (SIU), said in a statement.\nNo police officers were injured, and \"there is no known threat to the public\", according to the SIU, which is tasked with investigating incidents involving police shootings.\nAuthorities say that the shooting happened after they were called to a \"dispute\". After several minutes of de-escalation attempts, the man pulled out a gun and police opened fire.\nOn Thursday morning, Peel Regional Police officers were investigating a \"man in distress\" in an SUV at Terminal 1 departures, the SIU said.\nAuthorities said the incident happened near Terminal 1 departures.\nPeel Regional Police Chief Nishan Duraiappah said officers spent about 10 minutes speaking to the group, which included two or three people who were in a dispute.\nAfter \"an immense amount of de-escalation\", one of the individuals \"abruptly\" withdrew a gun, the chief said. Officers opened fire on the man.\nThe man - who police have not named - was taken to hospital where he was pronounced dead.\nThe incident temporarily sparked travel chaos at Canada's busiest airport.\nPolice confirmed there were temporary road closures around the terminal, but airport authorities told the BBC that flights \"continue to operate normally\".\nOntario Provincial Police advised drivers and commuters to \"avoid the area\". Buses to the airport initially were rerouted, but Toronto's public transit authority has confirmed that normal service has resumed.\nOntario Premier Doug Ford condemned the shooting.\n\"What's the world coming to? You go to the airport and there's shootings happening,\" he said, according to CBC News.\nPearson airport is 20km (12 miles) away from Toronto in the city of Mississauga. It is the country's busiest airport and sees more than 40 million passengers each year.\nThis not the first time it has made headlines this year.\nIn February, a Delta Air Lines flight from Minneapolis overturned at Pearson and caught fire after skidding along the runway. All 80 passengers survived.",
        "custom_category": "Trending"
    },
    {
        "title": "Price strengthens Play-Off push with Night 12 victory in Liverpool",
        "description": "Gerwyn Price boosted his hopes of BetMGM Premier League Play-Off qualification with victory on a thrilling night of action in Liverpool.",
        "content": "Gerwyn Price boosted his hopes of BetMGM Premier League Play-Off qualification with victory on a thrilling night of action in Liverpool on Thursday.\nPrice produced a trio of sparkling displays to triumph on Night 12 at the M&S Bank Arena, defeating C... [3534 chars]",
        "url": "https://www.pdc.tv/news/2025/04/24/price-strengthens-play-push-night-12-victory-liverpool",
        "image": "https://www.pdc.tv/sites/default/files/2025-04/2025PL12SF_Price2.jpg",
        "publishedAt": "2025-04-24T22:00:00Z",
        "source": {
            "name": "PDC",
            "url": "https://www.pdc.tv"
        },
        "scrap_content": "Gerwyn Price boosted his hopes of BetMGM Premier League Play-Off qualification with victory on a thrilling night of action in Liverpool.\nPrice produced a trio of sparkling displays to triumph on Night 12 at the M&S Bank Arena, defeating Chris Dobey, Rob Cross and Luke Humphries to clinch his third nightly win of the campaign.\nThe Welshman registered averages of 106, 105 and 104 across the evening to secure a maximum five-point haul on Merseyside, which saw him establish a three-point buffer in third position.\n“I’m playing really well, so fingers crossed this year could be my year,” claimed 2023 runner-up Price.\n“I was under pressure to win my first game tonight and get some vital points of the board.\n“I thought I played well in the first game, but after that I settled down a little bit and enjoyed myself, and it was a cracking game against Luke.\n“I just want to make the top four. It doesn’t matter if I’m first, second, third or fourth, as long as I’m at The O2 in a few weeks. That’s my priority.\n“This eases the pressure on me next week, and when there’s no pressure on me, I’ll play some good darts!”\nPrice powered through to the Night 12 showpiece with a brace of 6-2 wins against Dobey and Cross, but he found himself 2-1 adrift against Humphries, despite a rip-roaring start.\nThe world number one followed up a double-double 94 finish with a magnificent 155 finish to seize the early initiative, but Price responsed with a 151 combination of his own to level at three apiece.\nThe 40-year-old then capitalised on crucial missed doubles from Humphries in leg seven to secure an advantage he would refuse to relinquish, wrapping up a 6-4 success with a 13-darter on tops.\nPrice is now six points adrift of Humphries in second spot, after the world number one overcame Nathan Aspinall and Michael van Gerwen to progress to his sixth nightly final of the season.\nHumphries averaged 113 to defeat Aspinall in an exhilarating contest to kick off the night, before punishing a profligate display from Van Gerwen to progress through a gruelling semi-final.\nEarlier in the night, Van Gerwen launched a stunning fightback to edge out reigning champion Luke Littler, overturning 4-0 and 5-3 deficits to cut Littler’s lead at the top of the table to four points.\nThe evening’s other quarter-final saw Cross run out a comprehensive 6-1 winner against Stephen Bunting, who was denied a dream homecoming on his Liverpool return.\nThe 2025 BetMGM Premier League season continues in Birmingham next Thursday, as the race for Play-Off qualification intensifies in the West Midlands.\nHumphries and Price renew their rivalry in arguably the stand-out quarter-final tie on Night 13, while league leader Littler faces Bunting in the evening’s curtain-raiser.\nElsewhere, Cross takes on Van Gerwen for a place in the last four, with Aspinall and Dobey also set to go head-to-head.\nThe 2025 BetMGM Premier League will be broadcast live on Sky Sports in the UK & Ireland, through the PDC's worldwide broadcast partners including DAZN and Viaplay, and on PDCTV for Rest of the World Subscribers.\n2025 BetMGM Premier League Night 12\nThursday April 24\nM&S Bank Arena, Liverpool\nQuarter-Finals\nLuke Humphries 6-3 Nathan Aspinall\nMichael van Gerwen 6-5 Luke Littler\nRob Cross 6-1 Stephen Bunting\nGerwyn Price 6-2 Chris Dobey\nSemi-Finals\nLuke Humphries 6-4 Michael van Gerwen\nGerwyn Price 6-2 Rob Cross\nFinal\nGerwyn Price 6-4 Luke Humphries\nNight 13 - Thursday May 1\nUtilita Arena, Birmingham\nQuarter-Finals\nLuke Littler v Stephen Bunting\nNathan Aspinall v Chris Dobey\nLuke Humphries v Gerwyn Price\nRob Cross v Michael van Gerwen\nSemi-Finals\nLittler/Bunting v Aspinall/Dobey\nHumphries/Price v Cross/Van Gerwen\nFinal\nv\nAll matches best of 11 legs",
        "custom_category": "Trending"
    },
    {
        "title": "Bulldog Sitili Tupouniua’s foul act sparks outrage across the NRL",
        "description": "‘How the f***...’: Ugly Dogs incident shocks with enforcer ‘lucky to stay on the field’",
        "content": "Everyone saw it except the Bunker.\nThe NRL’s much maligned video referee system is under fire again after Bulldogs star Sitili Tupouniua got away with an ugly act during his team’s 42-18 loss to the Broncos at Suncorp Stadium on Thursday night.\nCante... [3191 chars]",
        "url": "https://www.foxsports.com.au/nrl/nrl-premiership/completely-lost-the-plot-the-ugly-dogs-incident-that-stunned-the-nrl-world/news-story/21000e3e407ed7aaa7d3f2d00b91b571",
        "image": "https://content.api.news/v3/images/bin/ea03c51f77d09bb90fee36602ecba142",
        "publishedAt": "2025-04-24T21:59:07Z",
        "source": {
            "name": "Fox Sports",
            "url": "https://www.foxsports.com.au"
        },
        "scrap_content": "‘How the f***...’: Ugly Bulldogs incident shocks with enforcer ‘lucky to stay on the field’\nEveryone saw it except the Bunker.\nThe NRL’s much maligned video referee system is under fire again after Bulldogs star Sitili Tupouniua got away with an ugly act during his team’s 42-18 loss to the Broncos at Suncorp Stadium on Thursday night.\nCanterbury had a night to forget with three players sent to the sin bin — but they were lucky Tupouniua wasn’t sent from the field for a second time.\nWatch your team in the 2025 NRL Telstra Premiership. Stream every round LIVE in 4K, with no ad-breaks during play, on Kayo Sports. New to Kayo? Get your first month for just $1. Limited-time offer.\nNRL commentators were almost universally outraged that Tupouniua was able to stay on the field and did not receive at least a sin bin after he raised his knees while running at Broncos defender Brendan Piakura in the second half.\nReplays showed the Bulldogs’ second-rower collected Piakura in the head with his knee and then followed up with another kicking motion that also collected Piakura again as he slumped in the tackle attempt.\nReferee Gerard Sutton spotted Tupouniua’s act and immediately awarded the Broncos a penalty and put Tupouniua on report. After reviewing the incident the video match official informed Sutton that the incident warranted no further action.\nThat call boggled the mind of some fans.\nLeading rugby league journalist Phil Rothfield posted on X: “How the f*** is Tupouniua not in the sin bin. Kneed a bloke in the head.\nHe went on to write: “This actually could have been a send off. Sin bin at very least. The NRL has completely lost the plot with the bunker.”\nRoosters legend Brad Fittler said on Nine: “You can’t have that”.\nBulldogs cult hero Michael Ennis also said Tupouniua was “lucky to stay on the field”.\nThe act of foul play came just eight minutes after the former Roosters forward had returned to the field after serving his 10-minute sentence in the sin bin for a high tackle.\nMORE NRL NEWS\nBIG HITS: Broncos star’s fresh injury blow; Bulldog avoids potential ‘send off’\nARTHUR: Ex-Eels mentor tipped to become inaugural coach of WA expansion team\n‘IMPLODING’: Dogs of war prove too violent amid FOUR sin bins in wild clash\nFURNACE: Why Madge pulled Hunt stunner; ‘big question mark’ Dogs can’t shake\nLATE MAIL: Broncos star scratched as Madge weighs up switch for huge clash\nProp Josh Curran was the first Bulldogs player sent to the sin bin in the first half for another high tackle on Broncos forward Payne Haas. Tupouniua was the second and then Marcelo Montoya made it a triple binning when he was given his marching orders in the second half.\nBroncos flyer Deine Mariner was binned in the 73rd minute when hitting Viliame Kikau high.\nDespite the big win, the Broncos have plenty of other concerns.\nBroncos star Adam Reynolds had the ball on a string throughout the match, but he left the field in the final minutes with a shoulder injury.\nWith prop Haas on fire and Selwyn Cobbo impressing at fullback in Reece Walsh’s absence, Brisbane looked near unstoppable.\nIt was the first time the Bulldogs have lowered their colours this season after a red hot start to 2025.\nThe Dogs remain one of the teams to beat this year, but the Broncos brought Canterbury fans back down to Earth on Thursday night.",
        "custom_category": "Trending"
    },
    {
        "title": "Gold price climbs past $3,300 on uncertainty about trade and weak USD",
        "description": "Gold price snapped two days of losses on Thursday and rose $50, or more than 1.50%, amid renewed concerns about the US-China trade war.",
        "content": "Gold snaps two-day losing streak, gaining 1.5% on fresh trade war fears.\nTrump softens tariff talk, but China denies negotiations and demands full rollback.\nFed rate cut bets rise as yields drop and economic uncertainty builds.\nGold price snapped two... [2741 chars]",
        "url": "https://www.fxstreet.com/news/gold-price-surges-past-3-300-on-trade-jitters-yield-slump-reviving-haven-demand-202504241910",
        "image": "https://editorial.fxsstatic.com/images/i/Commodities_Gold-1_Large.jpg",
        "publishedAt": "2025-04-24T21:58:18Z",
        "source": {
            "name": "FXStreet",
            "url": "https://www.fxstreet.com"
        },
        "scrap_content": "- Gold snaps two-day losing streak, gaining 1.5% on fresh trade war fears.\n- Trump softens tariff talk, but China denies negotiations and demands full rollback.\n- Fed rate cut bets rise as yields drop and economic uncertainty builds.\nGold price snapped two days of losses on Thursday and rose $50, or more than 1.50%, amid renewed concerns about the US-China trade war. Even though US President Donald Trump softened his stance on sticking to 145% tariffs on Beijing, the XAU/USD trades at $3,338 after jumping off daily lows of $3,287.\nMarket mood remains upbeat with Wall Street posting gains. Although traders seem relieved by Trump’s willingness to reach a deal with Beijing, China plays hardball and asks to cancel all “unilateral” US tariffs, clarifying that they have not held talks with the US government.\nBullion prices advance underpinned by the plunge in US Treasury bond yields. The US Dollar Index (DXY) is also feeling the pain after hitting four-day peaks against a basket of six currencies.\nUS economic data witnessed the release of Initial Jobless Claims for the last week, which was aligned with estimates. Durable Goods Orders jumped sharply in March, sponsored by airplane orders.\nMeanwhile, a wave of Federal Reserve (Fed) officials grabbed the headlines. Cleveland Fed President Beth Hammack stated the Fed could act as soon as June if the data supports it but emphasized that uncertainty is weighing on business planning.\nFed Governor Christopher Waller echoed a similar tone, noting that while action in June remains on the table, rate cuts may be driven by a weakening labor market. Waller said, “rate cuts could come from rising unemployment.”\nRegarding the chances of the Fed reducing interest rates at the upcoming meeting, traders see a 94% chance of keeping them unchanged, according to Prime Market Terminal. Nevertheless, traders expect the Fed funds rate to end at 3.45%, equal to 86 basis points of easing (bps).\nSource: Prime Market Terminal\nDaily digest market movers: Gold price climbs boosted by weak US Dollar\n- The yield on the US 10-year Treasury note has decreased by seven-and-a-half basis points, reaching 4.31%.\n- US real yields collapsed seven bps to 2.023%, as shown by the US 10-year Treasury Inflation-Protected Securities yields.\n- US Durable Goods Orders soared in March from 0.9% to 9.2%, sponsored by aircraft bookings. Initial Jobless Claims for the week ending April 19 rose by 222K as expected, up from 216K in the previous reading.\nXAU/USD technical outlook: Gold price uptrend resumes as buyers reclaim $3,300\nThe Gold price uptrend resumed, yet buyers must clear the April 22 high of $3,386 to prevent sellers from dragging lower prices. The next key resistance level would be $3,400, followed by the $3,450 and the $3,500 figure.\nOn the other hand, if XAU/USD tumbles below $3,300, this could open the door to test $3,200 ahead of the April 3 peak of $3,167. A breach of the latter will expose the 50-day Simple Moving Average (SMA) at $3,041.\nUS-China Trade War FAQs\nGenerally speaking, a trade war is an economic conflict between two or more countries due to extreme protectionism on one end. It implies the creation of trade barriers, such as tariffs, which result in counter-barriers, escalating import costs, and hence the cost of living.\nAn economic conflict between the United States (US) and China began early in 2018, when President Donald Trump set trade barriers on China, claiming unfair commercial practices and intellectual property theft from the Asian giant. China took retaliatory action, imposing tariffs on multiple US goods, such as automobiles and soybeans. Tensions escalated until the two countries signed the US-China Phase One trade deal in January 2020. The agreement required structural reforms and other changes to China’s economic and trade regime and pretended to restore stability and trust between the two nations. However, the Coronavirus pandemic took the focus out of the conflict. Yet, it is worth mentioning that President Joe Biden, who took office after Trump, kept tariffs in place and even added some additional levies.\nThe return of Donald Trump to the White House as the 47th US President has sparked a fresh wave of tensions between the two countries. During the 2024 election campaign, Trump pledged to impose 60% tariffs on China once he returned to office, which he did on January 20, 2025. With Trump back, the US-China trade war is meant to resume where it was left, with tit-for-tat policies affecting the global economic landscape amid disruptions in global supply chains, resulting in a reduction in spending, particularly investment, and directly feeding into the Consumer Price Index inflation.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.",
        "custom_category": "Trending"
    },
    {
        "title": "Trump urges Vladimir Putin to ‘STOP!’ after Kyiv attack",
        "description": "Russia struck Ukraine’s capital with an hours-long barrage of missiles and drones in the deadliest assault on the city since last July.",
        "content": "Washington: US President Donald Trump offered rare criticism of Vladimir Putin on Thursday (Washington time), urging the Russian leader to “STOP!” after a deadly barrage of attacks on Kyiv, Ukraine’s capital.\n“I am not happy with the Russian strikes ... [843 chars]",
        "url": "https://www.theage.com.au/world/north-america/trump-urges-putin-to-stop-after-deadly-russian-attack-on-kyiv-20250425-p5lu4v.html",
        "image": "https://static.ffx.io/images/$zoom_0.5842803703703704%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_34/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/388ddac0fccc705bdd7acaf873e1fde7e21e6cb3",
        "publishedAt": "2025-04-24T21:49:58Z",
        "source": {
            "name": "The Age",
            "url": "https://www.theage.com.au"
        },
        "scrap_content": "By Aamer Madhani and Samuel Petrequin\nWashington: US President Donald Trump offered rare criticism of Vladimir Putin on Thursday (Washington time), urging the Russian leader to “STOP!” after a deadly barrage of attacks on Kyiv, Ukraine’s capital.\n“I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying,” Trump said in a post on his Truth Social platform. “Lets get the Peace Deal DONE!”\nRussia struck Kyiv with an hours-long barrage of missiles and drones. At least 12 people were killed and 90 were injured in the deadliest assault on the city since last July. Ukrainian President Volodymyr Zelensky said based on early information, Russia had used a North Korean ballistic missile to hit one of Kyiv’s residential buildings.\n“If the information that this missile was made in North Korea is confirmed, this will be further proof of the criminal nature of the alliance between Russia and Pyongyang,” Zelensky said on X.\nTrump’s frustration with the conflict is growing as a US-led effort to get a peace agreement between Ukraine and Russia has not made progress.\nTrump lashed out at Zelensky on Wednesday and accused him of prolonging the “killing field” by refusing to surrender the Russia-occupied Crimea Peninsula as part of a possible deal. Russia illegally annexed that area from Ukraine in 2014.\nZelensky has repeated many times during the war that began when Russia invaded in February 2022 that recognising occupied territory as Russia’s is a red line for Ukraine. Zelensky noted on Thursday that Ukraine had agreed to a US ceasefire proposal 44 days ago as a first step to a negotiated peace, but that Moscow’s attacks had continued.\nTrump’s criticism of Putin is notable because the US president has repeatedly said Russia, the aggressor in the conflict, is more willing than Ukraine to get a deal done.\n“I thought it might be easier to deal with Zelensky,” Trump told reporters on Wednesday. “So far it’s been harder, but that’s OK. It’s all right.”\nIn his dealings with Zelensky and Putin, Trump has focused on which leader has leverage. Putin has “the cards” and Zelensky does not, Trump has said repeatedly. At the same time, the new Republican administration has taken steps toward a more co-operative line with Putin, for whom Trump has long shown admiration.\nTrump met with Norwegian Prime Minister Jonas Gahr Store to discuss the war in Ukraine, US tariffs and other issues on Thursday. Norway, a member of NATO and strong supporter of Ukraine, shares a roughly 198-kilometre border with Russia.\nGahr Store said in a social media post he would underscore during the talks that “close contact between Norway and the USA is crucial.”\n“We must contribute to a lasting and just peace in Ukraine,” he said.\nMeanwhile, French President Emmanuel Macron said Putin should “stop lying” when he claims to want “peace” while continuing to bomb Ukraine.\n“There is only one answer we are waiting for: Does President Putin agree to an unconditional ceasefire?” said Macron during a visit to Madagascar. Macron added that “the Americans’ anger should focus on just one person: President Putin”.\nThe French Foreign Ministry also offered measured pushback on Trump’s criticism of Zelensky over the Ukrainian’s stance on Crimea.\nDuring talks last week in Paris, US officials presented a proposal that included allowing Russia to keep control of occupied Ukrainian territory as part of a deal, according to a European official familiar with the matter. The matter was discussed again Wednesday during talks with US, European, and Ukrainian officials.\n“The principle of Ukraine’s territorial integrity is not something that can be negotiated,” Foreign Ministry spokesman Christophe Lemoine said. “This was the position taken last week and reiterated yesterday in London in a meeting of a similar format.”\nAsked whether France agreed with Trump’s comments that Ukraine’s position was to blame for prolonging the war, Lemoine said Ukrainians showed they are open to negotiations while Russia continues its strikes.\n“We rather have the impression that it is the Russians who are slowing down the discussions,” he said.\nThe White House announced on Tuesday that Trump’s special envoy, Steve Witkoff, would visit Moscow this week for a new round of talks with Putin about the war. It would be their fourth meeting since Trump took office in January.\nDefence Secretary Pete Hegseth met on Thursday with NATO Secretary-General Mark Rutte, who also planned talks with Secretary of State Marco Rubio and Trump’s national security adviser, Michael Waltz.\nLeaders from the 32-member alliance are set to meet in the Netherlands in two months. Trump has pushed them to significantly step up defence spending.\nIn 2023, as Russia’s invasion of Ukraine entered its second year, they agreed that all allies should spend at least 2 per cent of gross domestic product on their military budgets. Estimates in NATO’s annual report showed that 22 allies had reached that goal last year, compared with a previous forecast of 23.\n“In 2025, we need to significantly increase our efforts to ensure NATO remains a key source of military advantage for all our nations. Our continued freedom and prosperity depend on it,” Rutte wrote.\nAP, Reuters\nGet a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
        "custom_category": "Trending"
    },
    {
        "title": "Tech Entrepreneur Abe Issa Claims He’s cracked the code for",
        "description": "Tech entrepreneur Abe Issa says he’s found a way to slow the aging process—and he has the data to prove it. Through relentless biometric tracking and...",
        "content": "New York, NY, April 24, 2025 (GLOBE NEWSWIRE) --\nTech entrepreneur Abe Issa says he’s found a way to slow the aging process—and he has the data to prove it. Through relentless biometric tracking and science-backed interventions, Issa has achieved a b... [3802 chars]",
        "url": "https://www.globenewswire.com/news-release/2025/04/24/3068008/0/en/Tech-Entrepreneur-Abe-Issa-Claims-He-s-cracked-the-code-for-Aging-Slower-Backed-by-Real-Biometrics.html",
        "image": "https://ml.globenewswire.com/Resource/Download/7387da49-6d3d-4628-9275-cbd0bc76819c",
        "publishedAt": "2025-04-24T21:43:33Z",
        "source": {
            "name": "GlobeNewswire",
            "url": "https://www.globenewswire.com"
        },
        "scrap_content": "New York, NY, April 24, 2025 (GLOBE NEWSWIRE) --\nTech entrepreneur Abe Issa says he’s found a way to slow the aging process—and he has the data to prove it. Through relentless biometric tracking and science-backed interventions, Issa has achieved a biological profile that rivals those decades younger. His personalized, data-driven regimen has yielded exceptional health markers—from cardiovascular optimization to cellular longevity—positioning him at the forefront of a movement focused not just on living longer, but living better.\nIssa’s foray into data-backed biohacking is a practical endeavor, utilizing his own physiology as a dynamic laboratory. His comprehensive and continuous tracking of vital health indicators forms the basis for precise adjustments in his nutrition, exercise, and supplementation protocols. The resulting health metrics offer a compelling illustration of the potential of this dedicated approach:\nDecoding the Biomarkers: Issa's Internal Landscape\n- Cardiovascular Precision: Issa demonstrates a strong commitment to cardiovascular health, evidenced by his remarkably low LDL Cholesterol (19 mg/dL) and Triglycerides (49 mg/dL), well below standard optimal ranges. His outstanding ApoB level (33 mg/dL) and negligible Oxidized LDL (<13 U/L) point to a proactive defense against heart disease. Furthermore, a recent Cardiac CT Scan showed a reduction in plaque volume and arterial risk, indicating tangible improvements over time.\n- Inflammation Mitigation: The significant improvement in his Inflammatory Markers over the past 18 months underscores Issa's focus on addressing a key factor in aging and chronic conditions. This likely involves a carefully constructed dietary plan and targeted interventions.\nSculpting a High-Performance Physique: The Body Blueprint\n- Issa has achieved a substantial decrease in Body Fat, dropping nearly 50% to a lean 8.9%, reflecting a highly optimized fitness and nutritional strategy.\n- His Lean Mass Index places him within the top 10% nationally, suggesting a focus on maintaining and building muscle mass, essential for both longevity and functional capacity.\n- Impressively, Issa’s Fitness Age aligns with that of a 21-year-old, a testament to the effectiveness of his holistic approach to physical optimization.\nUnlocking Hormonal Harmony and Biological Youth: The Age Blueprint\n- An IGF-1 level of 151 ng/mL suggests a balanced approach to the regulation of growth factors.\n- Notably, Issa’s Telomere Length corresponds to a biological age of 31 years, indicating that he is 12 years younger than his biological age.\n- An ideal cardiovascular range of 105/61 mmHg for Blood Pressure further supports his dedication to long-term health.\n\"My methodology is deeply rooted in objective data,\" Issa explains. \"By consistently monitoring and strategically responding to my body's intricate signals, I'm not just aiming for incremental gains; I'm developing a blueprint for enduring health and peak performance. It’s about interpreting the data and implementing precise strategies to optimize it.\"\nInspired by the growing body of research emphasizing the importance of meticulous tracking and personalized interventions for longevity, Issa’s journey underscores the potential of a data-driven approach to health optimization.\nWhile individual protocols may vary, the core principle of leveraging scientific insights and consistent monitoring to enhance healthspan remains paramount.",
        "custom_category": "Trending"
    },
    {
        "title": "‘P20 per kilo’ rice program feeds Palace-VP Duterte hostilities",
        "description": "The government program to sell rice at only P20 a kilo, which President Ferdinand Marcos said would be rolled out first in the Visayas",
        "content": "The government program to sell rice at only P20 a kilo, which President Ferdinand Marcos Jr. said would be rolled out first in the Visayas to finally fulfill a campaign promise, set off another sour exchange between Malacañang and Vice President Sara... [5688 chars]",
        "url": "https://newsinfo.inquirer.net/2055668/p20-per-kilo-rice-program-feeds-palace-vp-sara-hostilities",
        "image": "https://newsinfo.inquirer.net/files/2025/04/sara-rice-04252025.jpg",
        "publishedAt": "2025-04-24T21:34:00Z",
        "source": {
            "name": "Inquirer.net",
            "url": "https://newsinfo.inquirer.net"
        },
        "scrap_content": null,
        "custom_category": "Trending"
    }
]