[
    {
        "title": "Perplexity CEO says its browser will track everything users do online to sell 'hyper personalized' ads",
        "description": "Perplexity is building its own browser is to collect data on everything users do outside of its own app to sell ads.",
        "content": "Perplexity doesn’t just want to compete with Google, it apparently wants to be Google.\nCEO Aravind Srinivas said this week on the TBPN podcast that one reason Perplexity is building its own browser is to collect data on everything users do outside of... [2703 chars]",
        "url": "https://techcrunch.com/2025/04/24/perplexity-ceo-says-its-browser-will-track-everything-users-do-online-to-sell-hyper-personalized-ads/",
        "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2181313521.jpg?w=1024",
        "publishedAt": "2025-04-24T22:09:03Z",
        "source": {
            "name": "TechCrunch",
            "url": "https://techcrunch.com"
        },
        "scrap_content": "Perplexity doesn’t just want to compete with Google, it apparently wants to be Google.\nCEO Aravind Srinivas said this week on the TBPN podcast that one reason Perplexity is building its own browser is to collect data on everything users do outside of its own app. This so it can sell premium ads.\n“That’s kind of one of the other reasons we wanted to build a browser, is we want to get data even outside the app to better understand you,” Srinivas said. “Because some of the prompts that people do in these AIs is purely work-related. It’s not like that’s personal.”\nAnd work-related queries won’t help the AI company build an accurate-enough dossier.\n“On the other hand, what are the things you’re buying; which hotels are you going [to]; which restaurants are you going to; what are you spending time browsing, tells us so much more about you,” he explained.\nSrinivas believes that Perplexity’s browser users will be fine with such tracking because the ads should be more relevant to them.\n“We plan to use all the context to build a better user profile and, maybe you know, through our discover feed we could show some ads there,” he said.\nThe browser, named Comet, suffered setbacks but is on track to be launched in May, Srinivas said.\nHe’s not wrong, of course. Quietly following users around the internet helped Google become the roughly $2 trillion market cap company it is today.\nThat’s why it built a browser and a mobile operating system. Indeed, Perplexity is attempting something in the mobile world, too. It’s signed a partnership with Motorola, announced Thursday, where its app will be pre-installed on the Razr series and can be accessed though the Moto AI by typing “Ask Perplexity.”\nPerplexity is also in talks with Samsung, Bloomberg reported. Srinivas didn’t flat-out confirm that, though he did reference on the podcast the Bloomberg article, published earlier this month, that discussed both partnerships.\nObviously, Google isn’t the only one watching users online to sell ads. Meta’s ad tracking technology, Pixels, which is embedded on websites across the internet, is how Meta gathers data, even on people that don’t have Facebook or Instagram accounts. Even Apple, which has marketed itself as a privacy protector, can’t resist tracking users’ locations to sell advertising in some of its apps by default.\nOn the other hand, this kind of thing has led people across the political spectrum in the U.S. and in Europe to distrust big tech.\nThe irony of Srinivas openly explaining his browser-tracking ad-selling ambitions this week also can’t be overstated.\nGoogle is currently in court fighting the U.S. Department of Justice, which has alleged Google behaved in monopolistic ways to dominate search and online advertising. The DOJ wants the judge to order Google to divest Chrome.\nBoth OpenAI and Perplexity — not surprisingly, given Srinivas’ reasons — said they would buy the Chrome browser business if Google was forced to sell.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "New Quantum GPS Backup Is 50 Times More Precise Than State-of-the Art Alternatives",
        "description": "The quantum sensor’s extreme sensitivity makes it possible to pinpoint location with high accuracy.",
        "content": "Quantum sensors promise precision far beyond anything possible using classical technology. Australian start-up Q-CTRL has put the devices to work in a GPS backup that’s 50 times better than the current state-of-the-art.\nWhile quantum computing tends ... [2181 chars]",
        "url": "https://singularityhub.com/2025/04/24/new-quantum-gps-backup-is-50-times-more-precise-than-state-of-the-art-alternatives/",
        "image": "https://singularityhub.com/uploads/2025/04/hand-holding-smartphone-with-GPS-map.jpeg?auto=webp",
        "publishedAt": "2025-04-24T22:02:02Z",
        "source": {
            "name": "SingularityHub",
            "url": "https://singularityhub.com"
        },
        "scrap_content": "New Quantum GPS Backup Is 50 Times More Precise Than State-of-the Art Alternatives\nThe quantum sensor’s extreme sensitivity makes it possible to pinpoint location with high accuracy.\nImage Credit\nTamas Tuzes-Katai on Unsplash\nShare\nQuantum sensors promise precision far beyond anything possible using classical technology. Australian start-up Q-CTRL has put the devices to work in a GPS backup that’s 50 times better than the current state-of-the-art.\nWhile quantum computing tends to garner the most headlines, there are a host of promising applications for technology that can harness the unusual effects of quantum mechanics in areas like sensing and communication. And a big weakness for quantum computers is actually a major benefit for quantum sensors. These systems’ sensitivity to the environment is a major source of error in quantum processors, but it also means quantum sensors can detect the most minute of changes in magnetic, electrical, and even gravitational fields.\nQ-CTRL exploited these capabilities to create a device that tracks tiny changes in Earth’s magnetic field to determine its position. They designed the technology to act as a backup for GPS, which can lose signal or be deliberately jammed. In field tests, the company showed it had a tracking error 50 times lower than an inertial navigation system, the industry-standard GPS backup technology.\n“We’re thrilled to be the global pioneer in taking quantum sensing from research to the field, being the first to enable real capabilities that have previously been little more than a dream,” Q-CTRL CEO and founder Michael J. Biercuk said in a press release.\nGPS jamming is a growing problem, and although most commercial aircraft have an inertial navigation system as a backup, their reliability leaves plenty to be desired. These devices use motion sensors to track a vehicle from a known starting point, but errors quickly creep in and can lead to significant positioning drift within just minutes.\nQ-CTRL’s system takes an entirely different approach. A quantum magnetometer made from trapped ions detects tiny variations in the Earth’s magnetic field due to changes in the structure of the surface below the aircraft. The device then compares these fluctuations to a map of the Earth’s magnetic field to determine the vehicle’s location.\nThe quantum sensor’s extreme sensitivity makes it possible to pinpoint location with high accuracy, but it also means it’s highly susceptible to interference from electromagnetic radiation. To get around this, Q-CTRL combined their hardware with specialized machine learning software that recognizes and removes magnetic noise from the signal.\nBe Part of the Future\nSign up to receive top stories about groundbreaking technologies and visionary thinkers from SingularityHub.\nTo test the system, the company attached it to a small aircraft and carried out a series of 300-mile flights. The device pinpointed the plane’s position to within a few hundred yards throughout the flight, in contrast to an inertial navigation system that very quickly strayed several miles off the true position and got steadily worse thereafter.\nThe system also outperformed a range of other GPS backups, including Doppler radar and Doppler velocity lidar by a factor of 10. And unlike those approaches, the quantum navigation tech doesn’t emit any detectable signal, which could make it useful in military applications.\nOne limitation is that Q-CTRL’s device must compare its readings to detailed magnetic field maps, which may not always be available, Mia Jukić at the Netherlands Organization for Applied Scientific Research told New Scientist. The approach always requires prominent magnetic features to act as landmarks, she added, or the navigation accuracy will suffer.\nNonetheless, the technology has caught the eye of major players in defense and aerospace. Q-CTRL is working on quantum navigation systems with the Australian Department of Defense, the US Department of Defense, the UK Royal Navy, as well as Airbus.\nRelated Articles\nThe US Says Electric Air Taxis Can Finally Take Flight Under New FAA Rules\n‘Electric Plastic’ Could Merge Technology With the Body in Future Wearables and Implants\nMeta Just Launched the Largest ‘Open’ AI Model in History. Here’s Why It Matters.\nWhat we’re reading",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Save 40% on Your First Year and Learn Something New",
        "description": "MasterClass is one of our favorite online learning platforms for picking up creative skills. Save 40% on an annual membership with the 2025 Spring Forward Sale.",
        "content": "Get your first year of MasterClass 40% off for a limited time.\nGet your first year of MasterClass 40% off for a limited time. MasterClass\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\nTa... [3397 chars]",
        "url": "https://www.businessinsider.com/guides/deals/masterclass-spring-forward-sale-2025",
        "image": "https://i.insider.com/629e5bd6987cff0019bab3dc?width=1200&format=jpeg",
        "publishedAt": "2025-04-24T21:35:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://www.businessinsider.com"
        },
        "scrap_content": "Taking an online course is a great way to better yourself, whether picking up a new skill for your career or a new hobby for fun. MasterClass offers some of our favorite topics and instructors, making it one of the best online learning platforms we've tested. That said, memberships can be pricey, and there's no free version of the platform. But if there's a course you've been itching to try, you're in luck. You can get a discounted subscription for a limited time with the current MasterClass Spring Forward Sale.\nWith their celebrity creators, high production value, and intuitive app, MasterClass videos feel more like edutainment than traditional online courses. Save 40% on the first year of your membership for a limited time with the MasterClass Spring Forward Sale.\nDuring the sale, you can get your first year of any annual MasterClass subscription for 40% off, bringing the Standard plan down to $72, the Plus plan down to $108, and the Premium plan down to $144. MasterClass deals this good are rare, especially outside the holiday season, so now's a great time to subscribe.\nThe subscription gives you access to a wide library of classes across 13 subject areas, including food and drink, writing, music, science and technology, and more, so there's no shortage of things you can learn about. You can even take classes with celebrity instructors like \"Creative Writing\" with Margaret Atwood, \"Scripting Your Own Success\" with Mindy Kaling, and \"Intentional Eating\" with Michael Pollan.\nRead our full MasterClass review to learn more about the platform.\nKeep in mind that this deal is only valid for the first year of your MasterClass subscription. After that, your membership will automatically renew at the original price, although you can cancel anytime.\nMasterClass Spring Forward Sale frequently asked questions\nWhen does the MasterClass Spring Forward Sale end?\nThe MasterClass Spring Forward sale is live as of April 24 and will continue until April 27 at 11:59 PM PT, so you have a couple more days to choose your plan.\nWhat are the different MasterClass plans?\nThere are three annual MasterClass plans to choose from. All three plans include access to all 200+ classes on the platform. The Standard plan typically costs $120 a year and includes MasterClass on one device and does not allow offline downloads. The Plus plan typically costs $180 a year and adds on a second device and the ability to make offline downloads. Finally, the Premium plan typically costs $240 a year and includes six devices and the ability to make offline downloads.\nAll three plans are eligible for the current Spring Forward Sale, so you can choose the best option based on your budget and preferences.\nWhich devices work with MasterClass?\nYou can watch MasterClass videos on most devices, including smartphones and tablets, laptops and desktops, and streaming devices like Roku, Apple TV, and Amazon Fire TV. Some classes can also be downloaded in audio-only mode, so you can listen to them in the car or during your commute.\nLearn more about the sale and browse through courses at MasterClass.\nCheck out our roundups of the best Skillshare promo codes and EdX coupons to save on more online courses.\nYou can purchase logo and accolade licensing to this story here.\nDisclosure: Written and researched by the Insider Reviews team. We highlight products and services you might find interesting. If you buy them, we may get a small share of the revenue from the sale from our partners. We may receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising team. We welcome your feedback. Email us at reviews@businessinsider.com.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Today’s your last chance to get three months of Apple TV Plus for $9",
        "description": "Until the end of today, new and eligible returning subscribers can subscribe to Apple TV Plus for $2.99 a month for the first three months.",
        "content": "From The Studio to Severance, Apple TV Plus is home to a variety of high-quality originals that we highly recommend. And now through the end of today, you can get access to the streaming platform’s entire library for just $2.99 a month for the first ... [1516 chars]",
        "url": "https://www.theverge.com/tech/655859/apple-tv-plus-the-studio-severance-mythic-quest-deal-sale",
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/The_Studio_Photo_010202.jpg?quality=90&strip=all&crop=6.35625%2C9.8065103573867%2C93.64375%2C80.386979285227&w=1200",
        "publishedAt": "2025-04-24T21:24:02Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "scrap_content": "From The Studio to Severance, Apple TV Plus is home to a variety of high-quality originals that we highly recommend. And now through the end of today, you can get access to the streaming platform’s entire library for just $2.99 a month for the first three months. Given Apple TV Plus usually costs $9.99 a month, that’s like getting three months for the price of one, saving you $21.\nApple TV Plus offers a large library of shows you can stream in 4K HDR, all ad-free and available to download offline. It particularly shines in the sci-fi genre, boasting an impressive collection of hits that includes not only Severance but also Silo, For All Mankind, Constellation, Dark Matter, Hello Tomorrow, Invasion, the upcoming Murderbot …the list could go on and on.\nNot into sci-fi? That’s okay, because the streaming platform also offers a fantastic selection of shows and movies from other genres, from comedies like the Mythic Quest and Ted Lasso, to dramas like Disclaimer, Killers of the Flower Moon, The Morning Show, and Napoleon. It’s even got Friday Night Baseball Major League Soccer matches from MLS Season Pass, just in case you’re a sports fan.\nApple’s streaming service has a variety of original programming, including live MLB games and standouts like Severance, Ted Lasso, Silo, and The Studio. A subscription normally runs $9.99 per month with a seven-day free trial.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "NASA Marshall Fires Up Hybrid Rocket Motor to Prep for Moon Landings",
        "description": "To better understand the physics behind the interaction of exhaust from the commercial human landing systems and the Moon’s surface, engineers and scientists",
        "content": "NASA’s Artemis campaign will use human landing systems, provided by SpaceX and Blue Origin, to safely transport crew to and from the surface of the Moon, in preparation for future crewed missions to Mars. As the landers touch down and lift off from t... [4054 chars]",
        "url": "https://www.nasa.gov/directorates/esdmd/artemis-campaign-development-division/human-landing-system-program/nasa-marshall-fires-up-hybrid-rocket-motor-to-prep-for-moon-landings/",
        "image": "https://www.nasa.gov/wp-content/uploads/2025/04/screenshot-2025-04-22-at-12-00-43 pm.png",
        "publishedAt": "2025-04-24T21:20:19Z",
        "source": {
            "name": "NASA (.gov)",
            "url": "https://www.nasa.gov"
        },
        "scrap_content": "NASA’s Artemis campaign will use human landing systems, provided by SpaceX and Blue Origin, to safely transport crew to and from the surface of the Moon, in preparation for future crewed missions to Mars. As the landers touch down and lift off from the Moon, rocket exhaust plumes will affect the top layer of lunar “soil,” called regolith, on the Moon. When the lander’s engines ignite to decelerate prior to touchdown, they could create craters and instability in the area under the lander and send regolith particles flying at high speeds in various directions.\nTo better understand the physics behind the interaction of exhaust from the commercial human landing systems and the Moon’s surface, engineers and scientists at NASA’s Marshall Space Flight Center in Huntsville, Alabama, recently test-fired a 14-inch hybrid rocket motor more than 30 times. The 3D-printed hybrid rocket motor, developed at Utah State University in Logan, Utah, ignites both solid fuel and a stream of gaseous oxygen to create a powerful stream of rocket exhaust.\n“Artemis builds on what we learned from the Apollo missions to the Moon. NASA still has more to learn more about how the regolith and surface will be affected when a spacecraft much larger than the Apollo lunar excursion module lands, whether it’s on the Moon for Artemis or Mars for future missions,” said Manish Mehta, Human Landing System Plume & Aero Environments discipline lead engineer. “Firing a hybrid rocket motor into a simulated lunar regolith field in a vacuum chamber hasn’t been achieved in decades. NASA will be able to take the data from the test and scale it up to correspond to flight conditions to help us better understand the physics, and anchor our data models, and ultimately make landing on the Moon safer for Artemis astronauts.”\nFast Facts\n- Over billions of years, asteroid and micrometeoroid impacts have ground up the surface of the Moon into fragments ranging from huge boulders to powder, called regolith.\n- Regolith can be made of different minerals based on its location on the Moon. The varying mineral compositions mean regolith in certain locations could be denser and better able to support structures like landers.\nOf the 30 test fires performed in NASA Marshall’s Component Development Area, 28 were conducted under vacuum conditions and two were conducted under ambient pressure. The testing at Marshall ensures the motor will reliably ignite during plume-surface interaction testing in the 60-ft. vacuum sphere at NASA’s Langley Research Center in Hampton, Virginia, later this year.\nOnce the testing at NASA Marshall is complete, the motor will be shipped to NASA Langley. Test teams at NASA Langley will fire the hybrid motor again but this time into simulated lunar regolith, called Black Point-1, in the 60-foot vacuum sphere. Firing the motor from various heights, engineers will measure the size and shape of craters the rocket exhaust creates as well as the speed and direction the simulated lunar regolith particles travel when the rocket motor exhaust hits them.\n“We’re bringing back the capability to characterize the effects of rocket engines interacting with the lunar surface through ground testing in a large vacuum chamber — last done in this facility for the Apollo and Viking programs. The landers going to the Moon through Artemis are much larger and more powerful, so we need new data to understand the complex physics of landing and ascent,” said Ashley Korzun, principal investigator for the plume-surface interaction tests at NASA Langley. “We’ll use the hybrid motor in the second phase of testing to capture data with conditions closely simulating those from a real rocket engine. Our research will reduce risk to the crew, lander, payloads, and surface assets.”\nThrough the Artemis campaign, NASA will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars – for the benefit of all.\nFor more information about Artemis, visit:\nNews Media Contact\nCorinne Beckinger\nMarshall Space Flight Center, Huntsville, Ala.\n256.544.0034\ncorinne.m.beckinger@nasa.gov",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Diagram-based language streamlines optimization of complex coordinated systems",
        "description": "Coordinating complicated interactive systems, whether it's the different modes of transportation in a city or the various components that must work together to make an effective and efficient robot, is an increasingly important ...",
        "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\"We can diagram hierarchies using a graph showing the available level... [9851 chars]",
        "url": "https://techxplore.com/news/2025-04-diagram-based-language-optimization-complex.html",
        "image": "https://scx2.b-cdn.net/gfx/news/2025/a-new-way-to-optimize.jpg",
        "publishedAt": "2025-04-24T20:38:05Z",
        "source": {
            "name": "Tech Xplore",
            "url": "https://techxplore.com"
        },
        "scrap_content": "Diagram-based language streamlines optimization of complex coordinated systems\nCoordinating complicated interactive systems, whether it's the different modes of transportation in a city or the various components that must work together to make an effective and efficient robot, is an increasingly important subject for software designers to tackle. Now, researchers at MIT have developed an entirely new way of approaching these complex problems, using simple diagrams as a tool to reveal better approaches to software optimization in deep-learning models.\nThey say the new method makes addressing these complex tasks so simple that it can be reduced to a drawing that would fit on the back of a napkin.\nThe new approach is described in the journal Transactions of Machine Learning Research, in a paper by incoming doctoral student Vincent Abbott and Professor Gioele Zardini of MIT's Laboratory for Information and Decision Systems (LIDS).\n\"We designed a new language to talk about these new systems,\" Zardini says. This new diagram-based \"language\" is heavily based on something called category theory, he explains.\nIt all has to do with designing the underlying architecture of computer algorithms—the programs that will actually end up sensing and controlling the various different parts of the system that's being optimized.\n\"The components are different pieces of an algorithm, and they have to talk to each other, exchange information, but also account for energy usage, memory consumption, and so on,\" Zardini continues.\nSuch optimizations are notoriously difficult because each change in one part of the system can in turn cause changes in other parts, which can further affect other parts, and so on.\nThe researchers decided to focus on the particular class of deep-learning algorithms, which are currently a hot topic of research. Deep learning is the basis of the large artificial intelligence models, including large language models such as ChatGPT and image-generation models such as Midjourney. These models manipulate data by a \"deep\" series of matrix multiplications interspersed with other operations.\nThe numbers within matrices are parameters, and are updated during long training runs, allowing for complex patterns to be found. Models consist of billions of parameters, making computation expensive, and hence improved resource usage and optimization invaluable.\nDiagrams can represent details of the parallelized operations that deep-learning models consist of, revealing the relationships between algorithms and the parallelized graphics processing unit (GPU) hardware they run on, supplied by companies such as NVIDIA.\n\"I'm very excited about this,\" says Zardini, because \"we seem to have found a language that very nicely describes deep learning algorithms, explicitly representing all the important things, which is the operators you use,\" for example the energy consumption, the memory allocation, and any other parameter that you're trying to optimize for.\nMuch of the progress within deep learning has stemmed from resource efficiency optimizations. The latest DeepSeek model showed that a small team can compete with top models from OpenAI and other major labs by focusing on resource efficiency and the relationship between software and hardware. Typically, in deriving these optimizations, he says, \"people need a lot of trial and error to discover new architectures.\"\nFor example, a widely used optimization program called FlashAttention took more than four years to develop, he says. But with the new framework they developed, \"we can really approach this problem in a more formal way.\" All of this is represented visually in a precisely defined graphical language.\nBut the methods that have been used to find these improvements \"are very limited,\" he says. \"I think this shows that there's a major gap, in that we don't have a formal systematic method of relating an algorithm to either its optimal execution, or even really understanding how many resources it will take to run.\" But now, with the new diagram-based method they devised, such a system exists.\nCategory theory, which underlies this approach, is a way of mathematically describing the different components of a system and how they interact in a generalized, abstract manner. Different perspectives can be related. For example, mathematical formulas can be related to algorithms that implement them and use resources, or descriptions of systems can be related to robust \"monoidal string diagrams.\"\nThese visualizations allow you to directly play around and experiment with how the different parts connect and interact. What they developed, Zardini says, amounts to \"string diagrams on steroids,\" which incorporates many more graphical conventions and many more properties.\n\"Category theory can be thought of as the mathematics of abstraction and composition,\" Abbott says. \"Any compositional system can be described using category theory, and the relationship between compositional systems can then also be studied.\"\nAlgebraic rules that are typically associated with functions can also be represented as diagrams, he says. \"Then, a lot of the visual tricks we can do with diagrams, we can relate to algebraic tricks and functions. So, it creates this correspondence between these different systems.\"\nAs a result, he says, \"this solves a very important problem, which is that we have these deep-learning algorithms, but they're not clearly understood as mathematical models.\" But by representing them as diagrams, it becomes possible to approach them formally and systematically, he says.\nOne thing this enables is a clear visual understanding of the way parallel real-world processes can be represented by parallel processing in multicore computer GPUs.\n\"In this way,\" Abbott says, \"diagrams can both represent a function, and then reveal how to optimally execute it on a GPU.\"\nThe \"attention\" algorithm is used by deep-learning algorithms that require general, contextual information, and is a key phase of the serialized blocks that constitute large language models such as ChatGPT. FlashAttention is an optimization that took years to develop, but resulted in a sixfold improvement in the speed of attention algorithms.\nApplying their method to the well-established FlashAttention algorithm, Zardini says that \"here we are able to derive it, literally, on a napkin.\" He then adds, \"Okay, maybe it's a large napkin.\" But to drive home the point about how much their new approach can simplify dealing with these complex algorithms, they titled their formal research paper on the work \"FlashAttention on a Napkin.\"\nThis method, Abbott says, \"allows for optimization to be really quickly derived, in contrast to prevailing methods.\"\nWhile they initially applied this approach to the already existing FlashAttention algorithm, thus verifying its effectiveness, \"we hope to now use this language to automate the detection of improvements,\" says Zardini, who in addition to being a principal investigator in LIDS, is the Rudge and Nancy Allen Assistant Professor of Civil and Environmental Engineering, and an affiliate faculty with the Institute for Data, Systems, and Society.\nThe plan is that ultimately, he says, they will develop the software to the point that \"the researcher uploads their code, and with the new algorithm you automatically detect what can be improved, what can be optimized, and you return an optimized version of the algorithm to the user.\"\nIn addition to automating algorithm optimization, Zardini notes that a robust analysis of how deep-learning algorithms relate to hardware resource usage allows for systematic co-design of hardware and software. This line of work integrates with Zardini's focus on categorical co-design, which uses the tools of category theory to simultaneously optimize various components of engineered systems.\nAbbott says that \"this whole field of optimized deep learning models, I believe, is quite critically unaddressed, and that's why these diagrams are so exciting. They open the doors to a systematic approach to this problem.\"\n\"I'm very impressed by the quality of this research. ... The new approach to diagramming deep-learning algorithms used by this paper could be a very significant step,\" says Jeremy Howard, founder and CEO of Answers.ai, who was not associated with this work. \"This paper is the first time I've seen such a notation used to deeply analyze the performance of a deep-learning algorithm on real-world hardware. ... The next step will be to see whether real-world performance gains can be achieved.\"\n\"This is a beautifully executed piece of theoretical research, which also aims for high accessibility to uninitiated readers—a trait rarely seen in papers of this kind,\" says Petar Velickovic, a senior research scientist at Google DeepMind and a lecturer at Cambridge University, who was not associated with this work. These researchers, he says, \"are clearly excellent communicators, and I cannot wait to see what they come up with next.\"\nThe new diagram-based language, having been posted online, has already attracted great attention and interest from software developers. A reviewer from Abbott's prior paper introducing the diagrams noted, \"The proposed neural circuit diagrams look great from an artistic standpoint (as far as I am able to judge this).\"\n\"It's technical research, but it's also flashy,\" Zardini says.\nMore information: Vincent Abbott et al, FlashAttention on a Napkin: A Diagrammatic Approach to Deep Learning IO-Awareness (2025)\nThis story is republished courtesy of MIT News (web.mit.edu/newsoffice/), a popular site that covers news about MIT research, innovation and teaching.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Google’s AI Overviews now reach more than 1.5 billion people every month",
        "description": "Google shared the figure as part of its Q1 2025 earnings.",
        "content": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\nGoogle’s AI Overviews in Search now have “1.5 billion users per month,” CEO Sundar Pichai said in a statement as part of Alphabet’... [1446 chars]",
        "url": "https://www.theverge.com/news/655930/google-q1-2025-earnings",
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/STK093_GOOGLE_A-1.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
        "publishedAt": "2025-04-24T20:32:38Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "scrap_content": "Google’s AI Overviews in Search now have “1.5 billion users per month,” CEO Sundar Pichai said in a statement as part of Alphabet’s Q1 2025 earnings.\nGoogle started to widely roll out AI Overviews last May. Despite some awkward suggestions found shortly after their launch, the company has continued to expand upon the tool with updates, showing AI Overviews for more types of queries, and even officially adding ads as it aims to compete with other AI-powered search tools like ChatGPT Search and Perplexity.\nAI Overviews are just one of many AI tools the company is working on; in Q1, it rolled out features like the Gemini 2.5 Pro experimental AI model, a feature that lets you make AI podcasts from Gemini’s Deep Research tool, and the Gemini-powered ability for Google Maps to scan screenshots to help you plan trips.\nGoogle also announced in March that it would be officially dumping Assistant for Gemini on mobile “over the coming months,” and on today’s earnings call, Pichai said that “tablets, cars, and devices that connect to your phones such as headphones and watches,” would be moved over to Gemini later this year.\nOn the hardware front in Q1, Google announced the Pixel 9A, though it didn’t launch the phone until April 10th due to a “component quality issue.”\nDuring Q1, Google earned $90.2 billion in revenue, a 12 percent increase year-over-year. In its earnings release, Pichai also highlighted that the company passed 270 million subscriptions, a figure that’s “driven by YouTube and Google One.”\nOne thing looming over Google right now, however, is the possibility that it will be broken up due to major losses in antitrust cases brought against the company by the US Department of Justice. The remedies trial following the ruling that Google is a monopoly in search is happening now, while Google lost its ad tech monopoly case in a ruling announced last week.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Infopark Kochi adds 600 parking lots, urges better space utilisation",
        "description": "Infopark Kochi adds 600 car parking lots, offers free electric buggy service, and digital display for parking information.",
        "content": "Infopark Kochi has added around 600 additional car parking lots in the face of frequent clamour for increased parking space from private companies and developers who have leased land in the IT complex.\nInfopark Kochi has four buildings of its own in ... [1303 chars]",
        "url": "https://www.thehindu.com/news/national/kerala/infopark-kochi-adds-600-parking-lots-urges-better-space-utilisation/article69483239.ece",
        "image": "https://th-i.thgim.com/public/incoming/dhxzx2/article69488315.ece/alternates/LANDSCAPE_1200/10018_12_3_2025_17_32_7_2_INFOPARK_02.JPG",
        "publishedAt": "2025-04-24T20:27:00Z",
        "source": {
            "name": "The Hindu",
            "url": "https://www.thehindu.com"
        },
        "scrap_content": "Infopark Kochi has added around 600 additional car parking lots in the face of frequent clamour for increased parking space from private companies and developers who have leased land in the IT complex.\nInfopark Kochi has four buildings of its own in Phase-1, with its companies already enjoying parking facilities. Infopark Square, near Infopark’s southern gate, which is entirely dedicated to paid parking, has space for 140 cars. However, only 40% of the space is used on average, a release issued by Infopark said.\nA free electric buggy service is also available from Infopark Square parking to the offices of the companies. The free service features two electric buggies that go from both entrances of Infopark and in front of all buildings. The service is from 8.30 a.m. to 11 a.m. and then for three hours from 4 p.m. A buggy can accommodate 14 people.\nIn addition, the authorities have provided parking facilities on private land near the southern entrance of Infopark Expressway with space for 340 cars. Companies in Infopark can also acquire parking here on a bulk-lease basis, but here too, only 58% of parking is used, according to the release. More parking space has been provided as the number of companies and employees has gone up. Even so, as Infopark officials note, there is a trend of parking on the roadside outside the campus. Infopark social media accounts and internal WhatsApp groups have posted a map containing the parking facilities.\nBesides, a digital display showing parking facilities has been set up on the Phase-1 campus.\nPublished - April 25, 2025 01:57 am IST",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Alleged GTA 6 dev leak details dynamic NPC behavior and event crowds",
        "description": "Esports News: A Reddit user, claiming to be a former Rockstar developer, leaked alleged details about Grand Theft Auto VI's dynamic NPCs and event-based world desig",
        "content": "Source: Rockstar Games\nGrand Theft Auto VI\nDynamic NPCs and event-based design exposed in leak\n\"NPC_00172 – Beach Attire\" and \"NPC_00172 – Work Attire,\"\nTourist NPCs, real-world references, and credibility questions\nA Reddit post from a now-deleted b... [2524 chars]",
        "url": "https://timesofindia.indiatimes.com/sports/esports/gta/alleged-gta-6-dev-leak-details-dynamic-npc-behavior-and-event-crowds/articleshow/120595794.cms",
        "image": "https://static.toiimg.com/thumb/msid-120595793,width-1070,height-580,imgsize-56906,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-24T20:25:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "Tech&AI"
    },
    {
        "title": "Apple to Strip Secret Robotics Unit From AI Chief Weeks After Moving Siri",
        "description": "Apple Inc. will remove its secret robotics unit from the command of its artificial intelligence chief, the latest shake-up in response to the company’s AI struggles.",
        "content": "Apple Inc. will remove its secret robotics unit from the command of its artificial intelligence chief, the latest shake-up in response to the company’s AI struggles.\nApple plans to relocate the robotics team from John Giannandrea ’s AI organization t... [266 chars]",
        "url": "https://www.bloomberg.com/news/articles/2025-04-24/apple-to-strip-secret-robotics-unit-from-ai-chief-weeks-after-moving-siri",
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKZv6EMEMJcw/v1/1200x659.jpg",
        "publishedAt": "2025-04-24T19:55:11Z",
        "source": {
            "name": "Bloomberg.com",
            "url": "https://www.bloomberg.com"
        },
        "scrap_content": null,
        "custom_category": "Tech&AI"
    }
]