[
    {
        "title": "The Tom Hardy Netflix thriller made entirely in Wales",
        "description": "Although Havoc set in an unnamed US city, all of it was filmed in Wales.",
        "content": "Tom Hardy Netflix thriller 'puts Wales on world map'\n19 minutes ago Share Save Rebecca Miles & Gareth Bryer BBC News Share Save\nGetty Images British actor Tom Hardy stars as a detective in action thriller Havoc\nThe team behind Netflix's new action th... [3422 chars]",
        "url": "https://www.bbc.com/news/articles/c8dg7zrvdj2o",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ad4/live/72986820-1f79-11f0-acbf-41bf5b8e34ef.jpg",
        "publishedAt": "2025-04-24T22:00:37Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "Tom Hardy Netflix thriller 'puts Wales on world map'\nThe team behind Netflix's new action thriller Havoc say it will \"put Wales on the map\" for filmmakers across the world.\nStarring Tom Hardy as a \"jaded\" detective, Havoc tells the aftermath of a drug deal gone wrong.\nAlthough it is set in an unnamed US city, all of it - including car chases and shootouts - was filmed in Wales.\nHardy and his co-star Forest Whitaker were spotted filming in south Wales in 2021, but the production experienced several delays because of the pandemic and the writers strike in the US.\nHavoc, which also stars Luis Guzmán, Jessica Mei Li and Timothy Olyphant, began with the vision of its Welsh director Gareth Evans.\n\"I had this, like, one core image which was a corrupt cop in a crime scene where a drug deal's gone wrong and for whatever reason he was scooping cocaine into a coffee cup,\" said Evans, best known for gangster film The Raid and thriller series Gangs of London.\n\"And it all mushroomed out from there.\"\nEvans said it was \"incredible\" when Hardy came on board in the lead role and as a producer.\n\"One of the nicest things about Tom [is] I knew I was in my wheelhouse when it came to action film-making, but with Tom his skillset is deep dive explorations into morally complex characters and so we were able to fuse two styles together.\"\nEvans, who grew up in Hirwaun, Rhondda Cynon Taf, still lives in Wales.\nHe said recreating the US in south Wales was \"challenging\" but he wanted to bring work to the area.\n\"I started going around, like, Swansea, Port Talbot, Cardiff and Newport, looking for any little bit of architecture that I could find that might pass as a little bit Americana,\" he said.\n\"And so we took a look and we thought if we can get 30% or 40% real in camera then the VFX (visual effects) can take care of the rest.\"\nSwansea's Brangwyn Hall became the outside of an American police precinct, Swansea University's Bay campus provided exterior street shots, and a fishing shack was built in the Merthyr Mawr countryside.\nAlthough Havoc was made in Wales, US production company XYZ Films joined forces with Wales-based Severn Studios to make it.\nAram Tertzakian, one of XYZ Films' founders, has worked with Evans since Apostle, the 2018 horror featuring Michael Sheen which was filmed around Margam Park in Port Talbot.\nTertzakian spent much of the pandemic in an Airbnb in Cardiff while Havoc was being filmed.\n\"Gareth brought me to Wales for this project because he is a great patriot and wanted to figure out how to make films in Wales,\" said Tertzakian.\nHe said he believed that after Havoc, filmmakers and producers in the industry are going to be \"a lot more focused on Wales being on the map\".\n\"I think it's always been seen as an option but when they see Havoc and what we pulled off, I think it's going to blow their minds and really make Wales a lot more viable for a lot of people.\n\"Wales is one of the good guys,\" he added.\n\"You've got really hard working crews, a lot of dedication and love for the game. You get some amazing locations, both interiors and exteriors and we had a blast.\"\nAccording to Netflix and Creative Wales, Havoc is the largest feature film ever to be shot entirely in Wales, with post production also completed in Cardiff.\nNetflix said its productions in Wales, which also include Sex Education, had generated more than £200m for the UK economy since 2020.\nJack Sargeant, Wales' minister for culture, said productions like Havoc had delivered \"significant economic and reputational benefits\".\n\"We are immensely proud of our Welsh creative industries, which employ over 35,000 talented individuals, and the world-class infrastructure we have in place for film and TV productions.\"",
        "custom_category": "Entertainment"
    },
    {
        "title": "Walton Goggins' savage swipe at White Lotus 'enemy' Aimee Lou Wood revealed with latest career move",
        "description": "Walton Goggins will host Saturday Night Live just weeks after the hit show aired a savage skit mocking his White Lotus co-star Aimee Lou Wood's teeth.",
        "content": "Walton Goggins will host Saturday Night Live just weeks after the hit show aired a savage skit mocking his White Lotus co-star Aimee Lou Wood's teeth.\nThe actor, 53, who is rumored to be feuding with Wood, 31, after the pair portrayed couple Rick and... [6022 chars]",
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-14645499/walton-goggins-swipe-white-lotus-aimee-lou-wood-snl.html",
        "image": "https://i.dailymail.co.uk/1s/2025/04/24/21/97399591-0-image-m-54_1745526805433.jpg",
        "publishedAt": "2025-04-24T21:19:40Z",
        "source": {
            "name": "Daily Mail",
            "url": "https://www.dailymail.co.uk"
        },
        "scrap_content": "Walton Goggins' savage swipe at White Lotus 'enemy' Aimee Lou Wood revealed with latest career move\n- Have YOU got a story? Email tips@dailymail.com\nWalton Goggins will host Saturday Night Live just weeks after the hit show aired a savage skit mocking his White Lotus co-star Aimee Lou Wood's teeth.\nThe actor, 53, who is rumored to be feuding with Wood, 31, after the pair portrayed couple Rick and Chelsea on season three of the hit show, will make his SNL debut on May 10, with Scarlett Johansson then hosting the final show of the season on May 10.\nGoggins' hosting comes just days after Wood was left in tears over a 'cruel and unfunny' SNL skit which saw Sarah Sherman wear huge prosthetic teeth while parodying the Brit actress.\nIn the sketch, named The White Potus, it imagined the Trump family and various political figures on holiday at the famous retreat.\nGoggins' character Rick was reimagined as Robert F. Kennedy Jr. who was seen on a rambling rant debating they take 'all the fluoride out of the water'.\nThe camera then cut to Aimee's character Chelsea - played by Sarah - with exaggerated buck teeth, who exclaimed: 'Fluoride? What's that?'\nWalton Goggins will host Saturday Night Live just weeks after the hit show aired a savage skit mocking his White Lotus co-star Aimee Lou Wood's teeth\nThe actor, 53, is rumored to be feuding with Wood, 31, after the pair portrayed couple Rick and Chelsea on season three of the hit show\nIn response, Aimee took aim at the 'cheap' joke, as she wrote: 'Such a shame cuz I had such a great time watching it a couple weeks ago. Yes, take the p**s for sure - that's what the show is about- but there must be a cleverer, more nuanced, less cheap way?'\nShe also shared messages of support from her followers and sister Emily, admitting she'd received 'thousands' of messages backing her up.\nAimee continued: 'Last thing I'll say on the matter. I am not thin skinned. I actually love being taken the p**s out of when it's clever and in good spirits. But the joke was about fluoride. I have big gap teeth not bad teeth.\n'I don't mind caricature - I understand that's what SNL is. But the rest of the skit was punching up and I/ Chelsea was the only one punched down On... Okay end of.'\nTo conclude, she shared a comment from a fan that read: 'It was a sharp and funny skit until it suddenly took a screeching turn into 1970's misogyny', she added: 'This sums up my view'.\nAdding fuel to the fire Goggins praised the sketch as a 'SMASHING' success, and he included a message for Jon Hamm, who appeared in the sketch as Kennedy Jr.\nWood recently broke her silence on feud rumors with Goggin. Despite their on-screen chemistry in Thailand, the pair have reportedly fallen out since filming for the HBO Max series wrapped up.\nEagle-eyed fans noticed how the pair have unfollowed each other on social media and potentially have each other blocked.\nGoggins' hosting comes after Wood was left in tears over a 'cruel and unfunny' SNL skit which saw Sarah Sherman (right) wear huge prosthetic teeth while parodying the Brit actress\nAfter the actress went viral for her takedown of the 'mean and unfunny' skit, she claimed that SNL had reached out to extend an olive branch\nWhile Goggins will host May 10, Scarlett Johansson will wrap up SNL's 50th season by hosting on May 17 - pictured with husband and SNL star Colin Jost in February\nTaking to her Instagram, Aimee shared a piece of fan art by @sketchesbyspencer on her Stories.\nThe impressive drawing showed the actress and the actor during their time together on the show, seemingly suggesting all is now well between them.\nThe post comes just a day after it was reported that the pair will soon be reuniting for a work obligation amid suspicions they are embroiled in a feud, CNN reporter Elizabeth Wagmeister claimed.\nThe entertainment correspondent said she learned 'off the record' that Aimee and Walton may be forced to team up 'in the coming weeks' for a professional matter.\n'There is something professionally that they are doing in the coming weeks together,' she explained during an appearance on Nick Viall's The Viall Files podcast.\nIf the pair are indeed feuding, Elizabeth believes their upcoming work event indicates the rift is not as bad as warring former co-stars Blake Lively and Justin Baldoni, who stayed separated due to their drama.\n'So, if there really is a feud, this has not stopped them... It’s not like they can’t be in the same room, is my point. Because I am told that there is something on the books.\n'But also like work is work, right? So if you have to do something for work... look, they're about to go into a giant Emmy campaign. Like every person in that show is going to be nominated.'\n'They're going to have to be in the same room. But, the reason why that was interesting to me, is because if you look at like a Blake Lively Justin Baldoni thing, like they cannot be in the same, right?\n'So this isn't at that level by any means, because I am told that they are going to be doing something for work in the next few weeks.'\nDailyMail.com contacted representatives for Aimee and Walton for comment.\nGoggins raved that the sketch was a 'SMASHING' success, and he included a message for Jon Hamm, who appeared in the sketch as Health and Human Services Secretary Robert F. Kennedy Jr.\nThe move shocked fans, as Goggins had once been effusive about Wood and posted numerous behind-the-scenes photos of the two looking chummy during White Lotus shooting\nAimee Lou, who boasts 2.6m Instagram followers, has been passionately sharing behind the scenes photos and reposts from her co-stars throughout the third season, with Walton also sharing his own set memories.\nAnd in their posts they have both enthusiastically tagged their co-stars - every one but each other.\nElsewhere, Aimee revealed she finally received an apology from Saturday Night Live star Sherman, days after she was recently seen crying in London.\nDays after slamming SNL's 'mean and unfunny' White Lotus-inspired sketch, which included a cruel joke about her teeth, the English actress, revealed Sarah extended a sweet olive branch.\n'Thank you for the beautiful flowers,' Aimee captioned a photo, uploaded to her Instagram Story, of a stunning floral arrangement from Sarah.\nPreviously the White Lotus star defended Sarah's portrayal of her as she explained to her fans that she wasn't 'hating on her' but the concept of the sketch.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Why it took four long years for the best action director in the world to unleash Netflix’s Havoc",
        "description": "Gareth Evans has been busy with TV work, but his latest blood-soaked feature was held up by strikes and scheduling issues",
        "content": "Open this photo in gallery: Timothy Oliphant in Havoc.Netflix\nFor director Gareth Evans, it all started with a coffee mug full of cocaine.\n“It’s quite simple for me – it all begins with an image. So once that picture of a cop picking up a mug of coke... [4172 chars]",
        "url": "https://www.theglobeandmail.com/arts/film/article-why-it-took-four-long-years-for-the-best-action-director-in-the-world/",
        "image": "https://www.theglobeandmail.com/resizer/v2/7NIHDGXFWVHPLPZUNIOD5XRKB4.JPG?auth=a56f5576c480b0d7efcec23ef4ef7a422d5c9ec49f87303a3264853432626f89&width=1200&height=800&quality=80&smart=true",
        "publishedAt": "2025-04-24T21:00:00Z",
        "source": {
            "name": "The Globe and Mail",
            "url": "https://www.theglobeandmail.com"
        },
        "scrap_content": "For director Gareth Evans, it all started with a coffee mug full of cocaine.\n“It’s quite simple for me – it all begins with an image. So once that picture of a cop picking up a mug of coke came into my head, it was all about backtracking as opposed to going forward. Where did the drugs come from? Who was delivering it? How did the deal go bad? That’s the seed.”\nSo went the process that inspired Havoc, Evans’s magnificent (and magnificently violent) corrupt-cop thriller that marks the director’s first new feature in seven years. While that gap might not be so notable for some filmmakers, it felt like an awful long time for super-fans of the Welsh mind behind 2011’s The Raid and its blood-soaked 2014 sequel, which stand as the most influential and brutal action films made this century.\nAhead of this week’s Netflix premiere of Havoc, which rivals The Raid 2 in terms of body count while upping the star power thanks to maniacally committed performances from Tom Hardy and Timothy Olyphant, Evans spoke with The Globe and Mail about breaking boundaries – and bones.\nShooting on Havoc started back in 2021, and while you’ve certainly been busy with your TV series Gangs of London, what have the past few years been like for production on this film?\nOnce we shot and edited it, we identified that there was maybe about a week or two worth of pickup shooting that was required. And then we had this very long hiatus while we waited for schedules to line up. We had a wide ensemble cast and we couldn’t get everyone’s dates to line up. Then the strikes happened. Then people had to finish the films they’d started just before the strikes. Before we knew it, almost three years had passed. But we finally got to do the pickups last summer.\nHow frustrating was that?\nIt allowed me this odd luxury of time where I was able to sit and watch the film and also take some time away from it – detach from it, then rediscover it. But it was quite frustrating because I knew it was something special. But Netflix made sure to make it a priority project – they were not going to abandon it. But I can stop having my anxiety about it.\nThis film was made in Wales, as was your last movie, 2018’s folk-horror film Apostle. Do you see yourself ever going back to Indonesia, where you made the Raid films?\nIt’s always project by project, but I have so many ideas based in Asia, ones that would reunite me with [Raid star] Iko Uwais and the boys again. I’ve been dying to do that, and they keep telling me to hurry up before their knees give in. I’ve definitely not left Indonesia behind – that place gave me my career.\nHavoc’s evocative opening car chase was filmed in a virtual space, with you choreographing the action using a VR headset. Yet other parts of the film, including the intense nightclub fight, seem to be entirely practical, with what seems like a record number of fake-blood squibs used. What’s the balance between in-camera action and digital effects?\nIt’s a healthy combo. We had some really good squibs going off, but I always lean on Andi Novianto, who has been my VFX guy since I started in this industry. There’s nobody better at doing blood and debris and bullet hits like him. But I think we shot something like 30,000 rounds in this film – a lot of the muzzle flashes are real. We also had a lot of great VFX vendors here who helped facilitate the world of this film, because it’s obviously not a real U.S. city but an amalgam.\nGiven the stunt work involved here, I have to ask about your thoughts on the Academy Awards deciding to honour stunt work with its own category at the 2027 Oscars.\nIt’s about time. But it’s funny because I was talking about this earlier and there are still so many layers and facets to it. One category doesn’t feel like it’s quite enough. You also want something that’s specific to fight choreography, design, engineering. Do you reward the intricacy of choreography within a martial-arts capacity? The bravery of a high dive? Pyrotechnics? Driving? It’s wonderful to have, though, because every stunt is about mitigating risk for the purposes of entertainment. Sometimes it’s all done for a five-second shot. So paying respect is the least that we can do.\nHavoc is available to stream on Netflix starting Friday.\nThis interview has been condensed and edited.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Meet Broadway’s Betty Boop, Jasmine Amy Rogers",
        "description": "After years of auditions this triple threat landed her dream role. And along the way she found her power.",
        "content": "Jasmine Amy Rogers plays Betty Boop in BOOP! The Musical, now on Broadway at the Broadhurst Theatre Nicole Wilson\nJasmine Amy Rogers will never forget where she was when she learned that she was offered the role of Betty Boop in BOOP! The Musical.\nIt... [5968 chars]",
        "url": "https://www.forbes.com/sites/jerylbrunner/2025/04/24/meet-broadways-betty-boop-jasmine-amy-rogers/",
        "image": "https://imageio.forbes.com/specials-images/imageserve/680aa266d3b8ff90fd65d44c/0x0.jpg?format=jpg&crop=959,540,x0,y84,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2025-04-24T20:56:19Z",
        "source": {
            "name": "Forbes",
            "url": "https://www.forbes.com"
        },
        "scrap_content": "Jasmine Amy Rogers will never forget where she was when she learned that she was offered the role of Betty Boop in BOOP! The Musical.\nIt was the summer of 2023 and she had just left her apartment to get on the six train to take a class at Barry’s Bootcamp. “I was attempting to keep myself busy and was going to try this class for the first time,” says Rogers, who got the call from all three of her agents about the show that would run in Chicago before heading to Broadway.\n“They always get on a four-way call. And they were saying, ‘you’re gonna play Boop.’ They were proud of me, and so excited,” says Rogers. They told her to keep the news under wraps. “The only person I could call was my mother,” she says. “I remember it being a gloomy, warm, rainy day, but I was just over the moon and it was the best day ever.”\nThe road to playing Betty Boop had been challenging for Rogers. The musical about the strong and sultry iconic comic book character who debuted in 1930 had a dream creative team attached. That included director/choreographer Jerry Mitchell, composer David Foster, lyricist Susan Birkenhead and book writer Bob Martin. For Rogers, who was in her early twenties, playing the title role was a lot.\nA musical theater standout, Rogers had already worked with Mitchell in the musical Becoming Nancy. But until that point, BOOP! eluded her. She had auditioned for the role about seven times yet couldn’t land it.\n“It was clear Jerry and DB Bonds, our associate director, wanted me. But I had to prove to them that I could handle it,” says Rogers. “I believe it was about inhabiting myself. I was lacking the confidence needed to play the role and carry the show.”\nDuring one work session with Bonds he told her, \"You have to go in there and show them what you are doing is worthy.” Looking back, Rogers sees that they knew she was capable of playing Betty Boop before she believed in herself. “It was basically them trying to convince me that I really wanted this. I had to own it,” she says. “And when I finally did, that is when I got the role.”\nBut Rogers got to own the role and more. A tap-dancing triple threat, she has a voice as smooth as honey and a belt that brings down the house. She creates a layered Betty Boop that is vulnerable and sweet, yet very powerful and smart. The company also includes Faith Prince, Ainsley Melham, Erich Bergen, Stephen DeRosa, Anastacia McCleskey, Angelica Hale, Phillip Huber, and Aubie Merrylees.\n“I love how full of life and how caring Betty is. She is so smart and vivacious,” says Rogers. She is also drawn to Betty’s ability to be so nurturing. \"Throughout the story, she goes on a journey to find something that she feels is missing in her life. But along the way, she makes sure to stop and take care of people around her,” she says. “She never sees this as a burden or roadblock. She is willing to give so much of herself to the people around her. Betty views the world in such a beautiful way, it really inspires me to live my own life just a little bit happier and with more optimism.”\nA passion for performing was in Rogers’ DNA. She remembers her late father singing jazz tunes when she was a little girl while her mother adored show tunes. “My father loved to sing jazz music. He would make up his own songs that felt like their own standards,and he always wanted me to sing,” she says. \"My mother was a big musical theater girl who loved Wicked and Rent. And those were my two favorite musicals.”\nRogers begged her mother to let her audition for their community theater production of Peter Pan at Milford Performing Arts Center in Milford, Massachusetts, where she was living at the time. (She also grew up in Richmond, Texas, outside Houston.) Playing homage to Wicked, she sang “Popular” and was cast in the ensemble playing a member of Tiger Lily’s tribe. “Instead of being Native Americans, we were hippies,” says Rogers.\nShe vividly remembers her mother getting the call that they wanted her seven-year-old self for the show. “I was so excited, I ran around the house, losing my mind,” says Rogers. “And ever since, I’ve been hooked.”\nThroughout the years Rogers continued to do theater, and in her senior year of high school, Rogers was cast as the Witch in Into The Woods. The part won her the Tommy Tune award, given to students who excel in theater in the greater Houston area. That also gave her the opportunity to participate Jimmy Awards, which celebrates the best musical theater talent from around the nation. Rogers made it to the finals.\n“When I won the Tommy Tune Award I was so shocked. I was so sure that another girl, who I'm still friends with and was amazing, was going to win,” she says. But after that accolade and the Jimmy Awards she knew that this was her path.\nRogers was accepted into the Manhattan School of Music, a conservatory in New York City, to study musical theater. After two years, a professional career beckoned. She was cast in the musical Becoming Nancy, directed by Jerry Mitchell, who would later cast her in BOOP!. “That is when things really began for me,” says Rogers, who played Gretchen Wieners in the first national tour of Mean Girls.\nAs much as she always longed for it, she didn’t know if playing a title role like Betty Boop would actually be within her reach. “When I was little, I wondered if one day I would get to be Wendy in Peter Pan, or Cinderella in Cinderella,” says Rogers. “And here I am doing that. It was always a dream of mine, and the fact that I’m here doing it is really special.”\nRogers hopes people feel that sense of joy that she feels at each performance. “This show is joy personified. And I hope that we are bringing joy to people in a time where joy feels very sparse sometimes,” she says. “And I hope people walk away feeling uplifted, loved, ready to love and with a smile on their face.”",
        "custom_category": "Entertainment"
    },
    {
        "title": "Dominic Sessa to play Anthony Bourdain in new biopic: Details",
        "description": "Dominic Sessa is slated to play Anthony Bourdain in an upcoming biopic covering a portion of the late chef and author's life.",
        "content": "Dominic Sessa to play Anthony Bourdain in new biopic: Details\nDominic Sessa attends Cirque Du Soleil's \"Luzia\" New York Premiere at Randall's Island on March 06, 2025 in New York City. | Anthony Bourdain attends the Creative Arts Emmy Awards at Micro... [2370 chars]",
        "url": "https://abcnews.go.com/GMA/Culture/dominic-sessa-play-anthony-bourdain-new-biopic-details/story?id=121128898",
        "image": "https://i.abcnewsfe.com/a/f4e5690a-f6f7-47a5-b045-868128167a97/sessa-bourdain-gty-jef-250424_1745508089328_hpMain_16x9.jpg?w=1600",
        "publishedAt": "2025-04-24T20:49:48Z",
        "source": {
            "name": "ABC News",
            "url": "https://abcnews.go.com"
        },
        "scrap_content": "Dominic Sessa to play Anthony Bourdain in new biopic: Details\nSessa recently starred in 2023's \"The Holdovers.\"\nDominic Sessa will star as Anthony Bourdain in a new biopic about the late chef's life.\nA24 confirmed the casting news for the upcoming film -- which will be called \"Tony\" -- on Wednesday, re-sharing a post from Variety about the casting news on the social platform X.\nAntonio Banderas will also appear in the movie, though his role is being kept under wraps, Variety reported. The film will take place in 1976 and cover the life-changing experiences Bourdain had working and living in Provincetown, Massachusetts, according to the outlet.\nBourdain enrolled in culinary school in 1978, two years after the film is set.\nHe was the executive chef of Brasserie Les Halles in New York City and penned the 2000 memoir \"Kitchen Confidential: Adventures in the Culinary Underbelly.\"\nBourdain also received several Creative Arts Emmy Awards during his life, as well as several posthumous Emmys, for his work on the unscripted series \"Parts Unknown.\" He died in Strasbourg, France, in 2018 at age 61.\nMatt Johnson is set to direct the biopic from a script written by Todd Barrels and Lou Howe. The project begins shooting in May.\nBourdain's estate rep Kimberly Witherspoon serves as an executive producer on the film.\nABC News has reached out to A24 for more information.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Meet the Masters of Evil, Earth's Mightiest Villains",
        "description": "From Baron Zemo's initial roster to the formation of the Thunderbolts, learn all about the infamous group of villains that rivals the Avengers.",
        "content": "CRIMSON COWL'S MASTERS OF EVIL\nAs the Avengers became a permanent fixture of the Marvel Universe, Dane Whitman took the mantle of Black Knight from his predecessor and used it to do good. His first order of business? Infiltrating the new Masters of E... [738 chars]",
        "url": "https://www.marvel.com/articles/comics/meet-the-masters-of-evil-earths-mightiest-villains-avengers-rivals-thunderbolts",
        "image": "https://cdn.marvel.com/content/1x/mastersofevil_card.jpg",
        "publishedAt": "2025-04-24T20:46:46Z",
        "source": {
            "name": "Marvel.com",
            "url": "https://www.marvel.com"
        },
        "scrap_content": "Meet the Masters of Evil, Earth's Mightiest Villains\nFrom Baron Zemo's initial roster to the formation of the Thunderbolts, learn all about the infamous group of villains that rivals the Avengers.\nWhile Earth's Mightiest Heroes band together as the Avengers to defend the Marvel Universe, the world's most formidable super villains also joined forces over the years as the Masters of Evil. From Baron Zemo to the Wrecking Crew, the Masters of Evil feature a rotating roster of some of the most vicious super villains around, all working together to take down the Avengers.\nAs a new roster comes together in AVENGERS (2023) #25 by Jed MacKay and Valerio Schiti, let’s take a closer look at the history of the Masters of Evil and their long-running feud with the Avengers.\nTHE FIRST MASTERS OF EVIL\nWhen Baron Zemo learned that Captain America survived World War II, he formed the very first iteration of the Masters of Evil in AVENGERS (1963) #6. He realized he needed a team of his own to counter Captain America's new friends and reached out to mutual enemies of the heroes. Together, they became the Masters of Evil.\nThis initial roster included Iron Man villains such as Radioactive Man, Black Knight, and Melter. However, the Avengers outsmarted them and made quick work of the Masters of Evil.\nTo replace his missing members, Zemo then enlisted Thor's enemies, Enchantress and Executioner, to continue his vendetta. When Thor joined the battle in full, he banished the villains to parts unknown using his Asgardian magic.\nCRIMSON COWL'S MASTERS OF EVIL\nAs the Avengers became a permanent fixture of the Marvel Universe, Dane Whitman took the mantle of Black Knight from his predecessor and used it to do good. His first order of business? Infiltrating the new Masters of Evil and warning the Avengers of their existence in AVENGERS (1963) #54.\nA mysterious figure known as the Crimson Cowl led this version of the villainous team, which comprised of Klaw and Whirlwind, as well as former members Melter and Radioactive Man.\nHowever, it was none other than Edwin Jarvis beneath the Crimson Cowl's mask, complete with access to the Avengers Mansion's schematics and security systems. In actuality, Ultron-5 brainwashed Jarvis and occasionally used him as a stand-in. The Avengers thankfully brought Jarvis back to his sense.\nWith the Black Knight in tow, the Avengers defeated Ultron and the Masters of Evil once again in AVENGERS (1963) #55. However, this wouldn’t be the last time the fight came close to home.\nEGGHEAD'S MASTERS OF EVIL\nNot every Masters of Evil lineup is created equal. While some versions of the team pose planetary threats, others are significantly less foreboding and competent. The criminal genius Egghead arguably created one of the weaker iterations of the team in AVENGERS (1963) #222, with the purpose of conducting raids for valuable equipment.\nEgghead initially recruited Whirlwind, Moonstone, Tiger Shark, and Scorpion to his team, but the Avengers defeated them when Whirlwind approached Wasp. Undeterred, Egghead then reassembled the Masters of Evil in AVENGERS (1963) #228, replacing Whirlwind and Scorpion with Radioactive Man, Beetle, and Shocker.\nIntent on revenge, the Masters of Evil kidnapped Hank Pym and forced him to develop technology with Egghead, only for the villain to be defeated for good in AVENGERS (1963) #229.\nAVENGERS MANSION UNDER SIEGE\nHeinrich Zemo's son, Helmut Zemo, turned the Masters of Evil into a family tradition by forming the most ambitious version of the team yet in AVENGERS (1963) #273. After conducting months of covert surveillance on Avengers Mansion, the new Baron Zemo calculated that the odds for an all-out attack leaned in his favor.\nTo enact his plan, Zemo enlisted the largest Masters of Evil roster yet, with a lineup that included Moonstone, Blackout, Mister Hyde, Goliath, Yellowjacket, Absorbing Man, Titania, Fixer, Tiger Shark, and the Wrecking Crew.\nWhen the perfect moment to strike presented itself, the Masters of Evil overcame Avengers Mansion's security protocols and took Jarvis hostage. The Masters of Evil initially targeted the Avengers separately, but they quickly regrouped to take on the villains who now operated out of their headquarters.\nThe battle culminated in a confrontation between Captain America and Zemo, with the Avengers winning the fight in AVENGERS (1963) #277. However, the mansion was left in ruins from the crossfire.\nDOCTOR OCTOPUS' MASTERS OF EVIL\nDoctor Octopus formed one of the strangest versions of the Masters of Evil in GUARDIANS OF THE GALAXY (1990) #28.\nWhile Earth’s heroes battled for the fate of the universe in INFINITY WAR (1992), they left Avengers Mansion undefended. Otto Octavius seized the opportunity, gathering Shocker, Absorbing Man, Yellowjacket, Titania, Oddball, Gargantua, Powderkeg, Jackhammer, and Puff Adder to raid the unguarded headquarters.\nHowever, the sudden arrival of the Guardians of the Galaxy from an alternate future at Avengers Mansion foiled Octavius' plan. The Masters of Evil and Guardians of the Galaxy erupted into a fierce battle, only to be interrupted by cosmic doppelgangers. The conflicting factions subsequently joined forces against their new common enemy.\nThough Doctor Octopus immediately wanted to resume hostilities against the Guardians, his own team turned against him, choosing to preserve their newly formed truce.\nTHE THUNDERBOLTS\nIn INCREDIBLE HULK (1962) #449, a new super hero team called the Thunderbolts presented themselves to the world. At the time, their secret identities remained unknown. Nevertheless, the Thunderbolts helped fill the heroic void left by the Avengers and Fantastic Four after they were presumed dead following a battle against Onslaught in ONSLAUGHT: MARVEL UNIVERSE (1996) #1.\nHowever, the shocking truth behind this new team was revealed in THUNDERBOLTS (1997) #1. The Thunderbolts were in fact secretly the Masters of Evil, led by Helmut Zemo and joined by Moonstone, Fixer, Goliath, Beetle, and Screaming Mimi.\nHoping to seize control of the entire world, Zemo constructed this elaborate plan to win public trust as everyone mourned Earth’s heroes. However, Zemo did not count on his teammates actually desiring redemption; they ditched his original scheme for a chance at atonement.\nJUSTINE HAMMER'S MASTERS OF EVIL\nWhile the Thunderbolts' paraded around as heroes, Justin Hammer's equally evil daughter Justine Hammer tried to take over New York with the help of Hydra. Assuming the mantle of the new Crimson Cowl, Justine created her own Masters of Evil ensemble in THUNDERBOLTS (1997) #3, making it the biggest version of the team yet. Upset that an outsider usurped his father's legacy, Zemo led the Thunderbolts in several skirmishes against the new Masters of Evil.\nCrimson Cowl launched her master plan against the Thunderbolts, outnumbering them and armed with weather-controlling technology, in THUNDERBOLTS (1997) #25. With assistance from Hawkeye and other heroes, the Thunderbolts successfully turned the tides back in their favor. While Justine continued to be a thorn in the Thunderbolts’ side moving forward, she no longer commanded the same number of villains.\nTHE SHADOW COUNCIL MASTERS OF EVIL\nOn an undercover mission in SECRET AVENGERS (2010) #21.1, Captain America and Hawkeye discovered a version of the Masters of Evil working on behalf of the Shadow Council.\nLed by Max Fury, an advanced Life Model Decoy reprogrammed as a cunning villain, the roster included Vengeance, Whiplash, and Princess Python. Fury significantly expanded his team’s membership after an introductory battle against the Secret Avengers and took over the country of Baglia as part of his growing plans for global domination.\nHelmut Zemo seized control of this Masters of Evil lineup in AVENGERS UNDERCOVER (2014) #1, with Madame Masque, Constrictor, and Daimon Hellstrom as his most trusted associates. He also offered a place on the team to the young heroes who survived Arcade's latest twisted Murderworld gauntlet. Though some heroes refused Zemo's offer and foiled his plans, he escaped with several new recruits.\nLIGHTMASTER'S MASTERS OF EVIL\nWhile the Shadow Council and Zemo led their version of the Masters of Evil on its most ambitious schemes, a smaller iteration of the team also used the Masters of Evil moniker.\nIntroduced in SUPERIOR SPIDER-MAN TEAM-UP (2013) #5, Lightmaster created a new Masters of Evil in response to the more heavy-handed tactics used by Spider-Man at a time when Otto Octavius secretly possessed Peter Parker's body. The Wrecking Crew, Absorbing Man, Mister Hyde, Titania, Whirlwind, and Blackout all joined Lightmaster to take on Otto's mind-controlled team, the Superior Six.\nLightmaster's team proved to be a short-lived endeavor, launching a rematch against the Superior Six in SUPERIOR SPIDER-MAN TEAM-UP (2013) #6. A raid on Parker Industries during the battle freed the Superior Six from Octavius' control, leading them to violently turn on anyone in their way, including Spider-Man and the Masters of Evil. While Spider-Man defeated the rogue Superior Six and Lightmaster’s team, Manhattan was left severely damaged in the wake of the super-powered brawl.\nSECRET EMPIRE MASTERS OF EVIL\nHelmut Zemo decided to double down on his villainous legacy in THUNDERBOLTS (2016) #10, forming an even more ambitious version of the Masters of Evil. When Zemo learned that Bucky Barnes now led the Thunderbolts, he ambushed his old associates and demanded they rejoin the Masters of Evil. Zemo's new team thus consisted of the Wrecking Crew, Tiger Shark, Klaw, Whiplash, and Man-Killer.\nAround this time, a Hydra variant of Captain America created by the sentient Cosmic Cube Kobik seized control of the United States in SECRET EMPIRE (2017). Zemo and the Masters of Evil agreed to join the Army of Evil to quell any resistance to Hydra's nationwide rise to power in CAPTAIN AMERICA: STEVE ROGERS (2016) #13. After the true Captain America overthrew his evil doppelganger and toppled Hydra, the heroes defeated Zemo and his allies.\nWEST COAST MASTERS OF EVIL\nClint Barton and Kate Bishop started a new chapter of the West Coast Avengers in Southern California, drawing the ire of Madame Masque, who countered it with a West Coast version of the Masters of Evil.\nMaking their full debut WEST COAST AVENGERS (2018) #6, the West Coast Masters of Evil recruited Lady Bullseye, M.O.D.O.K., Graviton, the Eel, Satana Hellstrom, and Kate’s parents. Together, these villains sought to drive the heroes out of Los Angeles, with Masque's squad keeping the newly formed Avengers off-balance by involving those closest to Kate.\nThe West Coast Avengers soon learned that Satana facilitated the Masters of Evil’s activities with dark magic, recruiting vampires and murderous cults into their ranks. This prompted the heroes, alongside the newly introduced Jeff the Land Shark, to get involved. While the West Coast Avengers prevailed, the incident proved no coast lied outside of the villains' reach.\nDOOM SUPREME'S MULTIVERSAL MASTERS OF EVIL\nAs Mephisto's plans for hellish conquest spread across the Multiverse, he encountered an alternate version of Doctor Doom who reigned as the Sorcerer Supreme of Earth-22215 in AVENGERS (2018) #50. Empowered by Mephisto and his Council of Red, the villain known as Doom Supreme traveled the Multiverse to build his own team, using them to reshape history in all realities. With Doom Supreme at the helm, the Multiversal Masters of Evil comprised of Dark Phoenix, Kid Thanos, King Killmonger, Ghost Goblin, and the Black Skull.\nAs this ensemble conquered reality after reality, the mysterious hero known as Avenger Prime sent his army of time-traveling Deathloks to gather forces of his own. Doom Supreme soon arrived on Earth-616 to obtain the First Firmament, a cosmic force capable of rewriting reality in his image free of Mephisto, bringing his team into conflict with the Avengers.\nThe harrowing showdown in AVENGERS ASSEMBLE OMEGA (2023) #1 required the combined might of multiple Avengers teams to defeat their Multiversal opponents.\nTHE MASTERS OF EVIL REBEL AGAINST DOCTOR DOOM\nEchoing the destiny of his Earth-22215 counterpart, the Doctor Doom of Earth-616 also ascended to the station of Sorcerer Supreme during the chaos of BLOOD HUNT (2024). Using all of his magical might, Doom united the entire world under his banner in ONE WORLD UNDER DOOM (2025).\nAs the Avengers tried to unravel how Doom came to rule the world, a frustrated Mad Thinker formed a new iteration of the Masters of Evil with Mister Hyde, Madcap, Dreadknight, and the Exterminatrix to overthrow the ironclad despot in AVENGERS (2023) #25.\nThis development coincided with M.O.D.O.K., Doctor Octopus, Madelyne Pyror, Baron Mordo, Arcade, and Mysterio forming their own Masters of Evil team, one working directly alongside the Avengers to topple Doom in ONE WORLD UNDER DOOM (2025) #2.\nAs the Avengers and M.O.D.O.K.'s team launched an all-out attack on the magically protected Latveria, they incurred Doom's wrath. Meanwhile, Mad Thinker's ensemble teleported into the Impossible City, the Avengers' orbital headquarters, with ill intentions. However, these Masters of Evil found that the base wasn’t completely devoid of heroes…\nFind out what schemes the new Masters of Evil are cooking up in the Impossible City in AVENGERS (2023) #25 by Jed MacKay and Valerio Schiti, available now.\nGrab these comics and more at your local comic book shop! Or redeem then read your digital copy on the Marvel Unlimited app by using the code found in your print comic. Find and support your local comic book shop at ComicShopLocator.com.\nTo read your Marvel comics digitally, download the Marvel Unlimited app for iOS and Android devices. Gain an expansive catalog of 30,000+ comics spanning Marvel Comics history, plus access your entire digital library including comics redeemed from print.\nThe Hype Box\nCan’t-miss news and updates from across the Marvel Universe!",
        "custom_category": "Entertainment"
    },
    {
        "title": "Chanel Continues Celebrating Its New Chance Fragrance",
        "description": "Chanel continues celebrating its new Chance fragrance, with a music-related video and a pop-up in London.",
        "content": "CHANCE ENCOUNTERS: As part of the ongoing celebration of its Chance Eau Splendide’s launch on April 15, Chanel held an intimate gathering Thursday evening in Paris’ Soho House to air the video “Taking A Chance in Music.”\nSingers Solange Knowles, Nene... [4776 chars]",
        "url": "https://wwd.com/fashion-news/fashion-scoops/chanel-chance-fragrance-london-pop-up-1237102691/",
        "image": "https://wwd.com/wp-content/uploads/2025/04/Screenshot-2025-04-24-at-22.33.19.jpeg?crop=0px%2C101px%2C951px%2C533px&resize=1000%2C563",
        "publishedAt": "2025-04-24T20:44:47Z",
        "source": {
            "name": "WWD",
            "url": "https://wwd.com"
        },
        "scrap_content": "CHANCE ENCOUNTERS: As part of the ongoing celebration of its Chance Eau Splendide’s launch on April 15, Chanel held an intimate gathering Thursday evening in Paris’ Soho House to air the video “Taking A Chance in Music.”\nSingers Solange Knowles, Neneh Cherry, Yukimi and Angèle, who is ambassador of Eau Splendide, discussed subjects such as chance and jazz in a clip to be shown on media platforms and YouTube.\n“It was clear from Day One that working with Chanel, they wanted to go on a musical odyssey, which is what we’ve done,” said Dave Holt, publisher and chief creative officer of Wax Poetics, which made the video with the French luxury house. “They wanted to illustrate how creative lives have to take a chance.”\nThe shooting of the roundtable discussion took place on a bitter day in Paris. (The proceedings were also captured in a mini Wax Poetics magazine.)\nYou May Also Like\n“I’ve always found connection with the idea of waiting for a sign and understanding why things happen they way they do,” said Angèle, in the spot’s opening, which also has toggling images of Paris. “There’s something about stepping out of your comfort zone, the feeling of not knowing what will happen, but trusting that it will lead you to something.\n“Paris has always been a place of hidden gems, with stories waiting to unfold, a place where art and creativity is constantly in the air,” she continued.\nOlivier Polge, Chanel’s in-house perfumer-creator, likened music and perfume. “Somehow, it expresses something intimate, as well,” he said. “There is something that translates from you. We are very poor in words, when you speak about perfume. There are none that really expresses the reality of it. We use a lot of words from music: We speak about notes, about accords — I think you could even speak about the tonality of a perfume. There is something that we cannot express, and I like that.”\nKnowles shared about being courageous when she recorded her first record at age 14. “Sonically I listen back to it, and it’s much more experimental and adventurous as I think it was packaged to be,” she said. “There was some brave moments there. I also feel like as a teenager, you’re writing from such a raw and honest place that I feel like lyrically I still haven’t upped a lot of things that I said. There’s poetry in everything I said.”\n“Music’s a very powerful medium,” continued Cherry. “I had a little radio on in the hotel room that was set on a jazz station for effect as you walk in the room. I just left it there and a Dinah Washington song came on. I love her so much — I was just lying there, kind of bleeding a little bit from my heart. Just feeling and thinking, I guess leading to this conversation we’re going to have [about] the language of music… the feelings that music and sound evokes. It’s beyond language.”\nKnowles said: “It carries smell, it carries sight.” She called it “such an incredible gift and tool that we have to be transporters of time and space in that way.”\nTaking a chance for Yukimi is “leaning into life. What I think of is having your eyes closed and jumping back and waiting for something to catch you.”\nShe added it’s about “having some kind of a faith in that something will catch you, and that there is some kind of a plan there.”\nChanel didn’t stop there with its global rollout of the Chance Eau Splendide.\nIt made sure to take its new fragrance to the streets of Shoreditch in east London. The brand painted a small vicinity in the fragrance’s lilac shade from Shoreditch House all the way to Chance Street, where a pop-up will take place from Friday to May 5.\nThe pop-up space has been painted in a Pop Art-inspired mural with the fragrance bottle and the slogan “Take your chance!”\nInside there were nods to Gabrielle “Coco” Chanel’s superstition with a small box that mimicked the cap of the fragrance, which is based on a dice with each side opening up to a mystical message such as “Chance is a remarkable twist of fate.”\nOther rooms included fun games, such as an ATM-like machine that printed small swatches of the fragrance onto a sample card; a lottery machine that contained prizes such as a poster, mirror or samples; a labyrinth table game and a bar that lets visitors smell all the other iterations of Chance, from Chance Eau Fraîche, Chance Eau Tendre to Chance Eau Vive.\nThe pop-up ends with a small store allowing visitors to purchase Chance Eau Splendide and to also get a taste of a complimentary candy floss inspired by the purple hue of the fragrance. The pop-up will also be offering fragrance and beauty consultations on site including Chance-inspired makeup looks.\nOn May 1, visitors can book in for a Chance Street soirée with a live DJ, cocktails and canapés.",
        "custom_category": "Entertainment"
    },
    {
        "title": "Joe Quesada and Christopher Priest Introduce the Future King of Wakanda in 'Marvel Knights: The World to Come' #2",
        "description": "Check out the cover for the second issue of 'Marvel Knights: The World to Come,' the new series from visionary creators Joe Quesada and Christopher Priest launching this June.",
        "content": "MARVEL KNIGHTS: THE WORLD TO COME #2 (OF 6)\nStory by JOE QUESADA & CHRISTOPHER PRIEST\nWritten by CHRISTOPHER PRIEST\nArt and Wraparound Cover by JOE QUESADA\nColors by RICHARD ISANOVE\nOn Sale 7/9\nWhen asked about the second issue, Quesada said, \"There'... [840 chars]",
        "url": "https://www.marvel.com/articles/comics/joe-quesada-christopher-priest-marvel-knights-the-world-to-come-2-future-king-of-wakanda",
        "image": "https://cdn.marvel.com/content/1x/mktwtc2025002cvr_card.png",
        "publishedAt": "2025-04-24T20:37:30Z",
        "source": {
            "name": "Marvel.com",
            "url": "https://www.marvel.com"
        },
        "scrap_content": "Joe Quesada and Christopher Priest Introduce the Future King of Wakanda in 'Marvel Knights: The World to Come' #2\nCheck out the cover for the second issue of 'Marvel Knights: The World to Come,' the new series from visionary creators Joe Quesada and Christopher Priest launching this June.\nThis June, two industry titans present a new vision of the Marvel Universe in MARVEL KNIGHTS: THE WORLD TO COME! Both founding creators behind MARVEL KNIGHTS, Joe Quesada and Christopher Priest reunite alongside color artist Richard Isanove to tell an all-new epic through the lens of the groundbreaking MARVEL KNIGHTS imprint.\nSet in the future, the six-issue series introduces new versions of Marvel heroes as well as those that follow in their footsteps! Today, fans can learn more with the reveal of the series’ second issue, on sale this July.\nTHE WORLD TO COME and how it got that way is revealed! Uncover the shocking developments that led to the death of the T'Challa and the dark truth behind the conflict erupting across the globe. What secrets await in Mexico? What role did Everett K. Ross play in the King of Wakanda's fall and, most importantly, who is T'Challa's heir?!\nMARVEL KNIGHTS: THE WORLD TO COME #2 (OF 6)\nStory by JOE QUESADA & CHRISTOPHER PRIEST\nWritten by CHRISTOPHER PRIEST\nArt and Wraparound Cover by JOE QUESADA\nColors by RICHARD ISANOVE\nOn Sale 7/9\nWhen asked about the second issue, Quesada said, \"There's not a lot I can say without revealing too much. So what I can say is that if you think issue 1 was insane, issue 2 has even more unexpected twists and turns, because Wakanda has a new Queen and soon there will be a new heir to the throne.\"\nCheck out the new cover and preorder MARVEL KNIGHTS: THE WORLD TO COME #2 at your local comic shop today!\nGrab these comics and more at your local comic book shop! Or redeem then read your digital copy on the Marvel Unlimited app by using the code found in your print comic. Find and support your local comic book shop at ComicShopLocator.com.\nTo read your Marvel comics digitally, download the Marvel Unlimited app for iOS and Android devices. Gain an expansive catalog of 30,000+ comics spanning Marvel Comics history, plus access your entire digital library including comics redeemed from print.\nThe Hype Box\nCan’t-miss news and updates from across the Marvel Universe!",
        "custom_category": "Entertainment"
    },
    {
        "title": "'Sinners' To Top 'The Accountant 2' At Weekend Box Office",
        "description": "'Sinners' is expected to beat the Ben Affleck sequel 'The Accountant 2' at the weekend box office with $24M+",
        "content": "Do not deny the A CinemaScore for Warner Bros’ Sinners, for that heat on the Ryan Coogler-directed, Michael B. Jordan-starring title is bound to deliver a solid hold, which is rare for a horror movie. While conservative forecasts have Sinners droppin... [2387 chars]",
        "url": "https://deadline.com/2025/04/sinners-the-accountant-2-box-office-preview-1236376459/",
        "image": "https://deadline.com/wp-content/uploads/2025/04/Sinners-and-Accoutant-2.jpg?w=1024",
        "publishedAt": "2025-04-24T20:33:00Z",
        "source": {
            "name": "Deadline",
            "url": "https://deadline.com"
        },
        "scrap_content": "Do not deny the A CinemaScore for Warner Bros’ Sinners, for that heat on the Ryan Coogler-directed, Michael B. Jordan-starring title is bound to deliver a solid hold, which is rare for a horror movie. While conservative forecasts have Sinners dropping 60% ($19.2 million) in its second frame, there’s a school of thought that the period vampire movie’s hold is significantly better than 50% ($24M). Jordan Peele’s Get Out, which opened to $33M in late February 2017, posted an amazing second-weekend ease off 15%, good for $28.2M.\nSinners grossed $7.1M on Wednesday, off 17% from a $8.6M Tuesday. Through six days, the movie has grossed $71.5M in the U.S. and Canada.\nWatch on Deadline\nAmazon MGM Studios/Artists Equity’s The Accountant 2, which has Ben Affleck reprising his gun-toting beancounter for the dark side, is bound for a $20M+ opening weekend at 3,610 theaters, fueled by men and women over 25 in first choice. Affleck heard the call of his fans, and thus made a sequel to the 2016 mob accountant crime thriller that opened to $24.7M and ended its run at $86.2M stateside, $155.5M worldwide. Gavin O’Connor, who directed the first movie, returns to helm, as well as Jon Bernthal as Affleck’s brute-force brother and Cynthia Addai-Robinson as the Deputy U.S. Treasury Director who works with Affleck. Daniella Pineda steals the show as a nefarious hitwoman.\nShowtimes start today at 4 p.m. The movie’s advance ticket sales are dead on with the Sandra Bullock-Channing Tatum adult spring feature Lost City, which opened to $30M.\nAnd if there wasn’t another place on the calendar for a R-rated horror movie, Sony has Screen Gems’ David F. Sandberg-directed Until Dawn, about a group of friends trapped in a time loop, where mysterious foes are chasing and killing them in gruesome ways, must survive until dawn to escape it. The movie was cheap at $15M net, and it’s expected to do between $8M-$9M at 3,000 locations. Previews also start at 4 p.m. The movie is best in first choice with men under 25.\nA24 is expanding the teen fantasy The Legend of Ochi from four New York City and L.A. theaters to 1,100. The pic didn’t fare well in its limited release last weekend, with a $13,000 theater average. Still, it is tops with critics at 84% fresh on Rotten Tomatoes. Starring Finn Wolfhard, Emily Watson, Willem Dafoe, Helena Zengel and directed/written by Isaiah Saxon, the pic follows a shy girl in a remote village on the island of Carpathia. She’s raised to fear an elusive animal species known as ochi. But when she discovers a wounded baby ochi has been left behind, she escapes on a quest to bring him home.",
        "custom_category": "Entertainment"
    },
    {
        "title": "LOVE, DESIRE, AND SHOCKING TWISTS IN TLC’S NEW SERIES, 90 DAY: HUNT FOR LOVE",
        "description": "Click HERE for Trailer and HERE for Photos",
        "content": "Click HERE for Trailer and HERE for Photos\n(Los Angeles, Calif.) – Today, TLC announced its newest series, 90 DAY: HUNT FOR LOVE, an exhilarating rollercoaster ride featuring eight singles from the 90 Day universe who are ready to embark on a quest f... [4154 chars]",
        "url": "https://press.wbd.com/us/media-release/90-day-hunt-love-press-coverage",
        "image": "https://static.cdn.turner.com/favicon_0.ico",
        "publishedAt": "2025-04-24T20:23:02Z",
        "source": {
            "name": "Warner Bros. Discovery",
            "url": "https://press.wbd.com"
        },
        "scrap_content": "Click HERE for Trailer and HERE for Photos\n(Los Angeles, Calif.) – Today, TLC announced its newest series, 90 DAY: HUNT FOR LOVE, an exhilarating rollercoaster ride featuring eight singles from the 90 Day universe who are ready to embark on a quest for love once again, joined by fresh, new faces and romantic hopefuls. Set in Tulum, Mexico, these love-hungry alums have loved, lost and learned a few lessons along the way. Whether they’re healing old wounds, chasing new sparks, or unknowingly walking straight into a love triangle, each of them throws caution to the wind as they jump back into the dating game. 90 DAY: HUNT FOR LOVE premieres Monday, May 26 at 8PM ET/PT on TLC.\nStep into a world where sparks fly and hearts race as everyone is introduced at a masquerade ball to connect, flirt, and find romance. But it’s not just about finding someone new—some of these singles have a history! Will old flames reignite? As jealousy bubbles up faster than the hot tub jets during a hot-tub-speed-dating session, tensions rise, and feelings get messy. From flirty first impressions to late-night confessions, expect shocking hook-ups and unexpected pairings. The journey transforms into a thrilling adventure in chemistry and connection, filled with romantic curveballs and twists for each of the singles.\nWhile you’ll have to wait to meet the new singles, let’s catch up with the eight familiar names from the 90 Day Fiancé franchise. Tiffany (90 Day Fiancé: The Other Way), with her big heart and even bigger hopes, is giving love another shot. Chantel (The Family Chantel) is ready to move on and turn heads after a rough past. Colt (90 Day Fiancé), quirks and all, is in Tulum with a fresh mindset, something to prove, and someone to woo. Cortney (90 Day Fiancé: Before the 90 Days), free-spirited and fiercely independent, is jumping back into the dating scene. Nigerian musician Usman (90 Day Fiancé: Before the 90 Days) wants someone, who loves him for who he is, and not just for his fame. Tim (90 Day Fiancé: Before the 90 Days), thoughtful and endearingly awkward, might be closer to finding love than he thinks. Jeniffer (90 Day Fiancé: Before the 90 Days), sultry and strong-willed, isn’t playing games, unless she’s winning them. And Rob (90 Day: The Last Resort) is back, more single than ever, hoping this journey leads to a real connection, if his past doesn’t get in the way.\nIn addition to the series, a companion show, HUNT FOR LOVE: BETWEEN THE SHEETS, premieres on Mondays following episodes of 90 DAY: HUNT FOR LOVE. This unfiltered, one-hour after-show dives deeper into each week’s episodes. Cast members from this season will provide behind-the-scenes commentary and personal reflections on their heated romances in Tulum. Through never-before-seen footage, viewers will get an exclusive insider look at what really went down, both on and off camera, in paradise.\nFollow 90 DAY FIANCÉ on Facebook, Instagram, X, TikTok, YouTube and TLC.com for the latest on all things 90 DAY FIANCÉ. Join the conversation using #90DayFiance and #HuntforLove.\n90 DAY: HUNT FOR LOVE and HUNT FOR LOVE: BETWEEN THE SHEETS are produced by Sharp Entertainment, a part of Sony Pictures Television – Nonfiction, for TLC.\nABOUT TLC\nOffering remarkable real-life stories without judgment, TLC shares everyday heart, humor, hope and human connection with programming genres that include fascinating families, heartwarming transformations, and life’s milestone moments. TLC is a global brand available in more than 75 million homes in the U.S. and 270 million households around the world. Fans can find exclusive original video content on TLC.com and also interact with other TLC enthusiasts on Facebook, Instagram, Twitter, TikTok, and YouTube. TLC is owned by Warner Bros. Discovery, a leading global media and entertainment company available in more than 220 countries and territories and 50 languages whose portfolio also includes Discovery Channel, discovery+, CNN, DC, Eurosport, HBO, Max, Food Network, OWN, Investigation Discovery, HGTV, Magnolia Network, TNT, TBS, truTV, Travel Channel, MotorTrend, Animal Planet, Science Channel, Warner Bros. Pictures, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies and others. For more information on TLC shows, please visit www.wbd.com.\nPRESS CONTACTS\nNicole VanderPloeg\nJackie Kronick",
        "custom_category": "Entertainment"
    }
]