[
    {
        "title": "About 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing",
        "description": "Three days of public viewing of Pope Francis’ body by ordinary mourners and statesmen alike have ended. Francis died on Monday at age 88 after suffering a stroke.",
        "content": "VATICAN CITY (AP) — More than 250,000 people paid their last respects to Pope Francis over three days of public viewing by ordinary mourners and statesmen alike that ended Friday, the eve of his state funeral in St. Peter’s Square and burial in a bas... [5549 chars]",
        "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
        "image": "https://dims.apnews.com/dims4/default/c5170f5/2147483647/strip/true/crop/8134x4575+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fae%2F9368acab1ca0e1fc25a0d7a438ad%2Fb3f601edc6b94d9f823a397e86672cb8",
        "publishedAt": "2025-04-25T17:39:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "About 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing\nAbout 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing\nVATICAN CITY (AP) — More than 250,000 people paid their last respects to Pope Francis over three days of public viewing by ordinary mourners and statesmen alike that ended Friday, the eve of his state funeral in St. Peter’s Square and burial in a basilica outside the Vatican’s walls.\nWorld leaders, including U.S. President Donald Trump and Argentine President Javier Milei, along with royalty, converged on Rome for the funeral, but the group of marginalized people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp.\nThe Vatican said that 164 delegations are confirmed, including 54 heads of state and 12 reigning sovereigns. French President Emmanuel Macron, who will also attend the funeral, was among those who made it in time to pay last respects to the pope.\nPaying respects\nTens of thousands of mourners waited hours in line over three days to bid farewell to Francis, who died Monday after suffering a stroke at the age of 88. A higher-than-expected turnout prompted the Vatican to extend the basilica’s opening hours overnight.\nA changing of the guards at the sides of Francis’ open coffin signaled the end of the viewing period. The late pontiff was laid out in red robes, a bishop’s pointed miter and a rosary entwined in his hands.\nGiovanni Guarino drove from Naples with his girlfriend to bid their final farewells to the Francis, moved by his work to help the young and disadvantaged.\n“I hope that his successor follows the footsteps of Francis,” Guarino said.\nCardinal Kevin Farrell will preside over the closing and sealing of the coffin in his role of camerlengo, or interim Vatican administrator. A white cloth will be placed over the pope’s face, and a bag containing coins minted during his papacy will be put in the coffin along with a one-page written account of his papacy.\n‘We will see each other again’\nRoman neighbors and retired flight attendants Aurelia Ballarini and Francesca Codato came to pay respects to Francis on Friday with very different motivations. Ballarini, 72, was coming to terms with her grief, and Codato, 78, was seeking forgiveness.\nFor Ballarini, the pope’s death leaves a hole in her life. While only 16 years younger than Francis, she considered him a grandfather figure. Every morning, she would log on to Facebook for his daily greeting, and respond “with a couple of words.”\n“He gave everything, gave all of himself, up to the end,” said Ballarini. “I spent the last two days crying. I was not well after his passing — I can’t even say the word. For me he flew away. One day, we will see each other again.”\nCodato said that she feels tremendous guilt toward Francis, having forsaken him out of devotion to one of his predecessors, St. John Paul II. When Francis became pope “he was an outsider to me.”\n“I feel guilty, because through videos I have seen in these days, I have understood he was a man of enormous humanity, close to the simple people,” she said. “So I came to ask forgiveness, because I feel guilty towards him, like a worm.”\nCardinals ‘are in discussions’\nThe work of the conclave to choose a new pope won’t start until at least May 5, after nine days of public mourning.\nCardinals have been also been arriving in Rome, with 149 meeting on Friday morning to discuss church business. They won’t meet again until next week, meaning a conclave date is unlikely to be set until after the funeral.\nCardinal François-Xavier Bustillo, who hosted Francis during his last papal trip, to Corsica last year, remembered Francis as “a free man” who “humanized the church without desacralizing it.”\nHe described the atmosphere inside the meetings as “good,” but said that they weren’t yet “at the point of decisions; we are in discussions.”\nPapal burial\nIn keeping with Francis’ embrace of the marginalized, the Vatican said a group of poor and needy people will meet the pope’s coffin to pay homage to him when it arrives at St. Mary Major Basilica for burial on Saturday. It has already become a point of pilgrimage.\nThe tomb is being prepared behind a wooden barrier within the basilica that he chose to be near an icon of the Madonna that he revered and often prayed before. The burial will take place in private, the Vatican said.\nPhotos released by the Vatican on Friday show the marble tombstone flat against the pavement, with the simple engraving in Latin that he requested in his last testament: “Franciscus.”\nCardinals will visit the St. Mary Major Basilica on Sunday. Entering through the Holy Door, they will visit the Salus Populi Romani icon, which was dear to Francis, and celebrate evening prayers, the Vatican said.\nSecurity measures\nItaly is deploying more than 2,500 police officers and 1,500 soldiers to provide security during the funeral, which is expected to gather about 200,000 mourners in St. Peter’s Square and up to 300,000 people along the 4-kilometer (2½-mile) route from the Vatican to the pope’s burial place across Rome.\nThe major security operation includes stationing an armed naval vessel off the coast, and putting squads of fighter jets on standby, Italian media reported.\nRoyals and leaders\nTrump, who is traveling with first lady Melania Trump, is scheduled to arrive Friday, after Francis’ coffin has been sealed.\nUkrainian President Volodymyr Zelenskyy’s press office previously confirmed his presence, but he told reporters Friday evening on the site of a recent missile attack that he will attend if time permits, given obligations at home related to the ongoing war.\nAmong the other foreign dignitaries confirmed for the papal funeral are:\n— U.K. Prime Minister Keir Starmer\n— Prince William\n— King Felipe VI and Queen Letizia of Spain\n— Hungarian Prime Minister Viktor Orbán\n— Brazilian President Luiz Inácio Lula da Silva",
        "custom_category": "Trending"
    },
    {
        "title": "Mouse study confirms early inflammation in hereditary paralysis condition",
        "description": "A joint study conducted by the University of Bonn and the DZNE has confirmed early-stage brain inflammation in mice.",
        "content": "A joint study conducted by the University of Bonn and the DZNE has confirmed early-stage brain inflammation in mice.\nPatients with spastic paraplegia type 15 develop movement disorders during adolescence that may ultimately require the use of a wheel... [4288 chars]",
        "url": "https://www.news-medical.net/news/20250425/Mouse-study-confirms-early-inflammation-in-hereditary-paralysis-condition.aspx",
        "image": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/2/Alzheimers_amyloid_plaque_-_Juan_Gaertner_9638f1223d534b518a192c8478871d65-620x480.jpg",
        "publishedAt": "2025-04-25T17:37:00Z",
        "source": {
            "name": "News-Medical",
            "url": "https://www.news-medical.net"
        },
        "scrap_content": null,
        "custom_category": "Trending"
    },
    {
        "title": "3 Toronto women wanted for theft prompted by sexual assault",
        "description": "Toronto police have issued a “public safety alert” after a spree of sexual assaults prompted by “distraction” led to multiple thefts at commercial businesses in Scarborough.",
        "content": "The three women Toronto police say are wanted for spree of sexual assaults prompted by “distraction” in Scarborough. Thursday April 25, 2025 (TPS photos).\nToronto police say they are searching for three female suspects accused of sexually assaulting ... [1415 chars]",
        "url": "https://www.cp24.com/news/2025/04/25/3-toronto-women-wanted-after-a-spree-of-sexual-assaults-and-thefts-in-scarborough/",
        "image": "https://www.cp24.com/resizer/v2/KYT6EVJ6GVER5CSMUUCW7WGJHA.jpg?smart=true&auth=af3b1413abba984877960c0ce55e4f0b321f51c21fa002a2e8f8f0232ced47df&width=1200&height=630",
        "publishedAt": "2025-04-25T17:26:47Z",
        "source": {
            "name": "CP24",
            "url": "https://www.cp24.com"
        },
        "scrap_content": "Toronto police say they are searching for three female suspects accused of sexually assaulting victims at businesses in Scarborough in an attempt to distract them and steal their cash.\nIn a news release issued Friday, police say the same three suspects are believed to be responsible for at least five incidents that occurred at commercial businesses in Scarborough over a period of 10 months.\nAccording to police, the incidents, which occurred between June 2024 and April 2025, involved one suspect allegedly sexually assaulting an employee or owner of the store while another stole cash.\nIn each of the five reported incidents, police say the suspects fled in a dark-coloured Audi sedan or SUV.\nThe most recent incident allegedly took place on April 22, near Danforth Road and Danforth Avenue, according to investigators.\nThe previous four incidents happened on the following dates:\n- April 19, 2025 – Midwest Road and Midland Avenue area\n- March 13, 2025 – Danforth Road and Midland Avenue area\n- June 20, 2024 – St. Clair Avenue and Kingston Road area\n- June 19, 2024 – Mountjoy Avenue and Lamb Avenue area\nIt’s unclear how much money was stolen.\nAll of the suspects were described by police as having “olive skin” and “long black hair.” Police said two of the women had a “medium build” and the third had a “thin build.”\nAnyone with information can contact 41 Division at 416-808-4100 or Crime Stoppers anonymously at 416-222-TIPS.",
        "custom_category": "Trending"
    },
    {
        "title": "EU may accept 12-month work visas for ‘youth experience’ scheme with UK",
        "description": "Exclusive: Post-Brexit plan would allow British and European 18- to 30-year-olds to travel and work freely",
        "content": "The EU is prepared to make major concessions in negotiations to allow British and European 18- to 30-year-olds to travel and work freely, potentially paving the way for a long-awaited reset with Brussels.\nA scheme that would allow thousands of young ... [6113 chars]",
        "url": "https://www.theguardian.com/world/2025/apr/25/eu-may-accept-12-month-work-visas-for-youth-experience-scheme-with-uk",
        "image": "https://i.guim.co.uk/img/media/465d6943a6db80afd90da3244a7490ac83148592/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea800b35107ade3fb4e44b8a9fb8f10d",
        "publishedAt": "2025-04-25T17:17:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "scrap_content": "The EU is prepared to make major concessions in negotiations to allow British and European 18- to 30-year-olds to travel and work freely, potentially paving the way for a long-awaited reset with Brussels.\nA scheme that would allow thousands of young Europeans to live and work in the UK has been seen as a key EU demand in reaching a post-Brexit pact incorporating defence, energy and migration.\nIt is understood that EU member states could now be willing to limit work visas to as little as 12 months, with quotas on numbers and restrictions on the sectors EU citizens could work in.\nThey are also open to a “one in, one out” style plan being considered by the home secretary.\nEU sources said the scheme would be rebranded the “youth experience” programme in order to eliminate any suggestion that it was reopening immigration routes for EU citizens wanting to live and work in the UK.\nAsked about the prospect of a youth mobility scheme on Friday, a Downing Street spokesperson said: “Both sides are discussing a wide range of issues, which is entirely normal for a negotiation.”\nThe EU first proposed a youth mobility scheme that would allow young people to work or study for up to four years in each other’s countries in April 2024, but it was rejected by Labour and the Conservatives.\nAfter a year of discussion, sources say it is such a priority for key EU member states including France, Germany, Spain, Italy, Belgium and the Netherlands, that compromises need to be made.\nOne source said a one-year visa with an option of a further one- or two-year extension could land better politically.\nThe UK already takes part in a youth mobility scheme, which allows people from 12 non-EU nations to work in the country for a two- or three-year period. Home Office data shows just 23,000 young people came into the UK as part of the scheme in 2023, with 9,900 of them from Australia.\nSignalling a melting away of Eurosceptic resistance to any special youth visa deal with the EU, the Brexit campaigner and former government minister Steve Baker has given it his backing, saying it would be a “good thing” and “absolutely would not amount to a return to EU free movement”.\nBut the former chair of the European Research Group called the controversy over the scheme a “red herring” designed to distract voter attention from a food and drink standards deal that is also being mooted, which he says would put a US trade agreement in jeopardy.\nThe environment secretary, Steve Reed, insisted the government was not going to “breach” its manifesto commitments on freedom of movement, telling Times Radio: “We’re very clear in our manifesto that there won’t be any return to the single market, the customs union or freedom of movement, and that remains our position.”\nSpeaking in Washington before a meeting with the US Treasury secretary, Scott Bessent, the chancellor, Rachel Reeves, said the UK’s trading relationship with the EU was “arguably even more important” than its relationship with the US.\nThe German ambassador to the UK has said he was “really optimistic” about the prospects of a youth mobility scheme deal being reached, after a meeting between Keir Starmer and the European Commission president, Ursula von der Leyen, on Thursday. Ambassadors in Europe will be debriefed next Wednesday.\nMiguel Berger told the BBC Radio 4: “I am now pretty optimistic that we are moving in a good direction.\n“It would make it possible for young people with parents with a lower income to experience the possibility to work abroad, to learn a language, and we would like to have this in both directions,” Berger said.\n“There is a very serious and dedicated preparatory work for the summit on May 19,” he said referring to the UK-EU summit to be held in London next month.\nBaker said: “To have a capped, time-limited scheme for European young people would be a good thing, and absolutely would not amount to a return to EU free movement, which is uncapped for unlimited duration and requires nations to treat European citizens as their own. Any confusion over this should be quickly cleared up.”\nBut he urged that more attention be paid to the possibility of a sanitary and phytosanitary (SPS) deal to eliminate checks on food and drink exports, saying anything that obliged the UK to follow EU rules again would compromise a US trade deal and economic growth to sustain pension payouts 10 years down the line.\nBaker said: “While we are arguing about this complete red herring, the UK looks set to take EU rules on food and products, which will put us in breach of our obligations under the Pacific Rim trade deal and rule out doing a trade deal with the USA. That matters, because that’s where the economic growth is going to come from. And without growth, we will default on pension obligations.”\nLabour and the EU are working on seven pillars that would then feed into a declaration known as a “common understanding”, which would be followed by detailed negotiations to hammer out the specifics.\n“No decisions are expected to be made during the summit itself. At most, there could be a mutual commitment to exploring possible avenues for an agreement on these issues,” said a EU source.\nThe seven areas are: defence and security, carbon pricing, migration, youth experience, energy, and fishing, but some groups say the talks lack ambition.\nSome member states are also making a “strong ask” for the UK to return to the Erasmus+ university and vocational exchange programme and a deal to allow citizens to study in each others universities paying home fees. This is something of a non-starter for the UK because of the imbalance of students coming to Britain in the past compared to British studying in the EU.\nAn official business consultation body set up under the Brexit trade and cooperation agreement has called on the government to go further in its negotiations and seek the removal of bans on the export of British seed potatoes to the EU, of barriers on batch testing of pharmaceuticals, and mutual recognition agreements on professional qualifications.\nThe Domestic Advisory Group is also asking for removal of barriers for touring musicians and artists and their support staff.\nIn a submission to the UK government it also calls for an agreement to allow easier access to veterinary medicines in Northern Ireland and a return to joint regulation for chemicals.",
        "custom_category": "Trending"
    },
    {
        "title": "Milwaukee Judge Dugan accused of helping man evade immigration agents",
        "description": "U.S. Sen. Tammy Baldwin says the arrest of a Milwaukee judge accused of helping a man evade immigration authorities is a “gravely serious and drastic move.\"",
        "content": "▶ Follow live updates on President Donald Trump and his administration\nMILWAUKEE (AP) — The FBI on Friday arrested a Milwaukee judge accused of helping a man evade immigration authorities, escalating a clash between the Trump administration and the j... [5449 chars]",
        "url": "https://apnews.com/article/immigration-judge-arrested-7997186bbca5730e70a25f2347e631f6",
        "image": "https://dims.apnews.com/dims4/default/4c07484/2147483647/strip/true/crop/7200x4050+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F51%2Ff3c3199c773a19a48e393ff194ce%2Fb22018a336ec425e886a1e8bc16df6ca",
        "publishedAt": "2025-04-25T17:15:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "Milwaukee Judge Hannah Dugan is accused of helping a man evade immigration agents and is arrested\nMilwaukee Judge Hannah Dugan is accused of helping a man evade immigration agents and is arrested\nMILWAUKEE (AP) — The FBI on Friday arrested a Milwaukee judge accused of helping a man evade immigration authorities, escalating a clash between the Trump administration and the judiciary over the Republican president’s sweeping immigration crackdown.\nFBI Director Kash Patel announced on social media the arrest of Milwaukee County Circuit Court Judge Hannah Dugan, who he said “intentionally misdirected” federal agents away from a man they were trying to take into custody at her courthouse last week.\n“Thankfully our agents chased down the perp on foot and he’s been in custody since, but the Judge’s obstruction created increased danger to the public,” Patel wrote.\nDugan was taken into custody by the FBI on Friday morning on the courthouse grounds, according to U.S. Marshals Service spokesperson Brady McCarron. She appeared briefly in federal court in Milwaukee later Friday before being released from custody. Her next court appearance is May 15.\n“Judge Dugan wholeheartedly regrets and protests her arrest. It was not made in the interest of public safety,” her attorney, Craig Mastantuono, said during the hearing. He declined to comment to an Associated Press reporter following her court appearance.\nDugan is charged with “concealing an individual to prevent his discovery and arrest” and obstructing or impeding a proceeding. She’s accused of escorting the man, Eduardo Flores-Ruiz, and his lawyer out of the courtroom through the jury door on April 18 as a way to help avert his arrest, according to an FBI affidavit filed in court.\nThe affidavit suggests that Dugan was alerted to the presence of U.S. Immigration and Customs Enforcement agents in the courthouse by her clerk, who was informed by an attorney that they appeared to be in the hallway.\nThe affidavit describes Dugan as “visibly angry” over the arrival of immigration agents in the courthouse and says that she pronounced the situation “absurd” before leaving the bench and retreating to her chambers. It says she and another judge later approached members of the arrest team inside the courthouse, displaying what witnesses described as a “confrontational, angry demeanor.”\nShe asked one of the officers if they had a judicial warrant and was told that the warrant was instead administrative. After a back-and-forth over the warrant, the affidavit says, she demanded that the arrest team speak with the chief judge and led them away from the courtroom.\nAfter directing the arrest team to the chief judge’s office, investigators say Dugan returned to the courtroom was and was heard saying words to the effect of “wait, come with me” before ushering Flores-Ruiz and his lawyer through a jury door into a non-public area of the courthouse. The action was unusual, the affidavit says, because “only deputies, juries, court staff, and in-custody defendants being escorted by deputies used the back jury door. Defense attorneys and defendants who were not in custody never used the jury door.”\nDugan’s arrest comes amid a growing feud between the Trump administration and the judiciary over the president’s executive actions on immigration and other matters. Trump administration officials have sharply criticized what they have described as “activist” judges they say claim have overstepped their authority and unfairly impinged on the president’s executive powers by blocking many of his efforts.\nU.S. Sen. Tammy Baldwin, a Democrat who represents Wisconsin, called the arrest of a sitting judge a “gravely serious and drastic move” that “threatens to breach” the separation of power between the executive and judicial branches.\n“Make no mistake, we do not have kings in this country and we are a Democracy governed by laws that everyone must abide by,” Baldwin said in an emailed statement. “By relentlessly attacking the judicial system, flouting court orders, and arresting a sitting judge, this President is putting those basic Democratic values that Wisconsinites hold dear on the line.”\nThe case is similar to one brought during the first Trump administration against a Massachusetts judge, who was accused of helping a man sneak out a back door of a courthouse to evade a waiting immigration enforcement agent.\nThat prosecution sparked outrage from many in the legal community, who slammed the case as politically motivated. Prosecutors dropped the case against Newton District Judge Shelley Joseph in 2022 under the Democratic Biden administration after she agreed to refer herself to a state agency that investigates allegations of misconduct by members of the bench.\nThe Justice Department had previously signaled that it was going to crack down on local officials who thwart federal immigration efforts.\nThe department in January ordered prosecutors to investigate for potential criminal charges any state and local officials who obstruct or impede federal functions. As potential avenues for prosecution, a memo cited a conspiracy offense as well as a law prohibiting the harboring of people in the country illegally.\n“No one is above the law,” Attorney General Pam Bondi said in a social media post Friday.\nDugan was elected in 2016 to the county court Branch 31. She also has served in the court’s probate and civil divisions, according to her judicial candidate biography.\nBefore being elected to public office, Dugan practiced at Legal Action of Wisconsin and the Legal Aid Society. She graduated from the University of Wisconsin-Madison in 1981 with a bachelor of arts degree and earned her Juris Doctorate in 1987 from the school.\n___\nRicher reported from Washington. Associated Press reporter Eric Tucker in Washington contributed.",
        "custom_category": "Trending"
    },
    {
        "title": "KHSC piloting joint treatment for chronic pain and PTSD",
        "description": "Experts at Kingston Health Sciences Centre (KHSC) chronic pain clinic are investigating whether pain interventions such as Stellate Ganglion Blocks (SGB) can bring mental and emotional relief to patients, in addition to improving their pain.",
        "content": "Recent clinical trials have revealed mixed - yet encouraging results, and the procedure is becoming increasingly popular as a PTSD treatment in the United States and Europe. Clinics in Canada, including at KHSC, are seeing surging numbers of requests... [2408 chars]",
        "url": "https://kingstonhsc.ca/news/khsc-piloting-joint-treatment-chronic-pain-and-ptsd-0",
        "image": "https://kingstonhsc.ca/sites/default/files/styles/open_graph_image/public/images/SGB%20procedures.jpg?h=83cce451&itok=cuBlrfTC",
        "publishedAt": "2025-04-25T17:05:30Z",
        "source": {
            "name": "KHSC Kingston Health Sciences Centre",
            "url": "https://kingstonhsc.ca"
        },
        "scrap_content": "Chronic pain and post-traumatic stress disorder (PTSD) are two conditions which often exist side-by-side and intensify each other resulting in emotional distress, social withdrawal, mobility and memory problems and decreased overall wellness.\nExperts at Kingston Health Sciences Centre (KHSC) chronic pain clinic are investigating whether pain interventions such as Stellate Ganglion Blocks (SGB) can bring mental and emotional relief to patients, in addition to improving their pain.\n“When someone is living with chronic pain, their nervous system is often unregulated and responds to things it normally wouldn’t,” explains Dr. Scott Duggan, anesthesiologist and medical director at the chronic pain clinic.\n“Most PTSD symptoms are also believed to arise from an altered nervous system. The SGB treatment targets those same nerves that regulate the body’s fight-or-flight response.”",
        "custom_category": "Trending"
    },
    {
        "title": "How bacteria and textile fibers can heal bones",
        "description": "Have you ever wondered if there is a way to heal bones without having to take bone from another part of the body? A new doctoral thesis from the University of Borås, Sweden, now presents exciting advancements in this area. It involves using bacteria to produce fibers that can help heal bones.",
        "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\nSchematic overview of the melt spinning process with an extruder (lef... [3478 chars]",
        "url": "https://phys.org/news/2025-04-bacteria-textile-fibers-bones.html",
        "image": "https://scx2.b-cdn.net/gfx/news/2025/how-bacteria-and-texti.jpg",
        "publishedAt": "2025-04-25T16:49:03Z",
        "source": {
            "name": "Phys.org",
            "url": "https://phys.org"
        },
        "scrap_content": "How bacteria and textile fibers can heal bones\nHave you ever wondered if there is a way to heal bones without having to take bone from another part of the body? A new doctoral thesis from the University of Borås, Sweden, now presents exciting advancements in this area. It involves using bacteria to produce fibers that can help heal bones.\nSabrina Kopf, Ph.D. in Polymer Technology, has investigated a special type of bioplastic, polyhydroxyalkanoates (PHA), produced by bacteria.\n\"The idea is to use these fibers in textile structures that can support bone healing in cases of large bone defects. For bones to heal, bone cells need something to attach to. Bone cells recognize the substance calcium phosphate. Therefore, we have added this substance to the fibers,\" she explained.\nThe biggest challenge in the project was processing PHA into fibers with the equipment available in the laboratory. By melting the plastic and pressing it through a hole, similar to making spaghetti, she was able to produce fibers. These were then tested with bone cells to see if the cells could survive on the material.\n\"It turned out that it is possible to produce fibers with similar strength to bone. Additionally, we were able to produce simple knitted and woven textile structures from these fibers. The bone cells adhered to the material's surface and appeared healthy, which is a good sign,\" said Kopf.\nBone is, after blood, the second most transplanted tissue in the world, indicating a significant need for bone replacement materials.\n\"Today, bone from the patient's own body is often used, meaning that bone is taken from, for example, the pelvis and transplanted to the damaged area in the body. This limits the amount of bone available. Additionally, the risk of complications at the donation site is high. Using synthetic materials like PHA fibers could be a solution to this problem,\" said Kopf.\nPHA fibers are also environmentally friendly. They can be produced from residuals and degrade in all types of environments without remaining as microplastics. This makes them a sustainable option for the future.\n\"The results of my project are a small step forward in biomedical research and can inspire other researchers to explore the potential of textiles in medical applications,\" said Kopf.\nResearch at the University of Borås focuses on sustainable development based on global goals. Sabrina explained how this project connects to these goals: \"Being able to produce fibers from PHA benefits not only the health care sector, even though that was the approach of my thesis. The fibers can also be used in other textile applications and contribute in all aspects where textiles are involved in the UN's sustainable development goals, as PHA and its products are biodegradable and have no negative impact on the environment.\"\nKopf will start as a researcher in melt spinning at RISE in the fiber development department, working with the same technology she used in her thesis.\nProvided by University of Borås",
        "custom_category": "Trending"
    },
    {
        "title": "Indian and Pakistani Soldiers Briefly Exchange Fire Along Kashmir Border",
        "description": "The clash took place just days after a terror attack killed 26 people on the Indian side of the disputed region, raising tensions between the two nuclear-armed nations.",
        "content": "India and Pakistan have exchanged fire along their heavily patrolled and contested border in the Kashmir region, escalating tensions between the two nuclear-armed neighbors just days after a terror attack killed 26 people on the Indian side of the di... [915 chars]",
        "url": "https://www.nytimes.com/2025/04/25/world/asia/india-pakistan-kashmir.html",
        "image": "https://static01.nyt.com/images/2025/04/25/multimedia/25int-kashmir01-photo-glzt/25int-kashmir01-photo-glzt-facebookJumbo.jpg",
        "publishedAt": "2025-04-25T16:42:20Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "scrap_content": null,
        "custom_category": "Trending"
    },
    {
        "title": "Mistrial declared in sex assault case against 5 ex-world junior hockey players in London, Ont.",
        "description": "Superior Court Justice Maria Carroccia has declared a mistrial in the case against five former world junior hockey players accused of sexually assaulting a woman in a London, Ont., hotel in 2018. On Friday, she also dismissed the jury and jury selection began again for a new trial.",
        "content": "Superior Court Justice Maria Carroccia has declared a mistrial in the case against five former world junior hockey players accused of sexually assaulting a woman in a London, Ont., hotel in 2018.\nThe stunning and rare move comes three days after a 14... [2373 chars]",
        "url": "https://www.cbc.ca/news/canada/london/mistrial-declared-in-sex-assault-case-against-5-ex-world-junior-hockey-players-in-london-ont-1.7518317",
        "image": "https://i.cbc.ca/1.7516171.1745412243!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/hockey-canada-trial-london-players.jpg?im=Resize%3D620",
        "publishedAt": "2025-04-25T16:36:10Z",
        "source": {
            "name": "CBC",
            "url": "https://www.cbc.ca"
        },
        "scrap_content": null,
        "custom_category": "Trending"
    },
    {
        "title": "Chemistry Of Creativity",
        "description": "Senior Madison Wang, a double major in creative writing and chemistry , developed her passion for writing in middle school. Her interest in",
        "content": "Senior Madison Wang, a double major in creative writing and chemistry , developed her passion for writing in middle school. Her interest in chemistry fit nicely alongside her commitment to producing engaging narratives.\nWang believes that world-build... [5748 chars]",
        "url": "https://www.miragenews.com/chemistry-of-creativity-1450116/",
        "image": "https://news.mit.edu/sites/default/files/images/202504/mit-Madison-Wang.jpg",
        "publishedAt": "2025-04-25T16:32:00Z",
        "source": {
            "name": "Mirage News",
            "url": "https://www.miragenews.com"
        },
        "scrap_content": "Senior Madison Wang, a double major in creative writing and chemistry , developed her passion for writing in middle school. Her interest in chemistry fit nicely alongside her commitment to producing engaging narratives.\nWang believes that world-building in stories supported by science and research can make for a more immersive reader experience.\n\"In science and in writing, you have to tell an effective story,\" she says. \"People respond well to stories.\"\nA native of Buffalo, New York, Wang applied early action for admission to MIT and learned quickly that the Institute was where she wanted to be. \"It was a really good fit,\" she says. \"There was positive energy and vibes, and I had a great feeling overall.\"\nThe power of science and good storytelling\n\"Chemistry is practical, complex, and interesting,\" says Wang. \"It's about quantifying natural laws and understanding how reality works.\"\nChemistry and writing both help us \"see the world's irregularity,\" she continues. Together, they can erase the artificial and arbitrary line separating one from the other and work in concert to tell a more complete story about the world, the ways in which we participate in building it, and how people and objects exist in and move through it.\n\"Understanding magnetism, material properties, and believing in the power of magic in a good story … these are why we're drawn to explore,\" she says. \"Chemistry describes why things are the way they are, and I use it for world-building in my creative writing.\"\nWang lauds MIT's creative writing program and cites a course she took with Comparative Media Studies/Writing Professor and Pulitzer Prize winner Junot Díaz as an affirmation of her choice. Seeing and understanding the world through the eyes of a scientist - its building blocks, the ways the pieces fit and function together - help explain her passion for chemistry, especially inorganic and physical chemistry.\nWang cites the work of authors like Sam Kean and Knight Science Journalism Program Director Deborah Blum as part of her inspiration to study science. The books \"The Disappearing Spoon\" by Kean and \"The Poisoner's Handbook\" by Blum \"both present historical perspectives, opting for a story style to discuss the events and people involved,\" she says. \"They each put a lot of work into bridging the gap between what can sometimes be sterile science and an effective narrative that gets people to care about why the science matters.\"\nGenres like fantasy and science fiction are complementary, according to Wang. \"Constructing an effective world means ensuring readers understand characters' motivations - the 'why' - and ensuring it makes sense,\" she says. \"It's also important to show how actions and their consequences influence and motivate characters.\"\nAs she explores the world's building blocks inside and outside the classroom, Wang works to navigate multiple genres in her writing, as with her studies in chemistry. \"I like romance and horror, too,\" she says. \"I have gripes with committing to a single genre, so I just take whatever I like from each and put them in my stories.\"\nIn chemistry, Wang favors an environment in which scientists can regularly test their ideas. \"It's important to ground chemistry in the real world to create connections for students,\" she argues. Advancements in the field have occurred, she notes, because scientists could exit the realm of theory and apply ideas practically.\n\"Fritz Haber's work on ammonia synthesis revolutionized approaches to food supply chains,\" she says, referring to the German chemist and Nobel laureate. \"Converting nitrogen and hydrogen gas to ammonia for fertilizer marked a dramatic shift in how farming could work.\" This kind of work could only result from the consistent, controlled, practical application of the theories scientists consider in laboratory environments.\nA future built on collaboration and cooperation\nWatching the world change dramatically and seeing humanity struggle to grapple with the implications of phenomena like climate change, political unrest, and shifting alliances, Wang emphasizes the importance of deconstructing silos in academia and the workplace. Technology can be a tool for harm, she notes, so inviting more people inside previously segregated spaces helps everyone.\nCriticism in both chemistry and writing, Wang believes, are valuable tools for continuous improvement. Effective communication, explaining complex concepts, and partnering to develop long-term solutions are invaluable when working at the intersection of history, art, and science. In writing, Wang says, criticism can help define areas to improve writers' stories and shape interesting ideas.\n\"We've seen the positive results that can occur with effective science writing, which requires rigor and fact-checking,\" she says. \"MIT's cross-disciplinary approach to our studies, alongside feedback from teachers and peers, is a great set of tools to carry with us regardless of where we are.\"\nWang explores connections between science and stories in her leisure time, too. \"I'm a member of MIT's Anime Club and I enjoy participating in MIT's Sport Taekwondo Club ,\" she says. The competitive aspect in tae kwon do allows for her to feed her competitive drive and gets her out of her head. Her participation in DAAMIT (Digital Art and Animation at MIT) creates connections with different groups of people and gives her ideas she can use to tell better stories. \"It's fascinating exploring others' minds,\" she says.\nWang argues that there's a false divide between science and the humanities and wants the work she does after graduation to bridge that divide. \"Writing and learning about science can help,\" she asserts. \"Fields like conservation and history allow for continued exploration of that intersection.\"\nUltimately, Wang believes it's important to examine narratives carefully and to question notions of science's inherent superiority over humanities fields. \"The humanities and science have equal value,\" she says.",
        "custom_category": "Trending"
    }
]