[
    {
        "title": "Private parking firms on track to hand out a record 14.5m tickets in one year",
        "description": "The RAC has found just five businesses are responsible for nearly half of all tickets issued. | ITV National News",
        "content": "Motoring campaigners are warning of a rise in parking tickets from private firms.\nThe RAC says it expects 14.5 million penalty notices this year - a significant rise and amounting to £1.4 billion in fines.\nThere are calls for a new independent watchd... [1947 chars]",
        "url": "https://www.itv.com/news/2025-04-24/private-parking-firms-on-track-to-hand-out-a-record-145m-tickets-in-one-year",
        "image": "https://images.ctfassets.net/pjshm78m9jt4/3SHT9rdId2K1DmF9QQNhGy/cba18e2570c78c3c30b43d7f8e445c36/parking_fines.png?fm=jpg&fit=fill&w=1600&h=900&q=80",
        "publishedAt": "2025-04-25T17:11:54Z",
        "source": {
            "name": "ITVX",
            "url": "https://www.itv.com"
        },
        "scrap_content": "Motoring campaigners are warning of a rise in parking tickets from private firms.\nThe RAC says it expects 14.5 million penalty notices this year - a significant rise and amounting to £1.4 billion in fines.\nThere are calls for a new independent watchdog to ensure charges are fair.\nThe RAC says car park firms made 41,000 requests a day for vehicle keeper details - a 12% annual rise.\nBut the parking sector has fired back - sparking a furious new row.\nWill Hurley, chief executive of International Parking Community, urges people to follow instructions on a parking charge notice\nOne of the largest organisations representing private parking operators, International Parking Community, says any rise is due to an increase in the number of car parks.\nThe group says an increase in car ownership has led to an almost 500% rise in car park sites since 2012.\nThey have accused the RAC of “inflaming public concerns”, saying 99.7% of parking goes without incident.\nA Bill to enable the introduction of a Government-backed code for private parking companies received royal assent under the Conservative government in March 2019.\nHowever, the code was withdrawn two years later after a legal challenge by parking companies.\nThe RAC says its new figures show that reform is now urgently needed.\nIn a statement to ITV News, the government said, “Motorists must be protected when using private car parks, and we are determined to drive up standards in the industry.\n\"We know how much of an issue this is for drivers, which is why we will set out further details on the private parking code of practice as soon as possible.”\nWhat to do if you have received a parking charge notice:\nRead the notice carefully\nFollow the process\nProvide as much evidence as you can\nFor more information and advice visit 247 Advice.\nSubscribe for free to our weekly newsletter for exclusive and original coverage from ITV News. Direct to your inbox every Friday morning.\nWant a quick and expert briefing on the biggest news stories? Listen to our latest podcasts to find out What You Need To Know…",
        "custom_category": "Business"
    },
    {
        "title": "Baidu Launches ERNIE 4.5 Turbo, ERNIE X1 Turbo and New Suite of AI Tools to Empower Developers and Supercharge AI Innovation",
        "description": "Following the release of two models in mid-March, Baidu unveiled ERNIE 4.5 Turbo and ERNIE X1 Turbo today, which stand out for their multimodal capabilities,...",
        "content": "Following the release of two models in mid-March, Baidu unveiled ERNIE 4.5 Turbo and ERNIE X1 Turbo today, which stand out for their multimodal capabilities, strong reasoning, and low costs. ERNIE 4.5 Turbo delivers faster responses while priced at 2... [7870 chars]",
        "url": "https://www.prnewswire.com/news-releases/baidu-launches-ernie-4-5-turbo-ernie-x1-turbo-and-new-suite-of-ai-tools-to-empower-developers-and-supercharge-ai-innovation-302438584.html",
        "image": "https://mma.prnewswire.com/media/2673552/image_1.jpg?p=facebook",
        "publishedAt": "2025-04-25T17:03:00Z",
        "source": {
            "name": "PR Newswire",
            "url": "https://www.prnewswire.com"
        },
        "scrap_content": "- Following the release of two models in mid-March, Baidu unveiled ERNIE 4.5 Turbo and ERNIE X1 Turbo today, which stand out for their multimodal capabilities, strong reasoning, and low costs. ERNIE 4.5 Turbo delivers faster responses while priced at 20% of ERNIE 4.5; ERNIE X1 Turbo, featuring enhanced capabilities, is half the price of ERNIE X1.\n- In addition to the models, Baidu also unveiled an array of AI applications, including Xinxiang, a multi-agent collaboration app, enabling full task delivery from a single sentence prompt, as well as highly convincing digital humans.\n- Baidu also announced an AI Open Initiative as well as the integration of MCP into some existing products to enable effortless experience for the developers to access and utilize Baidu's suite of services.\nWUHAN, China, April 25, 2025 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU and HKEX: 9888), a leading AI company with a strong internet foundation, today introduced a new suite of AI innovations at its annual developer conference Baidu Create 2025. At the event, Baidu co-founder and CEO Robin Li introduced ERNIE 4.5 Turbo and ERNIE X1 Turbo, the latest two models of the company, along with a series of AI applications and advancements, and committed to empowering developers to fully embrace MCP (Model Context Protocol).\n\"Our releases aim to empower developers to build the best applications — without having to worry about model capability, costs, or development tools,\" Li said in his keynote, addressing an audience of over 5,000 developers and tech enthusiasts. \"Without practical applications, neither advanced chips nor sophisticated models hold value. While there will be a multitude of models, it is the applications that will truly dominate in the future. Applications are where true power lies,\" Li added.\nERNIE 4.5 Turbo and ERNIE X1 Turbo: Faster and Cheaper\nBaidu introduced ERNIE 4.5 Turbo and ERNIE X1 Turbo at Create 2025, both of which feature enhanced multimodal capabilities, strong reasoning, low costs, and are available for users to access on ERNIE Bot now free of charge. The two models were launched to address common pain points in the industry, including single-modality, high-hallucination, slow-response and high-price, Li noted.\nERNIE X1 Turbo is an upgraded deep thinking reasoning model. Featuring a more advanced chain of thought, stronger deep thinking capabilities, and further enhanced multimodal and tool invocation abilities, it excels in Q&A, literary creation, and logical reasoning, outperforming DeepSeek R1 as well as the latest version of V3.\nERNIE X1 Turbo offers improved performance while being priced at half of ERNIE X1, making it only 25% of the price of DeepSeek R1. The input price is RMB 1 per million tokens, and the output price is RMB 4 per million tokens.\nERNIE 4.5 Turbo demonstrates overall progress in hallucination reduction, logical reasoning, and coding abilities, with faster response. The multimodal capabilities of ERNIE 4.5 Turbo are on par with GPT-4.1 and superior to GPT-4o across multiple benchmarks. For ERNIE 4.5 Turbo, the input price is only RMB 0.8 per million tokens, and the output price is RMB 3.2 per million tokens, 80% off the price of ERNIE 4.5, 0.2% of GPT-4.5 and 40% of DeepSeek V3.\nBoth ERNIE 4.5 Turbo and X1 Turbo have further enhanced their multimodal capabilities. \"Multimodality will become a standard feature of future foundation models. The market for pure text-based models will shrink, while the market for multimodal models will continue to grow,\" Li predicted in his keynote.\nThe two models follow the launch of ERNIE 4.5, the company's first native multimodal foundation model, and ERNIE X1, a multimodal deep-thinking reasoning model capable of tool use, both of which received strong market recognition after their debut on March 16, 2025.\nAI Application Frontrunners: Highly Convincing Digital Humans and Multi-agent Tool Xinxiang\nThe highly convincing digital human is one of the key applications that exemplify the capabilities of multimodality. \"AI digital humans are one of the most exciting breakthrough applications in 2025,\" Li said in his speech.\nLi introduced Baidu's highly convincing AI digital human, which features ultra-realistic voice and appearance, as well as more professional content-generation and more flexible interactions. Baidu's Huiboxing, a digital human livestream platform powered by AI, now offers a feature to create a digital human in one click where users can upload a video as short as two minutes before the system can generate a personalized digital human ready to go live.\nOver the past year, agents have transitioned from a niche concept to a core field of AI applications. Notably, coding agents have rapidly gained traction, with Baidu offering tools like Comate for code assistance and Miaoda, a no-code platform for multi-agent collaboration. In March, Miaoda was made available to the public, allowing users to generate applications with a single sentence.\n\"There are nearly 30 million programmers and 8 billion people globally. As technologies become more accessible, everyone can possess the capabilities of a programmer,\" said Li.\nAt the event, Baidu also officially released the multi-agent collaboration app Xinxiang, a \"general super agent\" capable of solving complex problems for users in a one-stop manner. Currently, Xinxiang covers 200 task types in scenarios such as knowledge-analysis, travel-planning, studying, and office work. In the future, Baidu plans to expand the number of task types to over 100,000.\nLi also introduced Cangzhou OS, the first content operating system jointly launched by Baidu Wenku and Baidu Drive. Powered by Cangzhou OS, Baidu Drive has launched AI Note, the industry's first multimodal AI note-taking tool. Users can generate quick notes, mind maps, and quizzes from watching educational videos with just a single click.\nTo date, Baidu Wenku's AI features have amassed 40 million paying users and 97 million monthly active users (MAUs), while Baidu Drive's AI features serve more than 80 million MAUs.\nBuilding a Thriving Ecosystem: AI Open Initiative, MCP and ERNIE Cup\nAddressing the booming AI application market, Baidu introduced a series of initiatives aimed at supporting AI developers in adapting to the emerging trend.\nBaidu Search Open Platform has launched the AI Open Initiative (sai.baidu.com), providing developers of AI agents, H5 pages, mini programs, and standalone apps with traffic and monetization opportunities, as well as access to the latest AI services through a diversified content and service distribution system.\nAlso at the event, Baidu announced full support to enable developers to adopt Model Context Protocol (MCP). Li compared MCP to installing a \"universal socket\" for AI — enabling seamless connections between external services and large models through standardized interfaces. Live demos showcased the integration of MCP across a series of Baidu proprietary services, including the Baidu Qianfan Foundation Model Platform, Baidu Search, e-commerce, and Baidu Drive.\nTo further support innovation in AI, Baidu announced the third ERNIE Cup Innovation Challenge at Create 2025. This year's challenge will double the prize amounts from previous years, offering up to RMB 70 million in investment for outstanding projects.\nAt the same time, Baidu announced that over the next five years, the company will scale up its efforts to cultivate an additional 10 million AI talents for society.\nBaidu Create is Baidu's annual tech event for the developer community, serving as a platform for technology launches and knowledge exchange. This year's conference centered around the theme of \"Models Lead, APPs Rule\" and featured six sub-forums on subjects such as MCP, agents, DeepSeek and more.\nAbout Baidu\nFounded in 2000, Baidu's mission is to make the complicated world simpler through technology. Baidu is a leading AI company with strong internet foundation, trading on the NASDAQ under \"BIDU\" and HKEX under \"9888.\" One Baidu ADS represents eight Class A ordinary shares.\nMedia Contact\n[email protected]\nSOURCE Baidu, Inc.\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In",
        "custom_category": "Business"
    },
    {
        "title": "Directors’ Deals: Bunzl bosses snap up shares after £2bn sell-off",
        "description": "Pause in share buyback hits share price",
        "content": "Bunzl shareholders suffered a double blow last week. In a trading update that came a week earlier than planned, the FTSE 100 distributor of workplace supplies cut its full-year outlook, citing weakness in North America, where it makes more than half ... [1484 chars]",
        "url": "https://www.ft.com/content/3c0246e2-0969-4cdd-84ea-27f8c95a6810",
        "image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F700fc8cf-70fb-40e7-a2d1-9917a86aad79.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
        "publishedAt": "2025-04-25T17:00:32Z",
        "source": {
            "name": "Financial Times",
            "url": "https://www.ft.com"
        },
        "scrap_content": "Directors’ Deals: Bunzl bosses snap up shares after £2bn sell-off\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.\nDiscover all the plans currently available in your country",
        "custom_category": "Business"
    },
    {
        "title": "Stockpickers: Shadow of tariffs hangs over defence stocks",
        "description": "European defence spending is rising, but investors need to examine companies’ underlying strengths",
        "content": "Defence stocks have risen in value in recent years following Russia’s invasion of Ukraine, the conflict in Gaza and, most recently, US President Donald Trump’s declaration that Washington might not come to the aid of Nato members whose defence spendi... [8329 chars]",
        "url": "https://www.ft.com/content/fcf76b24-90ec-42ea-b68b-b0f33114a43a",
        "image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe936b64d-d814-4e6b-a6b2-505bd6bceef5.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
        "publishedAt": "2025-04-25T17:00:32Z",
        "source": {
            "name": "Financial Times",
            "url": "https://www.ft.com"
        },
        "scrap_content": "Stockpickers: Shadow of tariffs hangs over defence stocks\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.\nDiscover all the plans currently available in your country",
        "custom_category": "Business"
    },
    {
        "title": "Marengo to Share Updated Clinical Results from STARt-001 Phase 1/2 Clinical Trial Featuring Invikafusp Alfa Monotherapy Activity in PD1 Resistant Tumors at Upcoming AACR 2025 Clinical Plenary Oral Pre",
        "description": "/PRNewswire/ -- Marengo Therapeutics, Inc., a clinical-stage biotechnology company pioneering novel approaches for precision immunotherapy, today announced an...",
        "content": "Initial disease control rate of 67%, tumor regression rate of 44% and preliminary objective response rate of 22% were observed in TMB-H patients at the optimal biological dose range\nInvikafusp alfa (STAR0602) demonstrates pan-tumor selective Vβ T cel... [7475 chars]",
        "url": "https://www.prnewswire.com/news-releases/marengo-to-share-updated-clinical-results-from-start-001-phase-12-clinical-trial-featuring-invikafusp-alfa-monotherapy-activity-in-pd1-resistant-tumors-at-upcoming-aacr-2025-clinical-plenary-oral-presentation-302437765.html",
        "image": "https://mma.prnewswire.com/media/1679488/Marengo_Therapeutics_Logo.jpg?p=facebook",
        "publishedAt": "2025-04-25T17:00:00Z",
        "source": {
            "name": "PR Newswire",
            "url": "https://www.prnewswire.com"
        },
        "scrap_content": "- Initial disease control rate of 67%, tumor regression rate of 44% and preliminary objective response rate of 22% were observed in TMB-H patients at the optimal biological dose range\n- Invikafusp alfa (STAR0602) demonstrates pan-tumor selective Vβ T cell expansion in vivo across 18 different solid tumor types\n- Data highlight promising anti-tumor activity as single agent in heavily pretreated anti-PD(L)1 resistant tumors including both primary and secondary resistant patients\nCAMBRIDGE, Mass., April 25, 2025 /PRNewswire/ -- Marengo Therapeutics, Inc., a clinical-stage biotechnology company pioneering novel approaches for precision immunotherapy, today announced an upcoming clinical plenary oral presentation at the American Association for Cancer Research (AACR) Annual Meeting 2025. The presentation will report updated clinical and translational findings from the ongoing Phase 1/2 trial (STARt-001) evaluating invikafusp alfa (STAR0602) in patients with anti-PD(L)1-resistant, antigen-rich solid tumors.\nThe results highlight clinical pharmacology, selective immune activation, and RP2D selection in addition to demonstrating clinically meaningful anti-tumor activity and a well-characterized safety profile. The data also further support the advancement of the lead asset into Phase 2 development and confirm clinical efficacy.\n\"These encouraging data represent the first clinical proof of our precision T cell agonist approach to overcome anti-PD(L)1-resistant cancer, a therapeutic area with significant unmet need. Importantly, invikafusp monotherapy not only selectively engaged and expanded a key T cell subset in immunotherapy-resistant tumors, but also reinvigorated anti-tumor responses,\" said Ke Liu, M.D. Ph.D., Chief Development Officer of Marengo Therapeutics. \"Based on the initial disease control and tumor regression rates observed, invikafusp has the potential to offer a promising new class of immunotherapy for patients who have exhausted checkpoint inhibitor therapy options.\"\n\"The initial clinical activity of invikafusp monotherapy in PD-1 resistant tumors is novel and important as a new approach to immunotherapy,\" said Bruce A. Chabner, M.D., Clinical Director Emeritus at Massachusetts General Hospital. \"The ability of invikafusp to activate a specific subset of T cells in heavily pretreated cancer patients and achieve objective responses in tumors that have failed PD-1 inhibitors is clinically meaningful. These results may mark the beginning of a new class of novel T cell agonists in treating checkpoint resistant cancers with precision immune activation.\"\nInvikafusp alfa is Marengo's first-in-class, dual T cell agonist with a bi-specific antibody design to selectively activate the Vβ6 and Vβ10 subsets of T cells in vivo.\nKey Findings from the Abstract (CT205):\n- Initial Clinical Activity (TMB-H subgroup at optimal biologic dose):\n- Six of the initial nine efficacy evaluable patients (67%) achieved disease control (2 confirmed partial responses (cPRs) and 4 with stable disease)\n- The cPRs were in MSS colorectal cancer with one response lasting ~12 months\n- Plenary oral presentation to include updated clinical results from initial data cut and additional patients\n- Clinical Pharmacology and Recommended Phase 2 Dose (RP2D):\n- RP2D was determined as 0.08 mg/kg Q2W, selected based on pharmacokinetics, pharmacodynamics, safety, and activity\n- Dose-dependent, selective expansion of peripheral CD8+ Vβ6/Vβ10 T cells, with ~600% average peak expansion at RP2D\n- Expanded Vβ T cells exhibited a memory phenotype and expressed cytotoxic effector molecules\n- Soluble markers of T cell activation (e.g., IFN-γ, sCD25) increased post-dosing; inflammatory cytokines (e.g., TNF-α, IL-6) remained limited below RP2D\nBased on initial clinical and preclinical results, the U.S. Food and Drug Administration granted Fast Track Designation to invikafusp alfa for the treatment of patients with TMB-high colorectal cancer. The STARt-001 Phase 2 portion of the trial is ongoing and actively enrolling, focused on expanding into other antigen-rich tumors, including MSI-H and TMB-H tissue agnostic solid tumors.\nPresentation Details\n- Title: Updated clinical results, recommended Phase 2 dose (RP2D) determination and translational study results for START-001: a Phase 1/2 trial of invikafusp alfa, a first-in-class TCR β chain-targeted bispecific antibody in patients with anti-PD(L)1-resistant, antigen-rich solid tumors\n- Abstract Number: CT205 (Late-breaking)\n- Session Title: Clinical Trials Plenary: Biologics and T-cell Engagers\n- Session Date and Time: Tuesday, April 29, 2025, 10:15 AM – 12:15 PM CT\n- Presenter: Ryan J. Sullivan, M.D., Massachusetts General Hospital\nAbout Marengo Therapeutics\nMarengo Therapeutics, Inc., a clinical-stage biotech company, develops novel TCR-targeting antibodies that selectively modulate common and disease-specific T cell subsets of the germline TCR repertoire to provide lifelong protection against cancer and autoimmune diseases. With a passionate team of dedicated scientists experienced in immunology and oncology, and three proprietary platforms: Selective T Cell Activation Repertoire (STAR), Trispecific T Cell Engager (Tri-STAR) and T cell Depletor (MSTAR), Marengo is working to selectively target the right T cells in the right patients to create a world in which everyone's immune system can defeat cancer and autoimmune diseases. To learn more, visit marengotx.com.\nAbout the STAR™ Platform\nMarengo's STAR™ Platform is a multi-specific antibody-fusion platform derived from Marengo's proprietary library of antibodies targeting germline-encoded variable Vβ regions of the TCR fused to different T cell co-stimulatory moieties. Combining a novel non-clonal mode of TCR activation with a T cell co-stimulator in the same molecule promotes a distinct mechanism of action that promotes durable anti-tumor Vβ T cell responses.\nAbout Invikafusp alfa (STAR0602)\nInvikafusp alfa (STAR0602) is the lead candidate from Marengo's STAR™ platform. It is designed to selectively activate a common Vβ T cell subset found in all cancers by combining a non-clonal mode of TCR activation with a T cell co-stimulatory signal in a single molecule. This innovative approach promotes the expansion of clonally diverse, effector memory Vβ T cells, enhancing anti-tumor immunity and enabling durable tumor clearance. Extensive preclinical studies demonstrate STAR0602's potent anti-tumor activity in both mouse and human ex vivo models via a novel mechanism of action.\nAbout the STARt-001 Clinical Study\nSTARt-001 is a Phase 1/2 clinical trial evaluating the safety, tolerability, and preliminary efficacy of invikafusp alfa as a monotherapy in biomarker-selected patients with advanced antigen-rich solid tumors, including PD-1 refractory and rare tumor types. The trial consists of two parts: Phase 1 dose escalation and Phase 2 dose expansion. For more information, visit clinicaltrials.gov (Identifier: NCT05592626).\nPatients interested in participating in this study at the National Cancer Institute (NCI) can contact NCI's toll-free number: 1-800-4-CANCER (1-800-422-6237) (TTY: 1-800-332-8615), visit the website at https://trials.cancer.gov, or email [email protected].\nMarengo Contacts:\nMedia\nPeg Rusconi | [email protected]\nInvestors\nSvetlana Makhni | [email protected]\nSOURCE Marengo Therapeutics\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In",
        "custom_category": "Business"
    },
    {
        "title": "US bans synthetic food dyes as Irish food watchdog rules out similar move here",
        "description": "The EU already outlaws three of the eight dyes being banned by the US.",
        "content": "THE FOOD SAFETY Authority of Ireland (FSAI) has said there are no plans to change regulations here after the US announced a ban on eight synthetic food dyes.\nAmerica’s Food and Drug Agency (FDA) announced this week that it is seeking to eliminate the... [2716 chars]",
        "url": "https://www.thejournal.ie/food-dye-ban-ireland-food-safety-fsai-6687595-Apr2025/",
        "image": "https://img2.thejournal.ie/article/6687595/river/?height=400&version=6687789",
        "publishedAt": "2025-04-25T16:46:00Z",
        "source": {
            "name": "The Journal",
            "url": "https://www.thejournal.ie"
        },
        "scrap_content": "Support from readers like you keeps The Journal open.\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.",
        "custom_category": "Business"
    },
    {
        "title": "Critical vulnerability in SAP NetWeaver under threat of active exploitation",
        "description": "Attackers have been observed dropping webshell backdoors and researchers warn the application is popular among government agencies.",
        "content": "Security researchers warn that hackers are actively exploiting a critical unrestricted-file-upload vulnerability in SAP NetWeaver Visual Composer.\nThe vulnerability, tracked as CVE-2025-31324, could allow an unauthenticated user to upload malicious e... [2369 chars]",
        "url": "https://www.cybersecuritydive.com/news/critical-vulnerability-sap-netweaver-exploitation/746383/",
        "image": "https://imgproxy.divecdn.com/1nMc6x7tpFjSPZA9pm7rjjZfI_HRTz0J6U4TF_26Pss/g:ce/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9HZXR0eUltYWdlcy0yMTgwNzk1NzE1LmpwZw==.webp",
        "publishedAt": "2025-04-25T15:58:22Z",
        "source": {
            "name": "Cybersecurity Dive",
            "url": "https://www.cybersecuritydive.com"
        },
        "scrap_content": "Security researchers warn that hackers are actively exploiting a critical unrestricted-file-upload vulnerability in SAP NetWeaver Visual Composer.\nThe vulnerability, tracked as CVE-2025-31324, could allow an unauthenticated user to upload malicious executable binaries. The vulnerability has a severity score of 10.\nResearchers from Reliaquest disclosed the vulnerability to SAP after an investigation uncovered attackers uploading JSP webshells into publicly accessible directories.\nResearchers initially suspected the hackers were exploiting an old vulnerability, tracked as CVE-2017-9844, or an unreported remote-file-inclusion vulnerability. However, Reliaquest observed compromises of up-to-date systems.\n“Vulnerability CVE-2017-9844 was designated for DoS and possible RCE (no mention of RFI) with requests to the same URI, and, as such, we feel this is net new or scope expansion,” a Reliaquest spokesperson told Cybersecurity Dive on Tuesday.\nReliaquest researchers warn that the SAP technology is widespread among government agencies and that a successful compromise could give hackers access to government networks.\nAttackers are using Brute Ratel and Heaven’s Gate for execution and evasion, according to Reliaquest.\nAn SAP spokesperson confirmed that the company was alerted to a vulnerability in SAP NetWeaver Visual Composer that may have allowed unauthenticated and unauthorized code execution in certain Java Servlets.\nThe company said it was not aware of any compromises of customer data or systems. It released a workaround on April 8 and is working on a patch that will be available on April 30. The spokesperson said customers should apply that patch immediately.\nDespite SAP’s assurances of no immediate impact, security companies are reporting ongoing attempts to exploit the vulnerability.\nResearchers at watchTowr are seeing threat actors drop webshell backdoors and gain further access.\n“This active in-the-wild exploitation and widespread impact makes it incredibly likely that we’ll soon see prolific exploitation by multiple parties,” Benjamin Harris, CEO of watchTowr, told Cybersecurity Dive via email. “If you thought you had time, you don’t.”\nOnapsis Research Labs has identified more than 10,000 internet-facing SAP applications that may be at risk of breach due to the vulnerability, according to CEO Mariano Nunez.\nOnapsis estimates that “50%-70% of these apps have the vulnerable component enabled and are likely already compromised,” Nunez added.\nThe vulnerable component is not enabled by default, however, so Onapsis is trying to confirm the number of vulnerable affected systems.",
        "custom_category": "Business"
    },
    {
        "title": "Trade tensions and rising uncertainty drag global economy towards recession",
        "description": "UNCTAD expects global growth to slow to 2.3% this year as trade and economic policy uncertainty erode business and investor confidence.",
        "content": "25 April 2025\nUNCTAD expects global growth to slow to 2.3% this year as trade and economic policy uncertainty erode business and investor confidence.\nGlobal growth is forecast to slow to 2.3% in 2025, slipping below the 2.5% threshold often associate... [3226 chars]",
        "url": "https://unctad.org/news/trade-tensions-and-rising-uncertainty-drag-global-economy-towards-recession",
        "image": "https://unctad.org/sites/default/files/2025-04/jnybs-trade-policy-uncertainty-soars-to-historic-highs.png",
        "publishedAt": "2025-04-25T15:49:00Z",
        "source": {
            "name": "UN Trade and Development (UNCTAD)",
            "url": "https://unctad.org"
        },
        "scrap_content": "UNCTAD expects global growth to slow to 2.3% this year as trade and economic policy uncertainty erode business and investor confidence.\nGlobal growth is forecast to slow to 2.3% in 2025, slipping below the 2.5% threshold often associated with a global recession, UN Trade and Development (UNCTAD) said in its latest report. This marks a sharp deceleration compared to already sluggish pre-pandemic growth rates.\nUNCTAD warns that rising uncertainty is weighing heavily on the global economy. Trade tensions are escalating, with recent tariff hikes undermining predictability. Rising fragmentation, if left unchecked, could deepen the downturn.\nTrade and financial turbulence intensify amid policy uncertainty\nTrade policy uncertainty, now at historic highs, is eroding business confidence and reshaping global trade patterns. Manufacturers and investors are delaying decisions, reassessing supply chain strategies and stepping up risk management efforts.\nAfter a temporary surge at the end of 2024, merchandise trade momentum is fading, with the Shanghai Containerized Freight Index dropping by 40% between January and March 2025, falling back to pre-pandemic levels.\nRecord-high economic policy uncertainty is also fuelling financial turbulence. In early 2025, the Economic Policy Uncertainty Index reached its highest level this century, surpassing peaks during the 2008 financial crisis and the COVID-19 pandemic.\nIn early April, markets saw sharp corrections and heavy losses after weeks of volatility. The so-called financial “fear index” – a gauge of US stock market volatility – reached its third-highest level on record, behind only the peaks seen during the pandemic and global financial crisis.\nHeightened uncertainty is pushing up bond yields, reflected in a rising \"term premium\" – extra compensation investors demand for holding long-term debt. This is raising financing costs for governments, households and firms, putting further upward pressure on global interest rates and complicating prospects for developing economies.\nDeveloping economies face “perfect storm”\nThe slowdown will affect all economies, but UNCTAD highlights particular risks for developing countries. Many low-income economies face a “perfect storm” of tighter financial conditions, high external debt and weakening domestic growth. More than half of low-income countries – 35 out of 68 – are now in debt distress or at high risk, according to the International Monetary Fund.\nPersistently high bond yields in advanced economies, alongside tighter US monetary policy, are expected to crowd out financial flows to developing countries. Investor caution is redirecting capital toward assets and markets perceived as “safer”, further straining financing for the Global South.\nRegional integration offers a buffer\nDespite the headwinds, opportunities exist. Trade among developing countries – also known as South-South trade – is expanding faster than other trade flows and now accounts for about one third of global trade.\nIn East and South-East Asia, intraregional trade has been a major force behind economic growth, with the region contributing over 40% of global growth in 2024.\nUNCTAD’s report calls for stronger regional integration, renewed multilateral cooperation and a rebalancing of fiscal priorities toward sustainable infrastructure, social protection and climate action. Coordinated action, it says, will be essential to restore confidence and keep development on track.",
        "custom_category": "Business"
    },
    {
        "title": "China exempts some U.S. imports from 125% tariff rate",
        "description": "Despite comments from U.S. President Donald Trump that he's spoken with Chinese President Xi Jinping about tariffs, China maintains that no talks have taken place.",
        "content": "China exempted some U.S. imports from its 125 per cent tariffs on Friday, according to businesses, although China quickly knocked down U.S. President Donald Trump's assertion that negotiations between the two countries were underway.\nTrump's administ... [6231 chars]",
        "url": "https://www.cbc.ca/news/business/china-tariff-exemptions-1.7518434",
        "image": "https://i.cbc.ca/1.5267799.1745595700!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trade-china-tariffs-what-way-out.jpg?im=Resize%3D620",
        "publishedAt": "2025-04-25T15:46:34Z",
        "source": {
            "name": "CBC",
            "url": "https://www.cbc.ca"
        },
        "scrap_content": null,
        "custom_category": "Business"
    },
    {
        "title": "Wall Street's rally fades as more CEOs talk about uncertainty because of Trump's trade war",
        "description": "U.S. stocks are drifting in mixed trading as they near the end of another roller-coaster week. The S&P 500 edged higher by 0.4% Friday, though the majority of stocks were falling within the index.",
        "content": "NEW YORK (AP) — Wall Street’s big three-day rally is running out of steam, and U.S. stocks are drifting in mixed trading Friday as they near the end of another roller-coaster week.\nThe S&P 500 was 0.4% higher in afternoon trading, though the majority... [4006 chars]",
        "url": "https://apnews.com/article/market-rates-trump-tariffs-cd30ed61467eee2dc778006fa49924ee",
        "image": "https://dims.apnews.com/dims4/default/ec0cd59/2147483647/strip/true/crop/6143x3455+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F17%2F6de088a4a4db162c4795075eab52%2Ff955d20bac054cef81e07c6ce268118f",
        "publishedAt": "2025-04-25T15:43:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "Wall Street’s rally fades as more CEOs talk about uncertainty because of Trump’s trade war\nWall Street’s rally fades as more CEOs talk about uncertainty because of Trump’s trade war\nNEW YORK (AP) — Wall Street’s big three-day rally is running out of steam, and U.S. stocks are drifting in mixed trading Friday as they near the end of another roller-coaster week.\nThe S&P 500 was 0.3% higher in afternoon trading, though the majority of stocks were falling within the index. The Dow Jones Industrial Average was down 104 points, or 0.2%, as of 1:50 p.m. Eastern time, while the Nasdaq composite was 0.7% higher thanks to gains for a handful of influential Big Tech stocks.\nIntel weighed on the market after the chip company said it’s seeing “elevated uncertainty across the industry” and gave a forecast for upcoming revenue and profit that fell short of analysts’ expectations. Its stock fell 7.5% even though its results for the beginning of the year topped expectations.\nEastman Chemical fell 5.9% after it gave a forecast for profit this spring that fell short of analysts’ expectations. CEO Mark Costa said that the “macroeconomic uncertainty that defined the last several years has only increased” and that future demand for its products “is unclear given the magnitude and scope of tariffs.”\nSkechers U.S.A., the shoe and apparel company, pulled its financial forecasts for the year due to “macroeconomic uncertainty stemming from global trade policies” even though it just reported a record quarter of revenue at $2.41 billion. Its stock fell 4.7%.\nThey’re the latest companies to say the uncertainty created by President Donald Trump’s trade war is making it difficult to give financial forecasts for the upcoming year.\nStocks had rallied earlier in the week on signals that Trump may be softening his approach on tariffs and his criticism of the Federal Reserve, which had earlier shaken markets. The hope is that if Trump rolls back some of his stiff tariffs, he could avert a recession that many investors see as otherwise likely because of his trade war.\nBut Trump’s on-again-off-again tariffs may nevertheless be pushing households and businesses to alter their spending and freeze plans for long-term investment because of how quickly conditions can change, sometimes seemingly by the hour.\n“Business owners scrambling to figure out their supply chains and exposure to tariffs is more than just a distraction,” according to Brian Jacobsen, chief economist at Annex Wealth Management. “It could be an existential threat, especially for smaller businesses that don’t have the scale or resources to have the same supply chain flexibility as larger firms.”\nHelping to keep lift the market was Alphabet, which rose 1.1%. Google’s parent company reported late Thursday that its profit soared 50% in the first quarter, more than analysts expected.\nAlphabet is one of the biggest companies on Wall Street in terms of size, and that gives its stock’s movements extra influence on the S&P 500 and other indexes. Another market heavyweight, Nvidia, also helped push the S&P 500 index upward after the chip company rose 3.4%.\nIn stock markets abroad, indexes rose modestly across much of Europe following more mixed movements in Asia. Tokyo’s Nikkei 225 jumped 1.9%, but stocks in Shanghai slipped 0.1%.\nIn the bond market, Treasury yields eased some more, and the yield on the 10-year Treasury fell to 4.26% from 4.32% late Thursday.\nIt’s been generally falling since approaching 4.50% earlier this month in a surprising rise that had suggested investors worldwide may be losing faith in the U.S. bond market’s reputation as a safe place to park cash.\nYields have dropped as several reports on the U.S. economy have come in weaker than expected, raising expectations that the Federal Reserve may cut interest rates later this year to support growth.\nA report on Friday morning said sentiment among U.S. consumers sank in April, though not by as much as economists expected. The survey from the University of Michigan said its measure of expectations for coming conditions has dropped 32% since January for the steepest three-month percentage decline seen since the 1990 recession.\nThe value of the U.S. dollar meanwhile strengthened against the euro and other rival currencies. It’s been recovering some of its sharp, unexpected losses from earlier this month that rattled investors.\n___\nAP Writers Jiang Junzhe and Matt Ott contributed.",
        "custom_category": "Business"
    }
]