[
    {
        "title": "About 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing",
        "description": "Three days of public viewing of Pope Francis’ body by ordinary mourners and statesmen alike have ended. Francis died on Monday at age 88 after suffering a stroke.",
        "content": "VATICAN CITY (AP) — More than 250,000 people paid their last respects to Pope Francis over three days of public viewing by ordinary mourners and statesmen alike that ended Friday, the eve of his state funeral in St. Peter’s Square and burial in a bas... [5549 chars]",
        "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
        "image": "https://dims.apnews.com/dims4/default/c5170f5/2147483647/strip/true/crop/8134x4575+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fae%2F9368acab1ca0e1fc25a0d7a438ad%2Fb3f601edc6b94d9f823a397e86672cb8",
        "publishedAt": "2025-04-25T17:39:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "About 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing\nAbout 250,000 mourners pay last respects to Pope Francis over 3 days of public viewing\nVATICAN CITY (AP) — More than 250,000 people paid their last respects to Pope Francis over three days of public viewing by ordinary mourners and statesmen alike that ended Friday, the eve of his state funeral in St. Peter’s Square and burial in a basilica outside the Vatican’s walls.\nWorld leaders, including U.S. President Donald Trump and Argentine President Javier Milei, along with royalty, converged on Rome for the funeral, but the group of marginalized people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp.\nThe Vatican said that 164 delegations are confirmed, including 54 heads of state and 12 reigning sovereigns. French President Emmanuel Macron, who will also attend the funeral, was among those who made it in time to pay last respects to the pope.\nPaying respects\nTens of thousands of mourners waited hours in line over three days to bid farewell to Francis, who died Monday after suffering a stroke at the age of 88. A higher-than-expected turnout prompted the Vatican to extend the basilica’s opening hours overnight.\nA changing of the guards at the sides of Francis’ open coffin signaled the end of the viewing period. The late pontiff was laid out in red robes, a bishop’s pointed miter and a rosary entwined in his hands.\nGiovanni Guarino drove from Naples with his girlfriend to bid their final farewells to the Francis, moved by his work to help the young and disadvantaged.\n“I hope that his successor follows the footsteps of Francis,” Guarino said.\nCardinal Kevin Farrell will preside over the closing and sealing of the coffin in his role of camerlengo, or interim Vatican administrator. A white cloth will be placed over the pope’s face, and a bag containing coins minted during his papacy will be put in the coffin along with a one-page written account of his papacy.\n‘We will see each other again’\nRoman neighbors and retired flight attendants Aurelia Ballarini and Francesca Codato came to pay respects to Francis on Friday with very different motivations. Ballarini, 72, was coming to terms with her grief, and Codato, 78, was seeking forgiveness.\nFor Ballarini, the pope’s death leaves a hole in her life. While only 16 years younger than Francis, she considered him a grandfather figure. Every morning, she would log on to Facebook for his daily greeting, and respond “with a couple of words.”\n“He gave everything, gave all of himself, up to the end,” said Ballarini. “I spent the last two days crying. I was not well after his passing — I can’t even say the word. For me he flew away. One day, we will see each other again.”\nCodato said that she feels tremendous guilt toward Francis, having forsaken him out of devotion to one of his predecessors, St. John Paul II. When Francis became pope “he was an outsider to me.”\n“I feel guilty, because through videos I have seen in these days, I have understood he was a man of enormous humanity, close to the simple people,” she said. “So I came to ask forgiveness, because I feel guilty towards him, like a worm.”\nCardinals ‘are in discussions’\nThe work of the conclave to choose a new pope won’t start until at least May 5, after nine days of public mourning.\nCardinals have been also been arriving in Rome, with 149 meeting on Friday morning to discuss church business. They won’t meet again until next week, meaning a conclave date is unlikely to be set until after the funeral.\nCardinal François-Xavier Bustillo, who hosted Francis during his last papal trip, to Corsica last year, remembered Francis as “a free man” who “humanized the church without desacralizing it.”\nHe described the atmosphere inside the meetings as “good,” but said that they weren’t yet “at the point of decisions; we are in discussions.”\nPapal burial\nIn keeping with Francis’ embrace of the marginalized, the Vatican said a group of poor and needy people will meet the pope’s coffin to pay homage to him when it arrives at St. Mary Major Basilica for burial on Saturday. It has already become a point of pilgrimage.\nThe tomb is being prepared behind a wooden barrier within the basilica that he chose to be near an icon of the Madonna that he revered and often prayed before. The burial will take place in private, the Vatican said.\nPhotos released by the Vatican on Friday show the marble tombstone flat against the pavement, with the simple engraving in Latin that he requested in his last testament: “Franciscus.”\nCardinals will visit the St. Mary Major Basilica on Sunday. Entering through the Holy Door, they will visit the Salus Populi Romani icon, which was dear to Francis, and celebrate evening prayers, the Vatican said.\nSecurity measures\nItaly is deploying more than 2,500 police officers and 1,500 soldiers to provide security during the funeral, which is expected to gather about 200,000 mourners in St. Peter’s Square and up to 300,000 people along the 4-kilometer (2½-mile) route from the Vatican to the pope’s burial place across Rome.\nThe major security operation includes stationing an armed naval vessel off the coast, and putting squads of fighter jets on standby, Italian media reported.\nRoyals and leaders\nTrump, who is traveling with first lady Melania Trump, is scheduled to arrive Friday, after Francis’ coffin has been sealed.\nUkrainian President Volodymyr Zelenskyy’s press office previously confirmed his presence, but he told reporters Friday evening on the site of a recent missile attack that he will attend if time permits, given obligations at home related to the ongoing war.\nAmong the other foreign dignitaries confirmed for the papal funeral are:\n— U.K. Prime Minister Keir Starmer\n— Prince William\n— King Felipe VI and Queen Letizia of Spain\n— Hungarian Prime Minister Viktor Orbán\n— Brazilian President Luiz Inácio Lula da Silva",
        "custom_category": "USA"
    },
    {
        "title": "Milwaukee Judge Dugan accused of helping man evade immigration agents",
        "description": "U.S. Sen. Tammy Baldwin says the arrest of a Milwaukee judge accused of helping a man evade immigration authorities is a “gravely serious and drastic move.\"",
        "content": "▶ Follow live updates on President Donald Trump and his administration\nMILWAUKEE (AP) — The FBI on Friday arrested a Milwaukee judge accused of helping a man evade immigration authorities, escalating a clash between the Trump administration and the j... [5449 chars]",
        "url": "https://apnews.com/article/immigration-judge-arrested-7997186bbca5730e70a25f2347e631f6",
        "image": "https://dims.apnews.com/dims4/default/4c07484/2147483647/strip/true/crop/7200x4050+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F51%2Ff3c3199c773a19a48e393ff194ce%2Fb22018a336ec425e886a1e8bc16df6ca",
        "publishedAt": "2025-04-25T17:15:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "Milwaukee Judge Hannah Dugan is accused of helping a man evade immigration agents and is arrested\nMilwaukee Judge Hannah Dugan is accused of helping a man evade immigration agents and is arrested\nMILWAUKEE (AP) — The FBI on Friday arrested a Milwaukee judge accused of helping a man evade immigration authorities, escalating a clash between the Trump administration and the judiciary over the Republican president’s sweeping immigration crackdown.\nFBI Director Kash Patel announced on social media the arrest of Milwaukee County Circuit Court Judge Hannah Dugan, who he said “intentionally misdirected” federal agents away from a man they were trying to take into custody at her courthouse last week.\n“Thankfully our agents chased down the perp on foot and he’s been in custody since, but the Judge’s obstruction created increased danger to the public,” Patel wrote.\nDugan was taken into custody by the FBI on Friday morning on the courthouse grounds, according to U.S. Marshals Service spokesperson Brady McCarron. She appeared briefly in federal court in Milwaukee later Friday before being released from custody. Her next court appearance is May 15.\n“Judge Dugan wholeheartedly regrets and protests her arrest. It was not made in the interest of public safety,” her attorney, Craig Mastantuono, said during the hearing. He declined to comment to an Associated Press reporter following her court appearance.\nDugan is charged with “concealing an individual to prevent his discovery and arrest” and obstructing or impeding a proceeding. She’s accused of escorting the man, Eduardo Flores-Ruiz, and his lawyer out of the courtroom through the jury door on April 18 as a way to help avert his arrest, according to an FBI affidavit filed in court.\nThe affidavit suggests that Dugan was alerted to the presence of U.S. Immigration and Customs Enforcement agents in the courthouse by her clerk, who was informed by an attorney that they appeared to be in the hallway.\nThe affidavit describes Dugan as “visibly angry” over the arrival of immigration agents in the courthouse and says that she pronounced the situation “absurd” before leaving the bench and retreating to her chambers. It says she and another judge later approached members of the arrest team inside the courthouse, displaying what witnesses described as a “confrontational, angry demeanor.”\nShe asked one of the officers if they had a judicial warrant and was told that the warrant was instead administrative. After a back-and-forth over the warrant, the affidavit says, she demanded that the arrest team speak with the chief judge and led them away from the courtroom.\nAfter directing the arrest team to the chief judge’s office, investigators say Dugan returned to the courtroom was and was heard saying words to the effect of “wait, come with me” before ushering Flores-Ruiz and his lawyer through a jury door into a non-public area of the courthouse. The action was unusual, the affidavit says, because “only deputies, juries, court staff, and in-custody defendants being escorted by deputies used the back jury door. Defense attorneys and defendants who were not in custody never used the jury door.”\nDugan’s arrest comes amid a growing feud between the Trump administration and the judiciary over the president’s executive actions on immigration and other matters. Trump administration officials have sharply criticized what they have described as “activist” judges they say claim have overstepped their authority and unfairly impinged on the president’s executive powers by blocking many of his efforts.\nU.S. Sen. Tammy Baldwin, a Democrat who represents Wisconsin, called the arrest of a sitting judge a “gravely serious and drastic move” that “threatens to breach” the separation of power between the executive and judicial branches.\n“Make no mistake, we do not have kings in this country and we are a Democracy governed by laws that everyone must abide by,” Baldwin said in an emailed statement. “By relentlessly attacking the judicial system, flouting court orders, and arresting a sitting judge, this President is putting those basic Democratic values that Wisconsinites hold dear on the line.”\nThe case is similar to one brought during the first Trump administration against a Massachusetts judge, who was accused of helping a man sneak out a back door of a courthouse to evade a waiting immigration enforcement agent.\nThat prosecution sparked outrage from many in the legal community, who slammed the case as politically motivated. Prosecutors dropped the case against Newton District Judge Shelley Joseph in 2022 under the Democratic Biden administration after she agreed to refer herself to a state agency that investigates allegations of misconduct by members of the bench.\nThe Justice Department had previously signaled that it was going to crack down on local officials who thwart federal immigration efforts.\nThe department in January ordered prosecutors to investigate for potential criminal charges any state and local officials who obstruct or impede federal functions. As potential avenues for prosecution, a memo cited a conspiracy offense as well as a law prohibiting the harboring of people in the country illegally.\n“No one is above the law,” Attorney General Pam Bondi said in a social media post Friday.\nDugan was elected in 2016 to the county court Branch 31. She also has served in the court’s probate and civil divisions, according to her judicial candidate biography.\nBefore being elected to public office, Dugan practiced at Legal Action of Wisconsin and the Legal Aid Society. She graduated from the University of Wisconsin-Madison in 1981 with a bachelor of arts degree and earned her Juris Doctorate in 1987 from the school.\n___\nRicher reported from Washington. Associated Press reporter Eric Tucker in Washington contributed.",
        "custom_category": "USA"
    },
    {
        "title": "Indian and Pakistani Soldiers Briefly Exchange Fire Along Kashmir Border",
        "description": "The clash took place just days after a terror attack killed 26 people on the Indian side of the disputed region, raising tensions between the two nuclear-armed nations.",
        "content": "India and Pakistan have exchanged fire along their heavily patrolled and contested border in the Kashmir region, escalating tensions between the two nuclear-armed neighbors just days after a terror attack killed 26 people on the Indian side of the di... [915 chars]",
        "url": "https://www.nytimes.com/2025/04/25/world/asia/india-pakistan-kashmir.html",
        "image": "https://static01.nyt.com/images/2025/04/25/multimedia/25int-kashmir01-photo-glzt/25int-kashmir01-photo-glzt-facebookJumbo.jpg",
        "publishedAt": "2025-04-25T16:42:20Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "scrap_content": null,
        "custom_category": "USA"
    },
    {
        "title": "Bezos-backed Slate Auto unveils affordable EV truck",
        "description": "Slate Auto, a firm backed in part by Amazon founder Jeff Bezos, is unveiling a low-cost electric truck that can also change into an SUV.",
        "content": "Slate Auto, a firm backed in part by Amazon founder Jeff Bezos, is unveiling a low-cost electric truck that can also change into an SUV.\nIts starting price point: $20,000 after federal EV incentives.\n\"A radically simple electric pickup truck that can... [1615 chars]",
        "url": "https://www.nbcnews.com/business/autos/bezos-backed-slate-auto-unveils-affordable-ev-truck-rcna203014",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250425-slate-ev-truck-mn-1156-fc4af5.jpg",
        "publishedAt": "2025-04-25T16:22:58Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "scrap_content": "Slate Auto, a firm backed in part by Amazon founder Jeff Bezos, is unveiling a low-cost electric truck that can also change into an SUV.\nIts starting price point: $20,000 after federal EV incentives.\n\"A radically simple electric pickup truck that can change into whatever you need it to be — even an SUV,\" the Slate Auto website says. \"Made in the USA at a price that’s actually affordable (no really, for real).\"\nThe two-door version can be changed into a 5-seat SUV. The baseline truck is small: About two-thirds the size of a Chevy Silverado EV and about seven-eights the size of a Ford Maverick. It has a payload capacity of 1,400 pounds compared the Maverick's 1500 pounds.\nAt less than 15 feet long, Slate says its more akin to a 1985 Toyota pickup.\nIts smaller and less gaudy stature are by design: TechCrunch refers to the Slate as an \"anti-Tesla,\" and while both the Slate Truck and the Cybertruck are customizable, the starting Slate model is stripped down to essential elements, including no power windows or infotainment screen.\nThe specs show a maximum range of 150 miles on a single charge, with the option for a longer-range battery pack that could offer up to 240 miles. The vehicles are designed in California and Michigan, engineered in Michigan, and assembled somewhere in the Midwest, according to Slate's website. TechCrunch reported the plant is in Indiana.\nEarlier this month, TechCrunch broke the news that Bezos, along with the controlling owner of the Los Angeles Dodgers, Mark Walter; and a third investor, Thomas Tull, had helped Slate raise $111 million for the project. A document filed with the Securities and Exchange Commission listed Melinda Lewison, the head of Bezos' family office, as a Slate Auto director.\nThe vehicles aren't expected to be delivered to customers until late 2026, but can be reserved for a refundable $50 fee.",
        "custom_category": "USA"
    },
    {
        "title": "Car bomb kills senior Russian general in Moscow: Officials",
        "description": "A car bomb in Moscow has killed a senior Russian military officer, Russian officials said.",
        "content": "A destroyed car sits in the courtyard of residential buildings following a blast in Balashikha, Russia, on April 25, 2025. An explosive device ripped through a parked car near Moscow, killing General-lieutenant Yaroslav Moskalik, deputy head of the m... [4246 chars]",
        "url": "https://abcnews.go.com/International/car-bomb-kills-senior-russian-general-moscow-officials/story?id=121153201",
        "image": "https://i.abcnewsfe.com/a/80f3da6b-c4a9-4378-9e56-0f689159db5e/russia-car-bomb-gty-jt-250425_1745598121679_hpMain_16x9.jpg?w=1600",
        "publishedAt": "2025-04-25T16:20:19Z",
        "source": {
            "name": "ABC News",
            "url": "https://abcnews.go.com"
        },
        "scrap_content": "Car bomb kills senior Russian general in Moscow: Officials\nKremlin spokesman Dmitry Peskov blamed Ukraine for the explosion.\nLONDON -- A car bomb in Moscow has killed a senior Russian military officer, Russian officials said.\nThe Russian Investigative Committee said Lt. Gen. Yaroslav Moskalik \"was killed in an explosion\" on Friday after an improvised explosive device allegedly planted in a parked car detonated in Balashikha, just outside Moscow.\nMoskalik was the deputy head of the main operations directorate of the General Staff of the Russian Armed Forces, the committee said.\nKremlin spokesman Dmitry Peskov blamed Ukraine for the explosion.\n\"The Kiev regime once again shows its essence,\" Peskov told a Kremlin-associated reporter on Friday. \"The Kiev regime continues to be involved in terrorist activity in our country. This once again shows that despite peaceful negotiations, we must be alert and understand the essence of this regime.\"\nThere has been no official comment from Ukraine yet on the incident.\nA team of investigators were at the site of the explosion, Russian officials confirmed.\nABC News has seen video of the moment the parked vehicle exploded as a person can be seen walking toward it.\nThe footage is seemingly from a CCTV camera overlooking the parking lot of what appears to be an apartment complex.\nThe explosion comes as President Donald Trump and his negotiators have been pushing to bring the three-year-long war conflict between Russia and Ukraine to a speedy end.\nThe president said Thursday he has a \"deadline\" in mind for talks to make progress, though he did not say what it was.\nSteve Witkoff, Trump's special envoy and lead negotiator in the peace talks, met with Russian President Vladimir Putin in Moscow for a fourth time on Friday.\nThe meeting came a day after Trump issued a rare public rebuke of Putin after Moscow launched missile and drone strikes at Kyiv that killed at least 12 people, marking the deadliest attack on the capital city since the summer of 2024.\n\"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing,\" Trump said on social media Thursday. \"Vladimir, STOP! 5000 soldiers a week are dying. Lets get the Peace Deal DONE!\"",
        "custom_category": "USA"
    },
    {
        "title": "'Star Wars Revenge of the Sith' Tops 'Accountant 2'",
        "description": "The rerelease of 'Star Wars: Revenge of the Sith' topped 'Accountant 2' in previews, while 'Sinners' showed the most force at the Thursday box office.",
        "content": "Talk about a blast from the past.\nLucasfilm and Disney’s 20th Anniversary rerelease of Star Wars: Episode III – Revenge of the Sith soared to $3.4 million in Thursday previews ahead of its limited one-week engagement, enough to beat the $2.5 million ... [3045 chars]",
        "url": "https://www.hollywoodreporter.com/movies/movie-news/star-wars-revenge-sith-box-office-previews-accountant-1236200735/",
        "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/04/Star-Wars-Revenge-of-the-Sith-and-The-Accountant-Split-Everett-H-2025.jpg?w=1296&h=730&crop=1",
        "publishedAt": "2025-04-25T16:18:53Z",
        "source": {
            "name": "The Hollywood Reporter",
            "url": "https://www.hollywoodreporter.com"
        },
        "scrap_content": "Talk about a blast from the past.\nLucasfilm and Disney’s 20th Anniversary rerelease of Star Wars: Episode III – Revenge of the Sith soared to $3.4 million in Thursday previews ahead of its limited one-week engagement, enough to beat the $2.5 million earned in previews by Ben Affleck’s new action-thriller The Accountant 2 (the $2.5 million includes “tax day” screenings held April 15).\nIf Revenge of the Sith proves to be a force of nature, the weekend could turn into a three-way race, versus just a contest between Warner Bros.’ holdover Sinners and Amazon MGM Studios’ Accountant 2, both of which are expected to earn between $20 million to $25 million.\nRelated Stories\nThe rerelease of Star Wars: The Phanom Menace earned $8.7 million on its opening weekend in May 2024, while the rerelease of Star Wars: Return of the Jedi grossed $5.1 million in late April 2023. There were no preview screenings for either of those titles. The big question is how frontloaded Sith is (one rival executive believes the Star Wars pic could indeed approach $20 million).\nMany put Ryan Coogler’s Sinners way ahead of those estimates, and are certain it will stay atop the chart with $30 million or more. Graced with virtually perfect audience scores and the best reviews of Coogler‘s already acclaimed career, Sinners has transformed into the rare title that has become a runaway water-cooler sensation.\nOn Thursday, Sinners bested the competition with a sizeable $6.1 million for an impressive seven-day domestic cume of $77.5 million. The period supernatural vampire pic starring Michael B. Jordan opened to a better-than-expected $48 million over Easter weekend to topple fellow Warners’ event pic A Minecraft Movie after the former ruled the roost for two consecutive weekends.\nThe first Accountant, released by Warners, opened to $24.7 million in 2016 on its way to grossing $155.5 million globally and becoming the most-rented digital film in 2017, according to Amazon MGM.\nReuniting Affleck and director Gavin O’Connor, Accountant 2 currently sports a fresh 76 percent critics score on Rotten Tomatoes, compared to a rotten 53 percent for the first film. Consumers are far more entranced, judging the by the sequel’s current 93 percent audience Rotten Tomatoes score.\nAffleck produced the sequel via his and Matt Damon’s Artists Equity, alongside Lynette Howell Taylor for 51 Entertainment and Mark Williams for Zero Gravity Management. The film made its world premiere at SXSW last month, winning the audience Award for the Headliners section.\nJon Bernthal, Cynthia Addai-Robinson, Daniella Pineda, Allison Robertson and J.K. Simmons co-star in Accountant 2, which sees Affleck’s character compelled to step in and help solve the murder of an old acquaintance with the help of his estranged brother and a U.S. Treasury agent. Together, they uncover a deadly conspiracy, becoming targets of a ruthless network of killers who will stop at nothing to keep their secrets buried.\nBoth Accountant 2 and Sinners are R-rated and will compete alongside Revenge of the Sith for male attention, although the latter has the advantage of also playing to families.\nScreen Gem and Sony’s new horror offering Until Dawn took in $1 million in Thursday previews for a weekend opening in the single-digit range. It is likewise rated R.",
        "custom_category": "USA"
    },
    {
        "title": "Former Rep. George Santos sentenced to more than 7 years in prison",
        "description": "A federal judge in New York sentenced former Rep. George Santos to over seven years in prison Friday.",
        "content": "A federal judge in New York sentenced former Rep. George Santos to over seven years in prison Friday.\nU.S. District Judge Joanna Seybert also ordered him to pay over $373,000 in restitution.\nProsecutors had urged Seybert to throw the book at Santos, ... [4856 chars]",
        "url": "https://www.nbcnews.com/politics/justice-department/former-rep-george-santos-sentenced-7-years-prison-rcna202397",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-george-santos-2023-ac-937p-be3c7d.jpg",
        "publishedAt": "2025-04-25T16:17:39Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "scrap_content": "A federal judge in New York sentenced former Rep. George Santos to over seven years in prison Friday.\n\"Where is the remorse?\" U.S. District Judge Joanna Seybert asked Santos before sentencing him to 87 months behind bars and ordering him to almost $374,000 in restitution.\nHe was ordered to surrender by July 25.\nSeybert handed down the sentence after Santos made a tearful plea for mercy and acknowledged he'd \"betrayed the confidence\" of his constituents.\nThe judge did not appear moved by Santos' sobs. She said doesn't like sending people to jail, but Santos was “fully deserving” of the lengthy sentence.\nJohn J. Durham, the U.S. attorney for the Eastern District of New York, called the sentence \"justice\" after the hearing, and said Santos was \"finally held accountable for the mountain of lies, theft, and fraud he perpetrated.”\nSantos, 36, had pleaded guilty in August of last year to charges of committing wire fraud and aggravated identity theft.\nProsecutors had urged Seybert to throw the book at Santos, the disgraced former Republican congressman, to \"reflect the seriousness of Santos’s unparalleled crimes.\"\n\"From his creation of a wholly fictitious biography to his callous theft of money from elderly and impaired donors, Santos’s unrestrained greed and voracious appetite for fame enabled him to exploit the very system by which we select our representatives,\" prosecutors said in a sentencing memorandum, in which they asked Seybert to sentence him to 87 months in prison.\nProsecutors said that despite his guilty plea to the pair of felony fraud charges — and a teary expression of remorse to news cameras after the proceeding — Santos is \"a pathological liar\" who isn't actually remorseful about his actions.\nProsecutors noted he'd recently launched a weekly podcast called \"Pants on Fire with George Santos,\" which they called “a perfect crystallization of his lack of genuine contrition and his tone-deaf efforts to continue turning lies into dollars.\"\n\"It is abundantly clear that, without a substantial deterrent, Santos will continue to deceive and defraud for years to come. That is especially true given Santos’s craven efforts to leverage his lawbreaking as a springboard to celebrity and riches\" while failing to pay restitution to the people he swindled, prosecutors said.\nSantos' attorneys had urged Seybert to sentence him to the minimum of two years. \"His conduct, though involving dishonesty and abuse of trust, stemmed largely from a misguided desperation related to his political campaign, rather than inherent malice,\" his attorneys contended in a court filing, noting that he had no criminal history.\n\"Moreover, the public nature of this case and Mr. Santos's fall from a position of public trust serve as a stark warning to others who might contemplate similar offenses,\" their filing said.\nAsked this month on his podcast whether he planned to ask President Donald Trump for a pardon, Santos said, \"You bet your sweet a-- I would.\"\nIn an interview with NY1 this week, Santos said he hadn't reached out to Trump, but he added that he believes \"the president is aware of my situation.”\n\"If he feels like I'm worthy of a commutation or of clemency or whatever the case is, he can make that decision,\" he said.\nSantos was elected to Congress in 2022, when he flipped a seat on Long Island from Democratic to Republican, helping cement a narrow GOP majority in the House.\nQuestions about his background emerged before he even started his term. The New York Times reported that he had lied about or embellished parts of his résumé and personal history. That led to other fabrications' being revealed, including a claim that he was Jewish. He later said he was “Jew-ish.”\nThose lies were later revealed to include campaign finance fraud. He was indicted in federal court on Long Island on a wide array of charges in 2023.\nProsecutors said he committed identity theft and swindled donors to enrich himself and live a luxurious lifestyle. Among those whose credit card information he used to make unauthorized donations were three \"elderly persons suffering from some degree of cognitive impairment or decline,\" prosecutors said.\nHe was also later hit with a scathing House Ethics Committee report that found he spent campaign funds on rent, luxury designer goods, personal trips to Las Vegas and the Hamptons, cosmetic treatments and a subscription to the adult content site OnlyFans.\nThe House voted to expel him in December 2023.\nSantos claims to have raked in hundreds of thousands of dollars since then, thanks in large part to personalized videos he was selling on the website Cameo.\nIn their sentencing memo, prosecutors suggested he might have been inflating those claims, as well.\n\"Santos represented to the Probation Department that he has earned approximately $400,000 during the first month of his career on Cameo and now receives $5,000 per month on average. Yet he represented in a financial statement to the government that his lifetime earnings from Cameo are only $358,256. Clearly, he is lying to someone,\" the filing said.\nThey also said Santos told prosecutors that he'd been paid $200,000 by a documentary filmmaker but that he'd told the Probation Department the amount was $250,000.\nProsecutors noted that under the terms of his plea agreement, Santos had agreed to pay a $200,000 forfeiture and over $373,000 in restitution to his victims.\nIn a court filing this month, they said that \"Santos has forfeited nothing and has not repaid any of his victims.\"\nIn his interview with NY1, Santos said: \"As of today, right now, I'm unable to pay anything. I don't know if that's going to change within the next 24 to 48 hours, prior to sentencing, because I am still working on trying to make some kind of meaningful attempt at restitution because it is my obligation.\"",
        "custom_category": "USA"
    },
    {
        "title": "Pope Francis Remembered as Faithful Throng Pays Last Respects",
        "description": "“It meant a lot to me to see him, he gave us so much,” said one woman who waited in line to file past the pontiff’s casket.",
        "content": "The doors opened to St. Peter’s Basilica at 5:40 a.m. on Friday, and people immediately began to trickle in to pay their respects to Pope Francis, whose body lay beneath the vast dome designed by Michelangelo. A couple of hours later, the trickle was... [856 chars]",
        "url": "https://www.nytimes.com/2025/04/25/world/europe/francis-pope-funeral.html",
        "image": "https://static01.nyt.com/images/2025/04/25/multimedia/25int-pope-qvkj/25int-pope-qvkj-facebookJumbo.jpg",
        "publishedAt": "2025-04-25T16:01:59Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "scrap_content": null,
        "custom_category": "USA"
    },
    {
        "title": "Clair Obscur: Expedition 33 hits 500k sales in one day",
        "description": "Reactive turn-based RPG Clair Obscur: Expedition 33 only released yesterday, but it's already passed an impressive sales milestone.",
        "content": "Reactive turn-based RPG Clair Obscur: Expedition 33 only released yesterday, but it's already passed an impressive sales milestone.\nThe debut game from Sandfall Interactive has sold 500,000 copies in just one day.\n\"A milestone for us, reached sooner ... [1284 chars]",
        "url": "https://www.eurogamer.net/clair-obscur-expedition-33-hits-500k-sales-in-one-day",
        "image": "https://assetsio.gnwcdn.com/paint-effect-artwork-for-Clair-Obscur-Expedition-33-showing-two-characters-holding-hands-while-looking-towards-eachother.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
        "publishedAt": "2025-04-25T15:33:38Z",
        "source": {
            "name": "Eurogamer",
            "url": "https://www.eurogamer.net"
        },
        "scrap_content": "Reactive turn-based RPG Clair Obscur: Expedition 33 only released yesterday, but it's already passed an impressive sales milestone.\nThe debut game from Sandfall Interactive has sold 500,000 copies in just one day.\n\"A milestone for us, reached sooner than we'd ever imagined,\" the Clair Obscur: Expedition 33 team wrote on social media. \"Thank you all.\"\nAn infographic accompanying the news specifically said this figure related to sales of the game, so it would appear this does not include those playing via Xbox's Game Pass subscription service.\nThis ultimately means more than half a million of us are currently dipping our toe into Clair Obscur: Expedition 33. And, rightly so, with Sandfall Interactive's debut title receiving scores of praise across the industry.\nOur Ed enjoyed Clair Obscur: Expedition 33, and complimented the game's artwork and combat in particular.\n\"Outside the core plot, there's a wonderful silliness - and self-deprecation - to Clair Obscur that, together with its outstanding art direction and unique battle mechanics, ensure the game is distinct,\" reads Eurogamer's Clair Obscur: Expedition 33 review. \"It's an ambitious yet impressive debut from the studio that, despite a somewhat fanciful narrative, is a pensive examination of grief and the power of art.\"\nIf you are one of the many currently playing through Clair Obscur: Expedition 33, but need a little assistance, well then we have guides a plenty for you. Here's one on how to upgrade weapons in Clair Obscur: Expedition 33 to get you started.",
        "custom_category": "USA"
    },
    {
        "title": "Judge arrested after allegedly obstructing immigration agents",
        "description": "Judge Hannah Dugan is accused of trying to help an undocumented immigrant who appeared in her court avoid arrest.",
        "content": "US judge arrested after allegedly obstructing ICE agents\nA judge in Wisconsin has been arrested by US federal authorities after allegedly trying to help an undocumented immigrant who appeared in her court avoid arrest.\nThe US Marshalls Service told t... [474 chars]",
        "url": "https://www.bbc.com/news/articles/cly5xx017vko",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d05/live/502ef380-21ef-11f0-8c2e-77498b1ce297.jpg",
        "publishedAt": "2025-04-25T15:27:31Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "US judge arrested after allegedly obstructing immigration agents\nA judge in Wisconsin has been arrested by the Federal Bureau of Investigation after allegedly trying to help an undocumented immigrant who appeared in her court avoid arrest.\nFBI agents took Milwaukee County Circuit Judge Hannah Dugan into custody on Friday morning, officials said.\nIn a post on X, which was deleted minutes later, FBI Director Kash Patel alleged that Dugan allowed Eduardo Flores-Ruiz, a Mexican national facing three misdemeanour battery counts stemming from a fight, to escape from her courtroom.\nDugan was charged with obstruction and concealing an individual to avoid arrest, and faces a maximum of six years in prison if convicted on both charges.\nDuring a hearing on Friday, a lawyer for Dugan said she \"wholeheartedly regrets and protests her arrest\". \"It was not made in the interest of public safety.\"\nShe was released on her own recognisance pending a hearing on 15 May.\nAn immigration judge had issued a warrant for Flores-Ruiz's arrest on 17 April, according to court documents filed in the case by the FBI.\nThe following day, Flores-Ruiz appeared in the Milwaukee court for a scheduled hearing, and officers from US Immigration and Customs Enforcement (Ice) and the FBI went to the courthouse to make the arrest.\nDugan became agitated when she learned that immigration agents were in the courthouse and directed several of them to the office of the county's chief justice, an FBI special agent wrote in the court document.\nWhile they were there, the document says, the judge ushered Flores-Ruiz and his lawyer to a side door meant for jury members leading out of the courtroom.\nFlores-Ruiz, who authorities say had previously been deported from the US in 2013, managed to leave the courthouse but was arrested just minutes later after a short foot chase.\nAttorney General Pam Bondi posted on X that Dugan was detained \"for allegedly helping an illegal alien avoid an arrest... No one is above the law\".\nDugan was first elected as a judge in 2016, and was re-elected to a second six-year term in 2022.\nJudicial elections in Wisconsin are non-partisan, however Dugan was endorsed by Milwaukee's Democratic mayor.\nThe obstruction charge carries a maximum sentence of five years in prison and a $250,000 fine, while the concealment charges can be punished by up to one year in prison and a $100,000 fine.",
        "custom_category": "USA"
    }
]