[
    {
        "title": "Judge blocks parts of Trump’s overhaul of US elections",
        "description": "A federal judge has agreed with voting rights groups and Democrats that the Constitution gives the power to regulate federal elections to states and Congress — not the president.",
        "content": "▶ Follow live updates on President Donald Trump and his administration\nNEW YORK (AP) — A judge on Thursday blocked the Trump administration from immediately enacting certain changes to how federal elections are run, including adding a proof-of-citize... [5430 chars]",
        "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e",
        "image": "https://dims.apnews.com/dims4/default/6f32dea/2147483647/strip/true/crop/3770x2121+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F58%2F03fd880e0c2bc6bbf8f02dc553a7%2Fdb8f2d2e47c14403bc57b6c4aed5e76b",
        "publishedAt": "2025-04-24T21:21:00Z",
        "source": {
            "name": "AP News",
            "url": "https://apnews.com"
        },
        "scrap_content": "Judge halts parts of Trump’s overhaul of US elections, including proof-of-citizenship requirement\nJudge halts parts of Trump’s overhaul of US elections, including proof-of-citizenship requirement\nNEW YORK (AP) — A judge on Thursday blocked the Trump administration from immediately enacting certain changes to how federal elections are run, including adding a proof-of-citizenship requirement to the federal voter registration form.\nThe decision is a setback for President Donald Trump, who has argued the requirement is needed to restore public confidence in elections. But the judge allowed other parts of Trump’s sweeping executive order on U.S. elections to go forward for now, including a directive to tighten mail ballot deadlines around the country.\nTrump’s March executive order overhauling how U.S. elections are run prompted swift lawsuits from the League of United Latin American Citizens, the League of Women Voters Education Fund, the Democratic National Committee and others, who called it unconstitutional.\nU.S. District Judge Colleen Kollar-Kotelly in Washington sided with voting rights groups and Democrats, saying that the Constitution gives the power to regulate federal elections to states and Congress — not the president. She noted federal lawmakers are currently working on their own legislation to require proof of citizenship to vote.\nIn a 120-page decision on Thursday, she said the plaintiffs had proven that the proof-of-citizenship requirement would cause their clients irreparable harm and go against the public interest, while the government had offered “almost no defense of the President’s order on the merits.”\nAccordingly, she granted a preliminary injunction to stop the citizenship requirement from moving forward while the lawsuit plays out.\nThe judge also blocked part of the Republican president’s order requiring public assistance enrollees to have their citizenship assessed before getting access to the federal voter registration form.\nBut she denied other requests from a group of Democratic plaintiffs, including refusing to block Trump’s order to require all mailed ballots to be received by Election Day nationwide. She also did not touch Trump’s order to open certain databases to billionaire Elon Musk’s Department of Government Efficiency to allow it to review state voter lists to search for noncitizens. The judge said those arguments brought by Democrats were either premature or should be brought by states instead.\nThe plaintiffs had argued Trump’s proof-of-citizenship requirement violated the Constitution’s so-called Elections Clause, which gives states and Congress the authority to determine how elections are run.\nThey also argued that Trump’s order asserts power that he does not have over an independent agency. That agency, the U.S. Election Assistance Commission, sets voluntary voting system guidelines and maintains the federal voter registration form.\nDuring an April 17 hearing, attorneys for the plaintiffs had said requiring proof of citizenship on the federal voter registration form would complicate their clients’ voter registration drives at grocery stores and other public places.\nAria Branch, counsel for the Democratic National Committee and other Democratic plaintiffs, also argued the executive order’s effort to tighten mail ballot deadlines would irreparably harm her clients by forcing them to reallocate resources to help voters navigate the changes.\n“That’s time, money and organizational resources and strategy that can’t be recouped,” she said.\nMichael Gates, counsel for the Trump administration, said in the hearing a preliminary injunction wasn’t warranted because the order hadn’t been implemented and a citizenship requirement would not be on the federal voter registration form for many months.\nRoman Palomares, president of the League of United Latin American Citizens, a nonpartisan plaintiff, said Thursday the judge’s decision was a “victory for voters.”\n“Efforts to silence the voice and votes of the U.S. electorate must not stand because our democracy depends on all voters feeling confident that they can vote freely and that their vote will be counted accurately,” he said in a statement.\nRepresenting the Democratic plaintiffs, Branch said in a Thursday statement that “this fight is far from over” but called the ruling a “victory for democracy and the rule of law over presidential overreach.”\nThe chairs of the DNC, Democratic Governors Association and Democratic committees in Congress said if the judge hadn’t ruled in their favor on citizenship proof, “Americans across the country — including married women who changed their last name and low-income individuals — could have been unable to register to vote.”\nThe Justice Department’s Civil Rights Division said it was disappointed by the ruling.\n“Few things are more sacred to a free society or more essential to democracy than the protection of its election systems,” said Harmeet Dhillon, assistant attorney general for civil rights.\nDonald Palmer, chair of the EAC, a defendant in the case, said his office was still reviewing the ruling and opinion “but we will comply with the Judge’s decision.”\nThe judge’s decision comes as state and local election officials from across the country are meeting to consider the implications of Trump’s executive order on their work.\nThe U.S. Election Assistance Commission’s Standards Board, which was holding a public hearing in North Carolina on Thursday, is a bipartisan advisory group of election officials from every state that meets annually.\nMeanwhile, other lawsuits against Trump’s order are still pending.\nIn early April, 19 Democratic attorneys general asked the court to reject Trump’s executive order. Washington and Oregon, which both hold all-mail elections, followed with their own lawsuit against the order.\nThe U.S. differs from many other countries in that it does not hold national elections run by the federal government. Instead, elections are decentralized — overseen by the states and run by thousands of local jurisdictions.\n___\nAssociated Press writer Christina A. Cassidy in Atlanta contributed reporting.",
        "custom_category": "USA"
    },
    {
        "title": "Shannon Sharpe steps aside from ESPN until start of NFL preseason",
        "description": "Hall of Fame tight end and media personality Shannon Sharpe has issued a new statement in the aftermath of the lawsuit filed against him on Sunday.",
        "content": "Hall of Fame tight end and media personality Shannon Sharpe has issued a new statement in the aftermath of the lawsuit filed against him on Sunday.\nThe following email arrived within the past hour:\n“My personal statement is found HERE and this is the... [2470 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/shannon-sharpe-steps-aside-from-espn-until-start-of-nfl-preseason",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/f3efecf/2147483647/strip/true/crop/4722x2656+0+245/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff1%2F08%2Fdbe9cd1541479b0b43776a7c9277%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2183742713",
        "publishedAt": "2025-04-24T20:35:57Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "scrap_content": "Hall of Fame tight end and media personality Shannon Sharpe has issued a new statement in the aftermath of the lawsuit filed against him on Sunday.\nThe following email arrived within the past hour:\n“My personal statement is found HERE and this is the truth The relationship in question was 100% consensual.\n“At this juncture I am electing to step aside temporarily from my ESPN duties.\n“I will be devoting this time to my family, and responding and dealing with these false and disruptive allegations set against me. I plan to return to ESPN at the start of the NFL preseason.\n“I sincerely appreciate the overwhelming and ongoing support I have received from my family, fans, friends and colleagues.”\nSharpe also tweeted the text of the statement, from what appears to be the screenshot of a text message he received.\nWhether Sharpe is given the ability to return to ESPN at the start of the NFL preseason is a different issue. The Tuesday admission by Sharpe’s lawyer, Lanny Davis, that Sharpe offered $10 million to settle the claims before they were filed could prompt ESPN to do a full investigation into the situation.\nIt’s one of the natural potential consequences of admitting to the offer publicly. A number that large generates attention and invites speculation as to whether he was simply trying to neutralize a blackmail threat or whether the amount that was offered conflicts with his insistence that the relationship was consensual.\nThe number seems to be much more than an objective estimation of the potential settlement value of the case. The legal fees, which he’ll pay whether he wins or loses, shouldn’t be staggering, It’s a simple case, with few witnesses to be deposed. The trial should be fairly short. The total legal fees shouldn’t be more than $500,000, if that.\nBeyond that, the $50 million demand made in the lawsuit is meaningless. In some cases, there will be undeniable financial losses resulting from alleged misconduct. In this case, the numbers have no objective anchor: $10 million for general damages, $10 million for special damages (she’ll have to prove $10 million in out-of-pocket financial losses resulting from Sharpe’s alleged behavior), $10 million for statutory penalties (whatever that means), and $20 million in punitive damages.\nSimply put, reasonable minds can conclude that offering $10 million implies awareness of responsibility. Davis has expressed strong disagreement with that characterization. In the court of public opinion, however, the opinions expressed by one side’s lawyer aren’t binding.\nAnd ESPN’s interpretation of the overall verdict rendered by the court of public opinion will be critical to whether it ever allows ESPN to appear again on its platform.",
        "custom_category": "USA"
    },
    {
        "title": "Rams trade up, 2 RBs picked in top 15 in Colin Cowherd's 2025 NFL mock draft",
        "description": "Shedeur Sanders slips out of the top 15 in Colin Cowherd's final mock draft as he shares what he's hearing on potential trades involving Travis Hunter and Ashton Jeanty.",
        "content": "National Football League Rams trade up, 2 RBs picked in top 15 in Colin Cowherd's 2025 NFL mock draft Updated Apr. 24, 2025 4:25 p.m. ET share facebook x reddit link\nDraft Day has finally arrived. The 2025 NFL Draft will commence Thursday night with ... [7185 chars]",
        "url": "https://www.foxsports.com/stories/nfl/rams-trade-up-2-rbs-picked-top-15-colin-cowherds-2025-nfl-mock-draft",
        "image": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2025/04/1408/814/img_2358.jpeg?ve=1&tl=1",
        "publishedAt": "2025-04-24T20:25:00Z",
        "source": {
            "name": "FOX Sports",
            "url": "https://www.foxsports.com"
        },
        "scrap_content": "Rams trade up, 2 RBs picked in top 15 in Colin Cowherd's 2025 NFL mock draft\nDraft Day has finally arrived. The 2025 NFL Draft will commence Thursday night with the first round. As of Thursday afternoon, each team still owns its first-round selection, which marks the first time that's been the case on Draft Day in the Common Draft Era.\nHowever, that doesn't mean that there won't be trades made when the first round takes place on Thursday night. In fact, Colin Cowherd projects that one team will make a big jump into the top 15 in his final mock draft.\n\"I was on the phone last night, yesterday afternoon and this morning and there was a lot of Bears rumors about Ashton Jeanty,\" Cowherd said on Thursday's \"The Herd.\" \"But to make a trade work, a lot of teams want things. I'm told that the Jaguars want to go up and get Travis Hunter. Well, what do we get? So, there's a lot of conversations and calls. Very rarely do you get moves in the top 10 picks, but there are a lot of calls. So, here's what I'm hearing.\"\nWith that, let's take a look at Colin Cowherd's final mock draft, with odds courtesy of DraftKings Sportsbook. You can also check out every other mock draft we've published this week here:\n[2025 NFL mock drafts: Shedeur Sanders, Jaxson Dart go earlier than expected in Rob Rang's final mock draft; Henry McKenna's embrace-the-chaos Round 1; Chris \"The Bear\" Fallica's first-round mock draft; Joel Klatt's first-round mock draft, Danny Parkins' first-round mock draft]\n1. Tennessee Titans: Cam Ward, QB, Miami (Fla.)\nOdds to be No. 1 overall pick: -20000\nCowherd's thoughts: \"This is an easy one. Good fit with Brian Callahan's offense. More than anything, he's a major talent upgrade over who the Titans played at quarterback last year. Last year, Tennessee's quarterbacks combined for 22 touchdowns and 21 picks.\"\n2. Cleveland Browns: Travis Hunter, WR/CB, Colorado\nOdds to be No. 2 overall pick: -2500\nCowherd's thoughts: \"Most talented athlete in the draft. I think [Hunter's] a historically gifted athlete. They are getting calls on Travis Hunter, and not just one. They're going to, I believe, keep him. Maybe he's not a Shohei Ohtani. Maybe he is. But there's just not a lot of guys like this.\"\n3. New York Giants: Abdul Carter, edge, Penn State\nOdds to be No. 3 overall pick: -1400\nCowherd's thoughts: \"It's a star-less draft, and Carter's one of the four or five stars in the draft. They've already got a good defensive line, but a lot of teams pick the best player available. There's no question that, at this point, Carter's the best player available.\n4. New England Patriots: Will Campbell, OT, LSU\nOdds to be No. 4 overall pick: -475\nCowherd's thoughts: \"Reality is, the Patriots had the worst offensive line in the league. They can get running backs, tight ends and wide receivers elsewhere. There's only four or five offensive tackles that people really like, maybe fewer than that. You've got Drake Maye. Now you've got to protect him.\"\n5. Jacksonville Jaguars: Mason Graham, DT, Michigan\nOdds to be No. 5 overall pick: +350\nCowherd's thoughts: \"The Jaguars go for one of the cleaner players in the draft. They could not stop the run last year. By the way, they've got Travon Walker and Josh Hines-Allen, so Graham would create a nice combo there and their defensive line would be set for lines. I love Mason Graham.\"\n6. Las Vegas Raiders: Ashton Jeanty, RB, Boise State\nOdds to be No. 6 overall pick: +425\nCowherd's thoughts: \"The Raiders need a receiver and a running back. Pete Carroll's old school. He likes to create a run game. He had his most success with Marshawn Lynch in the pros and Reggie Bush and LenDale White in college. They need Jeanty. I think he's a really unique running back first-round talent.\"\n7. New York Jets: Tyler Warren, TE, Penn State\nOdds to be No. 7 overall pick: +175\nCowherd's thoughts: \"I know the Jets have a defensive coach, but they don't have enough weapons. Garrett Wilson needs some protection. I saw Tyler Warren play at USC and catch 17 balls. He's not Brock Bowers, but he's got so much dexterity and versatility that I don't think the Jets can pass on him. The Jets get no tight end production, he solves it for the next five years.\"\n8. Carolina Panthers: Jalon Walker, edge, Georgia\nOdds to be No. 8 overall pick: +125\nCowherd's thoughts: \"It's another Georgia pass rusher. He was a five-star recruit with [a lot of hype]. Sometimes he lives up to it. Sometimes he does not. But again, in a superstar-less draft, he's a good pass rusher from Georgia and they typically work out OK.\"\n9. New Orleans Saints: Mykel Williams, edge, Georgia\nOdds to be No. 9 overall pick: +275\nCowherd's thoughts: \"The Saints could use offensive line help, but I think they go Mykel Williams here. They didn't have a good defense last year. They've got to rebuild their offensive line, but they've got to go best player available. These Georgia guys, it doesn't matter if they underachieve a little or if they've got some character stuff, they come into the NFL and they can play.\n10. Chicago Bears: Will Johnson, CB, Michigan\nOdds to be No. 10 overall pick: +2800\nCowherd's thoughts: \"The Bears would love a star running back, but I think they take Will Johnson. They've got Jaylon Johnson on one side and this is a team that spent a ton of money on offense over the last two years. They need to get cheap on defense. He's a very good corner and the Bears need to upgrade their secondary.\"\n11. San Francisco 49ers: Kelvin Banks Jr., OT, Texas\n49ers' odds to draft OL with first pick: -150\nCowherd's thoughts: \"Left tackle Trent Williams is 37. The 49ers lost two offensive linemen in free agency. … If you're going to spend money on Brock Purdy, who's had a couple of injuries already, you've got to protect. Banks, in my opinion, is the best offensive lineman in the draft.\"\n12. Dallas Cowboys: Omarion Hampton, RB, North Carolina\nCowboys' odds to draft RB with first pick: +1000\nCowherd's thoughts: \"The Cowboys don't have enough offensive firepower. Jerry Jones likes stars, he wanted to draft Johnny Manziel at one point and they talked him out of it. Hampton's Joe Mixon with a better burst. So, why not? If you're going to spend money on Dak Prescott, you've got to get him weapons. You'v got one right now in CeeDee Lamb. I think they go big. It's exciting, explosive and Jerry would love the attention.\"\n13. Los Angeles Rams (via Miami Dolphins): Colston Loveland, TE, Michigan\nRams' odds to draft TE with first pick: +425\nCowherd's thoughts: \"The Rams tried to move up last year for Brock Bowers, but it was too rich. They're just not getting enough tight end production. The feeling with Rams is, they've got Davante Adams, Puka Nacua, Kyren Williams and the O-line is settled. So, let's go get a star tight end for Matthew Stafford this year and next, his last couple of years with the Rams.\"\n14. Indianapolis Colts: Armand Membou, OT, Missouri\nColts' odds to draft OL with first pick: +270\nCowherd's thoughts: \"The Colts will, in their eyes, take the best player available, which is Armond Membou here. He's a monster. The reality is, outside of Quenton Nelson, nobody else played 17 games on the O-line for the Colts. Chris Ballard will be patient. He let the best player fall to him.\"\n15. Atlanta Falcons: Jihaad Campbell, LB, Alabama\nFalcons' odds to draft LB with first pick: +600\nCowherd's thoughts: \"The Falcons have gone offense in the first round in the last four drafts. That's why their defense is not very good. Michael Penix Jr. is fine. The O-line's fine. They've got Kyle Pitts, Drake London and Bijan Robinson. Their offense is fine. They need to be faster and more athletic on defense. Campbell's an underrated player. Most Alabama players aren't underrated, but the guy's an unbelievable freak athlete. He's probably the best linebacker in the draft.\"\nWant great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.",
        "custom_category": "USA"
    },
    {
        "title": "Stock market news for April 24, 2025",
        "description": "Stocks notched their third day of gains in a row, fueled by a rally in technology stocks.",
        "content": "A trader works on the floor of the New York Stock Exchange during afternoon trading on April 9, 2025 in New York.\nStocks popped Thursday thanks to strong gains in megacap tech names, as investors continued to look for signs of progress on the global ... [2325 chars]",
        "url": "https://www.cnbc.com/2025/04/23/stock-market-today-live-updates.html",
        "image": "https://image.cnbcfm.com/api/v1/image/108129619-1744234211527-gettyimages-2208761284-AFP_39RL8F8.jpeg?v=1745524837&w=1920&h=1080",
        "publishedAt": "2025-04-24T20:19:00Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "scrap_content": "Stocks popped Thursday thanks to strong gains in megacap tech names, as investors continued to look for signs of progress on the global trade front.\nThe S&P 500 ended up 2.03% at 5,484.77, while the tech-heavy Nasdaq Composite added 2.74% to finish at 17,166.04. The Dow Jones Industrial Average lagged the other two indexes, weighed down by a 6.6% drop in IBM, but still added 486.83 points, or 1.23%, at 40,093.40. This marked the blue-chip index's first close above the 40,000 threshold since April 15.\nShares of Nvidia, Meta, Amazon, Tesla and Microsoft all closed higher, propelling the major averages to their third day of gains in a row. Tech has been rocked recently as the White House's increasingly confrontational trade stance, particularly against China, dents sentiment on the sector.\nChina said overnight that there were no trade talks taking place with the U.S. China's Ministry of Commerce spokesperson He Yadong said \"all sayings\" regarding progress on bilateral talks should be dismissed. He also called for the cancellation of \"unilateral\" tariffs.\nThose remarks came after President Donald Trump said he is willing to take a less confrontational approach toward trade talks with Beijing. Further, Treasury Secretary Scott Bessent said Wednesday that the U.S. has the \"opportunity for a big deal\" on trade. Chinese imports are subject to a U.S. tariff of 145%.\nWith this lack of trade negotiation progress with China in mind, Ross Mayfield, investment analyst at Baird, was cautious about Thursday's rally upward.\n\"I don't trust the move,\" he told CNBC in an interview. \"China overnight was pretty explicit that there were no negotiations ongoing. Perhaps the market is still feeling some confidence that at least the administration is talking about wanting a deal, as opposed to digging in and raising tariffs to insane rates. There's potentially some leftover optimism from yesterday.\"\nStill, investors received some good news on Thursday afternoon when Treasury Secretary Scott Bessent said that the Trump administration may reach \"an agreement on understanding\" on trade with South Korea \"as soon as next week.\"\nThe S&P 500 has slipped 3.3% since April 2, the day Trump announced his new policy on U.S. imports. Since then, the Dow has declined 5.1%, while the Nasdaq has lost 2.5%.\nThe major averages are currently pacing to end the week in positive territory, which would mark the second positive week in three for all three indexes.",
        "custom_category": "USA"
    },
    {
        "title": "Google Earnings: Stock Soars As Q1 Results Shatter Expectations",
        "description": "Google parent Alphabet reported a 49% year-over-year profit surge.",
        "content": "Topline\nGoogle parent Alphabet reported first-quarter earnings Thursday afternoon, becoming the first of the trillion-dollar U.S. technology behemoths to report earnings from the first quarter, a period marred by elevated economic uncertainty that co... [4642 chars]",
        "url": "https://www.forbes.com/sites/dereksaul/2025/04/24/google-earnings-stock-soars-as-q1-results-shatter-expectations/",
        "image": "https://imageio.forbes.com/specials-images/imageserve/680a96df86d02b6fcdbb9023/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2025-04-24T20:06:00Z",
        "source": {
            "name": "Forbes",
            "url": "https://www.forbes.com"
        },
        "scrap_content": "Topline\nGoogle parent Alphabet reported first-quarter earnings Thursday afternoon, becoming the first of the trillion-dollar U.S. technology behemoths to report earnings from the first quarter, a period marred by elevated economic uncertainty that could weigh on the advertising-heavy Google.\nKey Facts\nAlphabet brought in $90.2 billion of revenue in Q1, topping consensus analyst estimates of $89.2 billion, and $2.81 diluted earnings per share ($34.5 billion net income), smashing forecasts of $2.01 EPS ($24.8 billion net income), according to FactSet.\nThat equates to 12% top line expansion from Q1 2024 and 49% bottom line growth year-over-year.\nAlphabet’s bread-and-butter Google search unit generated $50.7 billion in sales, compared to forecasts of $50.5 billion, and its artificial intelligence-heavy Google cloud brought in $12.3 billion, matching projections of $12.3 billion.\nGoogle stock jumped about 5% in after-hours trading immediately following the release, and its $169 afternoon share price has the tech firm on track to open at its highest level in four weeks.\nGoogle Mum On Tariffs\nIn the earnings call, Google CEO Sundar Pichai declined to “speculate about potential impacts” of tariffs, before adding the rollback of the de minimis tariff exemptions will “obviously cause a slight headwind to our ads business in 2025, primarily from” Asian retailers. Google is grappling with a “negative tariff ad spend impact,” according to Bank of America analyst Justin Post, specifically noting declining spending from Chinese discount retailers Temu and Shein as Trump’s more than 100% tariffs on Chinese imports stifle the flow of goods from the country to U.S. consumers. Still, Google has “relatively less” pressure from the choppy operating environment, according to Post. About 4% to 5% of Google’s revenues come from Chinese companies spending on U.S. advertising, according to Bernstein analyst Mark Shmulik, much less than the 7% to 8% exposure from Google’s top digital advertising rival, Facebook parent Meta.\nGoogle Stock Bounced Before Earnings As Nasdaq Jumped 2%\nShares of Google rose during Thursday’s regular session ahead of the release, gaining more than 2% to $161, the highest level in two weeks. The bounce came as stocks continued to rally on renewed hopes President Donald Trump would keep backing down from his most aggressive tariff plans, and the tech-heavy Nasdaq index rose nearly 3% on Thursday, heading to its third consecutive day of an at least 2% rally. That’s the first time the Nasdaq has risen by that much in three straight trading sessions since 2001, according to Bespoke Investment Group. Still, Google stock is down 16% year-to-date, slightly worse than the tech-heavy Nasdaq’s 12% decline as fears of an economic slowdown tied to Trump’s trade war broadly ate into investor confidence.\nCrucial Quote\n“If investing in US tech stocks was difficult right now, underwriting Google might be the closest thing to impossible,” Shmulik wrote Wednesday. Among the massive unknowns swirling around Google are recession concerns, tariff exposure, potential for generative AI to disrupt online search, a “library of regulatory overhangs” and a “potential lightning rod for international retaliation” against American entities, explained Shmulik.\nTangent\nAmong the “library” of regulatory hurdles facing Google include high-profile monopoly probes from U.S. prosecutors. A federal judge ruled last week Google maintains an illegal monopoly in advertising technology, and the Justice Department argued in an ongoing antitrust case the company should be forced to sell its Chrome web browser.\nKey Background\nGoogle is one of the six West Coast tech companies with market values of at least $1 trillion, joined by Apple, Microsoft, Nvidia, Amazon and Meta (those companies are often lumped together with Elon Musk’s Tesla to form the “magnificent seven”). Google was a key part of the massive tech stock rally as generative AI’s popularity spiked, as its share price more than doubled from the end of 2022 to 2024. But big tech has stalled on Wall Street as recession fears escalated, as Bloomberg’s magnificent seven index has declined about 20% in 2025.\nWhat To Watch For\nNext week, Amazon, Apple, Meta and Microsoft will all report earnings from 2025’s first three months. Tesla, the least valuable member of the magnificent seven, shared its Q1 report Tuesday, missing on both profit and revenue forecasts.",
        "custom_category": "USA"
    },
    {
        "title": "Trump tariffs draw warnings from big companies about price, revenue shifts",
        "description": "The impact from tariffs has so far been most immediately felt in financial markets, with stocks erasing nearly a year’s worth of gains amid fears of an economic growth slowdown or outright recession.",
        "content": "Create your free profile or log in to save this article\nCreate your free profile or log in to save this article\nThe impact from tariffs has so far been most immediately felt in financial markets, with stocks erasing nearly a year’s worth of gains ami... [7078 chars]",
        "url": "https://www.nbcnews.com/business/consumer/trump-tariffs-stores-companies-economists-warning-for-consumers-rcna202779",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-costco-groceries-grocery-shopping-vl-1053a-cf7faf.jpg",
        "publishedAt": "2025-04-24T20:03:09Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "scrap_content": "The impact from tariffs has so far been most immediately felt in financial markets, with stocks erasing nearly a year’s worth of gains amid fears of an economic growth slowdown or outright recession.\nNow, companies are starting to issue more concrete warnings about the impact that tariffs could have on their bottom lines — and on consumers.\nExecutives at PepsiCo, whose first-quarter earnings missed analysts’ projections, flagged supply chain disruptions and increased costs. The food and beverage giant also lowered its forecast for core constant currency earnings per share — a metric that accounts for foreign currency movements — citing the impact of tariffs and more value-conscious consumers.\n“As we look ahead, we expect more volatility and uncertainty, particularly related to global trade developments, which we expect will increase our supply chain costs,” CEO Ramon Laguarta said. “At the same time, consumer conditions in many markets remain subdued and similarly have an uncertain outlook.”\nProcter & Gamble’s quarterly earnings beat estimates, but sales slid below expectations. Executives also slashed their full-year forecast for core earnings per share, pointing to both weaker consumer demand and direct effects from President Donald Trump’s tariffs on the company’s operations.\n“There will likely be pricing — tariffs are inherently inflationary — but we’re also looking at sourcing options,” P&G CEO Jon Moeller told CNBC on Thursday morning.\nBoth P&G and PepsiCo raised prices in recent years amid record inflation, which lifted sales but ultimately flattened volumes as shoppers sought cheaper brand alternatives or snipped items from their budgets altogether.\nConsumers have increasingly turned to different forms of credit to stretch their cash flow amid rising prices, which could become even more of a crutch as tariffs creep into household purchases. Both credit card debt and late card payments hit record highs earlier this year, and the use of buy now, pay later loans for essential goods has skyrocketed.\nIn a survey of BNPL borrowers published by LendingTree on Wednesday, 41% of respondents said they paid late on at least one loan in the past 12 months, up from 34% a year ago. At least a fourth of borrowers now use the installment loans for groceries, up from 14%, the survey found.\nTrump’s trade war is also set to reach homebuyers soon. The CEO of homebuilder Pulte estimated tariffs could add as much as $5,000 on average to the sale price of new homes.\n“Whether it’s the volatility in the stock market, concerns about tariff-induced inflation, the fluctuation in interest rates or the growing talk of recession, demand in April has been more volatile and less predictable day-to-day,” Ryan Marshall told analysts.\nCNBC calculations show that approximately 75% of S&P 500 companies that have reported earnings through Thursday morning have mentioned some impact from tariffs in their most recent earnings.\nWhile Trump has suspended country-by-country tariffs until early July, he has imposed an across-the-board 10% duty on all imports and set duties as high as 145% in place for Chinese imports. He’s also slapped levies on certain products like steel and autos. Trump has signaled a softer stance this week as he seeks new trade deals — but so far, most countries have yet to take him up on any offers.\nAs a result, companies are wading through a sea of uncertainty and responding by telling investors to expect lower returns. Earnings from other consumer goods giants Thursday morning flashed looming concerns.\nTrump received warnings about the possibility of empty shelves after meeting with big-box retailers, according to an individual familiar with the White House policymaking. The executives said the impact could come as early as the July 4 shopping weekend.\nThe combination of ballooning supply chain costs and consumer pullback is what ultimately creates conditions for empty shelves, said Neil Saunders, managing director and retail analyst for GlobalData.\n“They have to make a decision as to whether it is worthwhile importing products from China to put on the shelves, because the prices might need to go up by so much that actually no consumer would really be interested,” Saunders said. “You might as well just say, forget it, we just won’t stock that product. That obviously does leave gaps on the shelf.”\nOcean container bookings from China to the United States have already declined more than 60%, according to data from Flexport, a logistics platform. Meanwhile, year-over-year trucking activity out of Los Angeles has declined 23%, rattling industry players in the logistics space.\n“Trucking volumes have collapsed to near pre-Covid levels,” Craig Fuller, founder of the publication FreightWaves, wrote Tuesday in a post on X. Citing the real-time freight data platform Sonar, he added that “with imports deteriorating, volumes are expected to fall by another 3-4% over the next month.”\nImports and exports accounted for more than 32% of freight tonnage moved domestically by truck as of 2023, federal data shows.\nThe Federal Reserve’s bi-quarterly Beige Book report, which surveys business conditions in its districts, found companies were already starting to adjust their pricing to account for tariffs, such as by adding surcharges for raising prices outright.\nOne area that is not yet seeing an impact is significant job losses. On Thursday, the Labor Department said weekly claims for unemployment assistance rose by just 6,000; the four-week moving average has shown no uptick. However, the Census Bureau’s biweekly Business Trends and Outlook Survey, a near-real-time measure of economic conditions, shows employment plans have continued to deteriorate.\nBob Elliott, CEO of Unlimited Funds investment group, said it may still take some time for the tariffs to start to be fully felt by consumers. He observed that the most intense demand shock that occurred prior to Covid, when President Jimmy Carter effectively asked Americans to stop shopping in order to curb soaring inflation in the 1970s, played out over about six months.\n“Anecdotally, producers are rushing to get production done before supply chains get wrecked,” Elliott said. “They’re trying to build up inventory and put themselves in a position so they have stock for a little while to absorb uncertainty of tariff environment.”\nBut if firms continue to be squeezed by higher costs, they are likely to begin lowering head counts. Guy Berger, director of economic research at the Burning Glass Institute labor consultancy, noted on X there’s been a surge in the share of firms planning to cut staff.\nIn a follow-up interview, FreightWaves’ Fuller said firms that handle logistics in Southern California — that region’s second largest employment sector — are likely going to start seeing workforce reductions given their exposure to Chinese import flows.\n“That’s going to really be the first time people become aware of how bad this is,” he said.",
        "custom_category": "USA"
    },
    {
        "title": "Trump's Ukraine peace plan gives Russia everything it wants. What is he trying to do?",
        "description": "Anyone who believes Putin would hold the line at Donbas hasn’t been paying attention.",
        "content": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\nIt’s no coincidence that President Donald Trump caved to the Kremlin’s demands for peace-through-surrender, and insisted that... [7909 chars]",
        "url": "https://slate.com/news-and-politics/2025/04/donald-trump-ukraine-russia-ceasefire-peace-plan.html",
        "image": "https://compote.slate.com/images/f0e27e65-88c3-41f3-b447-c17897490c5b.jpeg?crop=5182%2C3455%2Cx0%2Cy0&width=1560",
        "publishedAt": "2025-04-24T20:03:00Z",
        "source": {
            "name": "Slate",
            "url": "https://slate.com"
        },
        "scrap_content": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\nIt’s no coincidence that President Donald Trump caved to the Kremlin’s demands for peace-through-surrender, and insisted that Kyiv do the same, on the same day that Russia launched its deadliest attack on Ukrainian civilians in nearly a year.\nThen, one day later, deepening the delusions that he has long displayed about the war and his own power to affect its course, Trump called on Russian President Vladimir Putin to come to his senses and stop the killing.\n“Vladimir, STOP!” Trump posted on Truth Social. “I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing.”\nQuite aside from the bone-chilling familiarity (has Trump ever addressed Ukrainian President Volodymyr Zelensky by his first name?), there’s the presumption that the Kremlin leader has ever regretted blowing up civilian apartments or cared what Trump or anyone else might think about his murderousness. Trump had complained once before about Russian bombing—and then, just minutes later, he resumed blaming Ukrainians for starting the war (and, of course, Joe Biden for failing to stop it). Certainly the “peace plan” that Trump had just laid on the table should have signaled that the Russians can get away with whatever levels of violence they’d like to commit.\nTrump’s plan, according to European sources who have seen the one-page outline, calls for the following:\n• Russian and Ukrainian troops cease fire at their current positions on the battlefield. That means Moscow would control about 20 percent of Ukrainian territory, including the bulk of its four easternmost (and, before the war, industrial-rich) provinces in Donbas.\n• The U.S. also lifts all economic sanctions that it imposed on Russia as a result of the February 2022 invasion.\n• Russia is recognized as controlling Crimea (which the Soviet Union had handed Ukraine as a gift in 1954, until Putin reannexed the peninsula in 2014).\n• The U.S. is barred from stationing peacekeeping troops in Ukraine after the ceasefire, and Ukraine is forbidden from ever joining the West’s NATO military alliance.\n• In exchange for all this, Russia is obliged to concede … well, it seems, nothing. In fact, Russian spokesmen continue to demand that even a temporary ceasefire be preceded by a settlement of all the war’s “root causes,” which it blames entirely on Ukraine.\nAs one NATO official told a reporter from Politico when asked what he thought of Trump’s proposal: “Did Putin write this for him?” Another diplomat responded with an “exploding head” emoji.\nRussia’s state-controlled media certainly understood the gist of the deal, writing, “It’s practically a foregone conclusion the U.S. will pull out of Ukraine talks,” and “The unity of the West is gone. Geopolitically it’s no longer an alliance. Trumpism has destroyed the Atlantic consensus confidently and quickly.”\nIf that isn’t Trump’s aim as well, then one can only ask: What is his aim?\nA case could be made that some of these elements might be woven into a peace deal after both sides—Russia and Ukraine—are ready, or can both be pressured, to stop fighting. However, to accede to Russia’s position at the start of negotiations, with pressure only on Kyiv and no concessions from Moscow, amounts to Ukrainian surrender.\nShort of such pressure or desire, a ceasefire, under Trump’s terms, would simply give Putin’s army a chance to regroup, remobilize, and at least threaten to resume an offensive toward Kyiv. Anyone who believes Putin would hold the line at Donbas, leave Kyiv’s government in place, or refrain from threatening other former Soviet republics hasn’t been paying attention to what Putin himself has been saying about his goals the past year—e.g., that Ukraine is a fiction, its people don’t exist as a separate culture, and that Russia has a legitimate interest in not only carving out a sphere of influence but re-creating the old Russian empire in the space of what was once the Soviet Union’s Warsaw Pact.\nAs for NATO, shortly after the 2022 invasion, Zelensky said he had “cooled off” on membership in the West’s military alliance as a trade-off for peace. He repeated the point this week. However, on both occasions, and several times in the interim, he has demanded some form of security guarantees from Western countries, asked what they might entail in the absence of a NATO slot, and heard nothing in return.\nZelensky also pointed out that, whatever Crimea’s checkered history, Ukraine’s constitution prohibits just letting it go. Trump waved away the legal niceties. If the Ukrainians want Crimea, he asked, “Why didn’t they fight for it 11 years ago” when Russian troops stormed and annexed it “without a shot being fired?”\nThere are a few good answers to this question. First, it’s worth noting that Zelensky wasn’t president until 2019, five years after the Crimean annexation and the subsequent incursions into eastern Ukraine by Russian special forces. Second, at the time of the annexation, Ukraine’s army had pretty much dissolved. (It would begin to rebuild, with the help of U.S. assistance and some European armies, during the Donbas wars preceding the 2022 invasion.) Third, the annexation seemed, at the time, to be a one-off event—Putin’s attempt to halt Kyiv’s pro-democracy movements from making an alliance with any Western organizations, especially the European Union.\nAs Putin stretched his war into an invasion of all Ukraine, the terms and stakes of the war changed. Even in the early part of the war, many residents in Donbas and Crimea regarded themselves as Russians; in a hypothetical war, they might have sided with Moscow. But once Moscow started bombing their apartments, hospitals, and other targets, sympathies shifted. Ukrainians have fought over Donbas and Crimea in the battles since.\nIt is worth noting that, back in 2018, during his first term as president, Trump said the U.S. would not recognize Crimea as Russian territory. As a Republican active on the Senate Foreign Relations Committee, Marco Rubio also called for a similar policy. Now he has joined Trump on the switch to Moscow. So have most of the Republicans who were on Zelensky’s side not so long ago.\nRubio was scheduled to attend the next round of peace talks along with Trump’s all-purpose emissary and fellow real-estate tycoon Steve Witkoff. But when Zelensky rejected the offer out of hand, they copped out. There would still be a U.S. delegation, but one consisting of midlevel officials who would have—and be seen as having—little to no influence on the proceedings.\nThis is what Rubio meant when he said earlier this week that, if one side or the other rejected peace talks, the U.S. would just “move on.” Two things stand out in that still-somewhat-ambiguous comment. First, Trump has inveighed against only Zelensky for rejecting the specific deal. (To Putin, who not only rejected it but killed dozens of Ukrainian civilians as a sign of showing what he thought of it, Trump sent only a beggar’s plea—“Vladimir, STOP!”)\nSecond, will Trump now “move on” by taking a merely passive stance toward the war, turning his attention to diplomatic possibilities elsewhere? Or will he take further steps toward a geostrategic alliance with Moscow, in the course of which he will likely halt further military and intelligence assistance to Ukraine, possibly letting Kyiv fall and the U.S.-European alliance—which is most challengingly focused on the fate of Ukraine—crumble?\nThis is probably a distinction without a difference. Trump’s favoritism toward Russia has been clear for a long time. His hostility toward Ukraine has taken on a darker intensity. The events of the past 48 hours may have hardened these trends irreversibly, making the days of even-handedness—much less a return toward alliance with Ukraine—impossible.",
        "custom_category": "USA"
    },
    {
        "title": "Inside the Vatican conclave battle to elect a more 'traditional'",
        "description": "The push for a more traditional pontiff – one who speaks less off the cuff and promotes fewer disruptive initiatives than Pope Francis did – might come down to a matter of religious aesthetics and ongoing ease with local parishioners.",
        "content": "As cardinals flock to Rome for the papal conclave to decide the next pope, a movement is underway to bring in a successor who will be more traditional than Pope Francis.\nA common belief among people of influence in the Vatican is that Francis, who di... [5981 chars]",
        "url": "https://nypost.com/2025/04/24/world-news/inside-the-vatican-conclave-battle-to-elect-a-more-traditional-but-not-necessarily-conservative-pope/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2025/04/newspress-collage-agr6ruxmg-1745525983901.jpg?quality=75&strip=all&1745511712&w=1024",
        "publishedAt": "2025-04-24T19:55:00Z",
        "source": {
            "name": "New York Post",
            "url": "https://nypost.com"
        },
        "scrap_content": "Advertisement",
        "custom_category": "USA"
    },
    {
        "title": "Shannon Sharpe stepping aside from ESPN in wake of sexual assault lawsuit",
        "description": "Football great Shannon Sharpe said Thursday that he will \"step aside temporarily\" from his duties at ESPN in the wake of a $50 million lawsuit accusing him of rape.",
        "content": "Football great Shannon Sharpe said Thursday that he will \"step aside temporarily\" from his duties at ESPN in the wake of a $50 million lawsuit accusing him of rape.\nThe 56-year-old former Denver Broncos tight end said he needs time away from the stud... [1873 chars]",
        "url": "https://www.nbcnews.com/news/us-news/shannon-sharpe-stepping-espn-wake-sexual-assault-lawsuit-rcna202887",
        "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Shannon-Sharpe-ch-1356-046871.jpg",
        "publishedAt": "2025-04-24T19:46:00Z",
        "source": {
            "name": "NBC News",
            "url": "https://www.nbcnews.com"
        },
        "scrap_content": "Football great Shannon Sharpe said Thursday that he will \"step aside temporarily\" from his duties at ESPN in the wake of a $50 million lawsuit accusing him of rape.\nThe 56-year-old former Denver Broncos tight end said he needs time away from the studios to fight allegations that he called \"false and disruptive.\"\n\"At this juncture I am electing to step aside temporarily from my ESPN duties,\" he said in a statement.\nThe first NFL exhibition game is set for July 31, with the regular season likely to kick off Thursday, Sept. 4. Sharpe hopes to be back behind the mic by then.\n\"I will be devoting this time to my family, and responding and dealing with these false and disruptive allegations set against me,\" he said. \"I plan to return to ESPN at the start of the NFL preseason.\"\nAn ESPN representative said that Sharpe, a frequent panelist on the show \"First Take,\" is right to take a break from the cable sports outfit.\n“This is a serious situation, and we agree with Shannon’s decision to step away,\" the ESPN spokesperson said.\nA woman filed a lawsuit in Nevada on Sunday, accusing Sharpe of raping her twice in Las Vegas in October and one more time in January, according to the suit.\nThe woman said she was 19 years old in 2023 when she first met Sharpe in a Los Angeles gym, leading to a “rocky consensual relationship” of nearly two years in which he was frequently “aggressive” and raped her, according to the Clark County civil complaint.\nSharpe has denied all allegations.\nA representative for the plaintiff could not be immediately reached for comment Thursday.\nSince the end of his playing days, Sharpe has had a long career in the studio as a football analyst for CBS, Fox Sports and ESPN.\nAnd in more recent years, he has launched a popular podcast, \"Club Shay Shay.\"\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 1-800-656-4673. The hotline, run by the Rape, Abuse, & Incest National Network (RAINN), can put you in contact with your local rape crisis center. You can also access RAINN’s online chat service at https://www.rainn.org/get-help.",
        "custom_category": "USA"
    },
    {
        "title": "Trump grants interview to The Atlantic's Jeffrey Goldberg despite Signal chat bombshell, past criticism",
        "description": "After years of bashing Jeffrey Goldberg for his coverage of his administration, President Donald Trump said he will sit down with the editor of \"The Atlantic.\"",
        "content": "He has attacked The Atlantic editor for what he claims are false stories.\nPresident Donald Trump waits for the arrival of Norway's Prime Minister Jonas Gahr Store to the White House on April 24, 2025. The Atlantic editor-in-chief Jeffrey Goldberg att... [5115 chars]",
        "url": "https://abcnews.go.com/Politics/trump-meet-atlantics-jeffrey-goldberg-interview-despite-signal/story?id=121128726",
        "image": "https://i.abcnewsfe.com/a/31a66d54-6875-45f5-aa3c-180c1e80ce22/trump-atlantic-gty-er-250424_1745512107009_hpMain_16x9.jpg?w=1600",
        "publishedAt": "2025-04-24T19:35:48Z",
        "source": {
            "name": "ABC News",
            "url": "https://abcnews.go.com"
        },
        "scrap_content": "Trump grants interview to The Atlantic's Jeffrey Goldberg despite Signal chat bombshell, past criticism\nHe has attacked The Atlantic editor for what he claims are false stories.\nFor years, President Donald Trump has blasted politically damaging reporting by The Atlantic Editor-in-Chief Jeffrey Goldberg as fake, made-up.\nHis most recent criticism has been over Goldberg's bombshell story about a Signal chat he was accidentally invited to, one that included top members of Trump's national security team, conversing about an impending military attack on Houthi terrorists in Yemen.\nNow, in a surprise twist, Trump said he would speak face-to-face with Goldberg on Thursday after claiming on Truth Social that Goldberg, along with The Atlantic writers Michael Scherer and Ashley Parker, would sit down with him for an interview.\n\"The story they are writing, they have told my representatives, will be entitled, \"The Most Consequential President of this Century,\" he said.\nGoldberg and The Atlantic have not commented about Trump's post or the alleged meeting as of Thursday afternoon.\nAlthough the president claimed Goldberg was \"responsible for many fictional stories about me,\" he said he is looking forward to the meeting.\n\"I am doing this interview out of curiosity, and as a competition with myself, just to see if it's possible for The Atlantic to be 'truthful,'\" Trump posted. \"Are they capable of writing a fair story on 'TRUMP'? The way I look at it, what can be so bad.\"\nGoldberg and Trump have had a contentious back-and-forth going since the president's 2016 campaign, when the journalist criticized Trump's rhetoric.\n\"At the very least, he traffics in racial invective knowingly. To me, that's a threshold question. If you do that and if you know what you're doing then, yes, you're a racist. I think he's a racist,\" he said in a 2016 NPR interview.\nTrump criticized The Atlantic's coverage of his campaign and first term, but things heated up in 2020 after Goldberg wrote an article that described a 2018 incident in which president reportedly refused to visit an American cemetery in France where World War I service members were buried.\n\"Why should I go to that cemetery? It's filled with losers,\" Trump told his advisers, according to the article. It also said Trump called fallen Marines \"suckers.\"\nThe president heatedly denied he had used those terms on what was then Twitter and went after Goldberg's sources. Retired Marine Gen. John Kelly, Trump's former chief of staff, later confirmed Goldberg's account in an interview with CNN.\nIn Trump's Thursday post, he brought up that story and claimed it was a \"made-up HOAX.\"\nGoldberg became the target of the president's ire again last month after he revealed he was inadvertently invited to the Signal chat that consisted of several top U.S. officials, including Defense Secretary Pete Hegseth and Vice President JD Vance, in which they discussed plans for the March 15 military attack against Houthis in Yemen ahead of the airstrike occurring.\nTrump and White House officials slammed Goldberg, claiming his reporting was biased.\n\"He is, as you know, is a sleaze bag, but at the highest level. His magazine is failing,\" Trump said of Goldberg on March 26 during an appearance on the \"VINCE Show\" podcast.\nGoldberg has repeatedly defended his reporting on the scandal.\n\"They've decided to blame the guy who they invited into the conversation. It's a little bit strange behavior,\" he told ABC News in March. \"Honestly, I don't know why they're acting like this except to think that they're -- they know how serious a national security breach it is. And so they have to deflect it and push it onto the guy, again, they invited into the chat -- namely me.\"",
        "custom_category": "USA"
    }
]