[
    {
        "title": "Juventus Goes To The Moon And Launches New Capsule Collection",
        "description": "Juventus is launching its latest space inspired merchandise capsule collection. The new capsule focuses on the club's lunar mission with Lunar Outpost and innovation.",
        "content": "TURIN, ITALY - NOVEMBER 09: General view of NASA light show prior tothe Serie A match between ... More Juventus and Torino at Juventus Stadium on November 09, 2024 in Turin, Italy. (Photo by Chris Ricco - Juventus FC/Juventus FC via Getty Images) Juv... [6404 chars]",
        "url": "https://www.forbes.com/sites/vitascarosella/2025/04/25/juventus-goes-to-the-moon-and-launches-new-capsule-collection/",
        "image": "https://imageio.forbes.com/specials-images/imageserve/680bc908fd664890cbf7f68e/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2025-04-25T17:47:18Z",
        "source": {
            "name": "Forbes",
            "url": "https://www.forbes.com"
        },
        "scrap_content": "Juventus has conquered Italy 36 times, been club champion of Europe and the world twice, and is now expanding its footprint to space. Earlier this season, the Old Lady became the first soccer club to participate in a lunar mission. Juve partnered with Colorado space robotics firm Lunar Outpost, on its Lunar Voyage 1 mission. To celebrate its hand in space exploration, the club is dropping a new limited-edition Moon Capsule Collection alongside Adidas and Lunar Outpost.\nOn the field, Juventus is failing to live up to its exceedingly high standards. Igor Tudor’s team is fifth in Serie A, one point outside the UEFA Champions League places with five games to go. Juventus will need to win its last five matches and hope for one of its opponents to drop points to salvage its season. However, according to Gianmarco Pino, Head of Brand at Juventus, if the club has learned anything from its space collaboration, it is that it should be bold and attempt the impossible. So, fans can expect Juve to push hard for the final European position and to continue innovating off the field.\nThe Juventus Moon Capsule Collection\nJuventus’s entrepreneurial spirit has been the foundation of the club’s youthful mentality and success throughout its 127-year history. As Juve evolves from soccer club into sporting entity and lifestyle brand, it aims to enhance its commitment to innovation and excellence on and off the pitch.\nWith that in mind, the club continues to come up with novel ways to appeal to new fans and link Juventus to like-minded organizations. This season has been all about outer space. Together with Adidas, Juventus has launched several rounds of NASA and space-inspired merchandise. Pino said initial fan feedback was “really good,” so the club continued down that road. The partnership with Lunar Outpost was a natural evolution from Juve’s space-themed social media and merchandise campaign.\nSpeaking about the collaboration, Mike Armstrong, Chief Marketing Officer at Juventus, said, “Juventus has always been driven by a spirit of innovation and discovery, and our partnership with Lunar Outpost extends that vision. As the first football club to be part of a lunar mission, we are proud to support the continued exploration of space. This is a testament to our relentless pursuit to break new grounds in the world of sport.”\nTo celebrate the partnership, Juventus is dropping its latest space capsule collection. The collection had a soft launch in late March, with first team players Randal Kolo Muani, Samuel Mbangula, Alisha Lehman, and American Tim Weah participating in a space-themed photo shoot. According to Pino, the merchandise has sold well so far without much social media push.\nThe capsule collection is comprised of four items: a white track top, a short-sleeved and long-sleeved pre-match jersey, and an orange track top. At first glance, the white track top looks like a standard issue track top. It uses classic Juventus colors—white and black—and has the Juve and Adidas logos. On the back, however, there is an arrow-shaped patch inside of which there is a space shuttle ascending to the Moon. The jacket also has the club motto Fino Alla Fine printed on it to demonstrate the club’s constant pursuit of excellence.\nThe orange track top’s design is similar to the white version. It has the same arrow-shaped patch on the back and includes a shoulder lunar mission badge that shows the Lunar Outpost Mobile Autonomous Prospecting Platform (MAPP) rover on the Moon. The orange body and blue sleeves are supposed to resemble a modern space suit.\nThe pre-match jersey, which comes in both short and long sleeves, has a black body and a lunar-eclipse polkadot-esque pattern. The Lunar Outpost logo is displayed in place of a normal shirt sponsor. The pre-match top also has both the shoulder and back space-themed badges.\nThe official launch of the capsule takes place this weekend, April 24-26, alongside Juventus Football Club’s home match against Monza FC. The club will do a stadium takeover at the Allianz Stadium, converting it into a space-themed arena complete with activations for fans. In the words of Pino, the stadium takeover will show, “we landed on the moon and now we are traveling back to Earth to land in the stadium.”\nThe Mission\nThe Lunar Voyage 1 mission launched from Cape Canaveral, Florida, on February 26, 2025. It did 38 orbits around the Moon before landing on the South Pole on March 6. The mission’s bold objectives were to land on and explore the Moon’s relatively hostile Southern Pole during and after the lunar eclipse. Following that, the team would gather space materials for sale on return to Earth using its MAPP rover.\nUnfortunately, after orbiting the Moon nearly forty times, the lander didn’t land properly, so no space materials were obtained. Still, the rover communicated with the Lunar Outpost scientists for several days, allowing them to gain valuable data that will help pave the way for future sustainable space exploration.\nWhile the connection between soccer and space exploration may seem unclear, Gianmarco Pino says, “they share common objectives, such as breaking boundaries and looking forward.” From Juve’s perspective, the collaboration allows the club to show its continued desire to innovate. The lunar mission also aligned with Juventus’s ESG strategy, as it seeks to further eco-friendly space exploration.\nLunar Outpost Founder and CEO Justin Cyrus said, “Partnering with Juventus allows us to engage new audiences in the excitement of space travel. Together, we are inspiring curiosity about what’s possible beyond Earth, while also exploring sustainable solutions that could benefit life on our planet.”\nPino added that the two entities are in talks about how they can continue collaborating in the near future. Lunar Outpost is planning a second and third Lunar Voyage, and Juventus is keen to lend its expertise and brand to them where appropriate. Perhaps there are more otherworldly endeavors in Juventus’s future.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "YouTube Is Adding AI Summaries for Things to Do",
        "description": "YouTube is in the early stages of rolling out of testing AI Overviews in search results when users ask about things to do.",
        "content": "YouTube is obviously a major marketing channel for travel brands. Adding AI Overview in 'things to do' first, with other travel verticals to come, may keep users engaged within the Google ecosystem.\nYouTube is in the early stages of rolling out AI Ov... [1620 chars]",
        "url": "https://skift.com/2025/04/25/youtube-is-adding-ai-summaries-for-things-to-do/",
        "image": "https://skift.com/wp-content/uploads/2023/07/pexels-editz-central-editors-17117853-scaled-e1690273158715.jpg",
        "publishedAt": "2025-04-25T17:42:11Z",
        "source": {
            "name": "Skift",
            "url": "https://skift.com"
        },
        "scrap_content": "Skift Take\nYouTube is obviously a major marketing channel for travel brands. Adding AI Overview in 'things to do' first, with other travel verticals to come, may keep users engaged within the Google ecosystem.\nYouTube is in the early stages of rolling out AI Overviews in search results when users ask about things to do.\nFor example, if someone asks about \"museums to visit in San Francisco,\" they would see a video results carousel.\n\"This new feature will use AI to highlight clips from videos that will be most helpful for your search query, providing another way to discover content when searching on YouTube as well as discover topics and information related to your search query,\" YouTube announced in a Google support thread.\nAre Hotels in the Plans?\nThese new video results, powered by AI, were also being rolled out for shopping products such as noise cancelling headphones.\nIt's not hard to imagine YouTube eventually introducing the carousel for hotels and other travel verticals, as well.\nA YouTube products spokesperson confirmed the changes, characterizing them as being in a \"small experiment phase.\" They are being introduced currently \"to a small number of YouTube premium members in the U.S. for some English search queries,\" according to the announcement.\nGoogle's AI Overviews, which provide answers to search queries rather than triggering traditional links to other websites, have reduced traffic to external websites, according to Search Engine Land. The publication asked: \"If this experiment is rolled out, could YouTube’s version of AI Overviews end up reducing visibility and video views for brands and creators?\"\nWould it likewise reduce traffic to experiences operators and online travel agencies like Viator, GetYourGuide, and Booking.com?\nGetYourGuide declined to comment about the YouTube AI overviews. Viator didn't respond to a request or comment.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Spice Up Your Life With Buy 1 Get 2 Free on Apple Watch Bands in Mystery Colors",
        "description": "Whether you're new to the Apple Watch or you're an aficionado, this is a great chance to flesh out your band collection.",
        "content": "We think that one of the best Apple Watch features is the way you can quickly and easily change up your look by adding a new band. And one of the best Apple Watch deals we've seen in a while gives you the chance to add three new bands to your collect... [1570 chars]",
        "url": "https://www.cnet.com/tech/spice-up-your-life-with-buy-1-get-2-free-on-apple-watch-bands-in-mystery-colors/",
        "image": "https://www.cnet.com/a/img/resize/5474f023b273252e389f6ff12dcc18cbb9b4f330/hub/2025/04/25/0744406f-a6e5-4c36-99c4-c91d7e172d71/apple-watch-bands.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2025-04-25T17:25:00Z",
        "source": {
            "name": "CNET",
            "url": "https://www.cnet.com"
        },
        "scrap_content": "We think that one of the best Apple Watch features is the way you can quickly and easily change up your look by adding a new band. And one of the best Apple Watch deals we've seen in a while gives you the chance to add three new bands to your collection for just $20. You'll need to be quick, though, because this offer ends on May 2.\nThe offer covers two different types of bands and two different deals. If you choose the Apple Watch solo loop, you'll pay $20 for one band and then get two free. Alternatively, you can pay $30 for an Apple Watch braided solo loop and get an extra one thrown in for free. There's also a surprise in every box since you don't get to choose the colors. However, Woot does say that there will be no duplicates, so you can be sure of getting some variety in your order.\nHey, did you know? CNET Deals texts are free, easy and save you money.\nBoth of these bands are a great option for working out or just going about your business, but you'll need to make sure you order the right size for your wrist. Neither of them can be adjusted, so keep that in mind when ordering.\nThe solo loop is made from liquid silicone rubber and features a stretchy design that's comfortable to wear for hours on end. The solo loop is the fancier of the two and is created by weaving 16,000 recycled polyester yarn filaments around ultrathin silicone threads. This band is even comfier than the solo loop, and it's one of our favorites. It'd normally sell for $99, so this is a real bargain, to say the least.\nWhy this deal matters\nThis is a great chance to pick up multiple official Apple bands at prices that would make even a third-party eBay special seem ridiculous. Just keep in mind that Woot's sales can end sooner than the advertised date if stocks run dry, and we expect these bands to be very popular.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "WD’s 2TB SSD for Xbox is $50 off and the M4 MacBook Air is just $899",
        "description": "Western Digital’s 2TB C50 Expansion Card for the Xbox Series X / S is on sale for $50 off. Apple’s M4 MacBook Air is also down to just $899 at Amazon.",
        "content": "is a deputy editor with 18 years of experience writing and editing product reviews, gadgets and business news. Previously, he was a deputy editor covering technology companies at CNBC.\nMaybe, like me, you bought the Xbox Series S with 512GB of storag... [2703 chars]",
        "url": "https://www.theverge.com/tech/656169/wd-black-c50-xbox-storage-card-m4-macbook-air-deal-sale",
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25739519/wd_black_c50.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
        "publishedAt": "2025-04-25T17:11:46Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "scrap_content": "Maybe, like me, you bought the Xbox Series S with 512GB of storage and realized, after installing Call of Duty: Black Ops 6, that you don’t have much (or any) space left for any other games. And maybe, like me, you had to hunt for another drive so you could install other games to play.\nIf you’re still in that boat, you might want to consider Western Digital’s 2TB WD_Black NVMe solid state drive. It’s currently on sale at Amazon for an all-time low of $179.99 ($50 off), or about 22 percent off the standard price, and will provide you with plenty of additional storage to work with. To put the price in perspective, it’s only $30 more than the 1TB version, which isn’t on sale. WD is also one of two manufacturers I’m aware of that make these easy plug-in cards — the other is Seagate.\nWestern Digital’s storage expansion cards for Xbox Series X / S consoles are speedy, plug-and-play cards that match the performance of the consoles’ onboard SSDs. They offer a slightly lower-cost alternative to Seagate’s expansion cards, which were the only game in town for years.\nThere’s no fiddling around with screws or anything to get it to work, either. Just pop it into the back of your Xbox Series S / X, and bam, you’re good to go. Plug and play at its finest, baby.\nBut let’s pivot to another good deal real quick.\nAmazon and B&H Photo are also selling Apple’s brand-new M4 MacBook Air, which just launched in March, starting at $899 (its best price to date). That’s $100 off Apple’s starting price of $999, which itself is already $100 cheaper than the entry-level price of the M3 model last year.\nAnd, with the M4, you get 256GB of starting storage instead of 128GB, which is probably fine for most folks who don’t need a lot of local storage. Like me, for example. I’m using an M2 MacBook Air for work, and I only have 82GB used.\nThe latest M4 model also has a better 12-megapixel Center Stage camera that will follow your face around while you’re on camera (better said: it’ll keep you in frame) and 16GB of RAM. The design is unchanged from last year, which means you’re still getting just a MagSafe charger and two USB-C ports. But the update to M4 allows you to add two external monitors while also leaving the display open, for a total of three running screens. Good for multitasking.\nIt’s a MacBook Air. It’s the best MacBook for most people. You really can’t go wrong here.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "The Kindle Colorsoft brings books to life in vivid color, and it's $55 off during Amazon's Book Sale",
        "description": "The new Amazon Kindle Colorsoft brings a smooth color display to your favorite books, and its bright screen looks great in direct sunlight.",
        "content": "ZDNET's key takeaways The Kindle Colorsoft is normally $279, but is on sale at Amazon.\nIt has a bright display (even in direct sunlight), customizable color settings, and zippy performance while browsing titles and turning pages.\nIt could be a bit la... [5222 chars]",
        "url": "https://www.zdnet.com/article/the-kindle-colorsoft-brings-books-to-life-in-vivid-color-and-its-55-off-during-amazons-book-sale/",
        "image": "https://www.zdnet.com/a/img/resize/75f51115f9f50fbec6f56fc30bc51b76a1e471bf/2024/10/28/9df8d018-4cff-4099-b4fe-d4f08b940ab3/colorsoft-2.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2025-04-25T17:02:00Z",
        "source": {
            "name": "ZDNET",
            "url": "https://www.zdnet.com"
        },
        "scrap_content": "Tech",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Microsoft rolls Windows Recall out to the public nearly a year after announcing it",
        "description": "The improved Recall still tries to record everything you do on your PC.",
        "content": "Nearly a year after announcing the feature, Microsoft is finally ready to roll the controversial Windows Recall feature out to the general public, the company announced today on its Windows Experience Blog.\nOnly available on Copilot+ PCs, a subset of... [1323 chars]",
        "url": "https://arstechnica.com/gadgets/2025/04/microsoft-rolls-windows-recall-out-to-the-public-nearly-a-year-after-announcing-it/",
        "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/win11-bloom-rainbow-1152x648.jpeg",
        "publishedAt": "2025-04-25T17:00:48Z",
        "source": {
            "name": "Ars Technica",
            "url": "https://arstechnica.com"
        },
        "scrap_content": "Nearly a year after announcing the feature, Microsoft is finally ready to roll the controversial Windows Recall feature out to the general public, the company announced today on its Windows Experience Blog.\nOnly available on Copilot+ PCs, a subset of Windows 11 systems sold within the last year or so, Recall takes continuous screenshots of everything you do on your PC, saving them, scraping text from them, and saving it all in a searchable database. This obviously has major security and privacy implications—anyone who can get access to your Recall database can see nearly everything you've done on your PC—which is why Microsoft's initial rollout attempt was such a mess.\nRecall's long road to release involved a rushed initial almost-launch, harsh criticism of its (then mostly nonexistent) security protections, multiple delays, a major under-the-hood overhaul, and five months of testing in Microsoft's Windows Insider beta program. Microsoft signaled that Recall was nearly ready for release two weeks ago when it came to the near-final Release Preview channel.\nTesting of the new version of Recall, both by Ars and other security researchers, found that the company had addressed many of the substantive complaints about Recall's security and added better automated content filtering to help keep the feature from storing some kinds of sensitive information (though this filtering is still inconsistent). But most significantly, Microsoft has made Recall a feature you must opt in to using rather than opt out of using, and it's possible to remove it completely.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Microsoft Is Releasing Windows Recall Tool After Security Fixes",
        "description": "Microsoft Corp. is rolling out its controversial Recall feature to high-end Windows PCs, betting a record of what users do on their computers will be seen as more of a benefit than a privacy risk.",
        "content": "Microsoft Corp. is rolling out its controversial Recall feature to high-end Windows PCs, betting a record of what users do on their computers will be seen as more of a benefit than a privacy risk.\nThe feature, which takes searchable snapshots of a PC... [310 chars]",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/microsoft-is-releasing-windows-recall-tool-after-security-fixes",
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKQHbNN4ujw0/v0/1200x800.jpg",
        "publishedAt": "2025-04-25T17:00:00Z",
        "source": {
            "name": "Bloomberg.com",
            "url": "https://www.bloomberg.com"
        },
        "scrap_content": null,
        "custom_category": "Tech&AI"
    },
    {
        "title": "Google is killing software support for early Nest Thermostats",
        "description": "Software support for the original and second-gen Nest Learning Thermostat devices will end on October 25th, leaving customers unable to control them from a phone.",
        "content": "is a senior reviewer who has worked at The Verge since its founding in 2011. His coverage areas include audio (Sonos, Apple, Bose, Sony, etc.), home theater, smartphones, photography, and more.\nGoogle has just announced that it’s ending software upda... [2005 chars]",
        "url": "https://www.theverge.com/news/656332/google-ending-support-nest-thermostats",
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/VRG_3434-1.webp?quality=90&strip=all&crop=0,10.44211751018,100,79.115764979639",
        "publishedAt": "2025-04-25T17:00:00Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "scrap_content": "Google has just announced that it’s ending software updates for the first-generation Nest Learning Thermostat, released in 2011, and the second-gen model that came a year later. This decision also affects the European Nest Learning Thermostat from 2014. “You will no longer be able to control them remotely from your phone or with\nGoogle Assistant, but can still adjust the temperature and modify schedules directly on the thermostat,“ the company wrote in a Friday blog post.\nThe cutoff date for software updates and general support within the Google Home and Nest apps is October 25th.\nNo more controlling these “smart” thermostats from a phone.\nIn other significant news, Google is flatly stating that it has no plans to release additional Nest thermostats in Europe. “Heating systems in Europe are unique and have a variety of hardware and software requirements that make it challenging to build for the diverse set of homes,“ the company said. “The Nest Learning Thermostat (3rd gen, 2015) and Nest Thermostat E (2018) will continue to be sold in Europe while current supplies last.”\nLosing the ability to control these smart thermostats from a phone will inevitably frustrate customers who’ve had Nest hardware in their home for many years now. Google’s not breaking their core functionality, but a lot of the appeal and convenience will disappear as software support winds down. The early Nest Learning Thermostats can at least be used locally without Wi-Fi, which isn’t true of newer models.\nStill, this type of phase-out is a very real fear tied to smart home devices as companies put screens into more and more appliances. Is 14 years a reasonable lifespan for the these gadgets before their smarts fade away? There’s no indication that Google plans to open source the hardware.\nIn a clear attempt to ease customer anger, Google is offering a $130 discount on the fourth-gen Nest Learning Thermostat in the US, $160 off the same device in Canada, and 50 percent savings on the Tado Smart Thermostat X in Europe since the Nest lineup will soon be gone.\nThe original Nest thermostats were released while the company was an independent brand under the leadership of former Apple executive Tony Fadell. Google acquired Nest in 2014 for $3.2 billion.",
        "custom_category": "Tech&AI"
    },
    {
        "title": "I retested Microsoft Copilot's AI coding skills in 2025 and now it's got serious game",
        "description": "Copilot's early coding days were all swing and miss. But now? It's hitting line drives and running the bases with confidence. See for yourself.",
        "content": "Microsoft\nThere's been a ton of buzz about how AIs can help programming, but in the first year or two of generative AI, much of that was hype. Microsoft ran huge events celebrating how Copilot could help you code, but when I put it to the test in Apr... [6875 chars]",
        "url": "https://www.zdnet.com/article/i-retested-microsoft-copilots-ai-coding-skills-and-now-its-got-serious-game/",
        "image": "https://www.zdnet.com/a/img/resize/414158a97a89f9ebbe69585647b4b6e8bb36cae8/2025/04/25/7c5adde9-44c0-4022-82dc-b5ebd3fb3bd3/copilot.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2025-04-25T16:52:00Z",
        "source": {
            "name": "ZDNET",
            "url": "https://www.zdnet.com"
        },
        "scrap_content": "Innovation",
        "custom_category": "Tech&AI"
    },
    {
        "title": "Google Expands AI and ‘Generative Ghosts’ Are Coming",
        "description": "From Tesla’s CEO shifting focus amid earnings headwinds to Google’s AI advancements, here are the top stories in AI this week.",
        "content": "From Tesla’s CEO shifting focus amid earnings headwinds to Google’s artificial intelligence (AI) advancements and a glimpse into digital immortality, here are the top stories in AI this week.\nTesla’s Q1 Earnings Fall Short\nTesla CEO Elon Musk said th... [5236 chars]",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/this-week-in-ai-google-expands-ai-and-generative-ghosts-are-coming/",
        "image": "https://www.pymnts.com/wp-content/uploads/2024/09/Google-AI-Gemini-1.jpg",
        "publishedAt": "2025-04-25T16:40:51Z",
        "source": {
            "name": "PYMNTS.com",
            "url": "https://www.pymnts.com"
        },
        "scrap_content": "From Tesla’s CEO shifting focus amid earnings headwinds to Google’s artificial intelligence (AI) advancements and a glimpse into digital immortality, here are the top stories in AI this week.\nTesla CEO Elon Musk said that starting in May, he would scale back his involvement in the Department of Government Efficiency (DOGE) to one or two days per week and turn most of his attention to the car maker.\nThe comments come as Tesla’s earnings and revenue for the first quarter fell far short of Wall Street’s consensus expectations.\nMusk said DOGE’s work is “mostly done,” adding that he plans to still oversee the group’s efforts throughout Trump’s term to ensure “waste and fraud” does not return.\nMusk faced criticism for not paying enough attention to Tesla as he ramped up his DOGE and political activities. His alliance with President Trump became controversial, depressing Tesla demand and igniting acts of vandalism against some Tesla dealerships.\n“There’s been some blowback for time that I’ve been spending in government with … DOGE,” Musk said in Tesla’s Q1 earnings call.\nRead more: Tesla Q1 Falls Far Short, Musk to Scale Back DOGE Involvement\nAlphabet, Google’s parent company, reported stronger-than-expected earnings and revenue for the first quarter, driven by a nearly 10% increase in its core search business and a 28% surge in Google Cloud sales.\nCEO Sundar Pichai, speaking on the company’s earnings call, highlighted the company’s progress in AI, pointing to the adoption of Gemini 2.5 — Google’s most advanced large language model to date. He also said AI Overviews has reached 1.5 billion users per month.\nHowever, the company acknowledged potential challenges ahead, including macroeconomic uncertainty and the looming end of the “de minimis” rule, which currently exempts imports $800 or under from duties.\nPichai also said Alphabet is weighing several options for Waymo, its autonomous vehicle division that has launched paid rides to the public in Silicon Valley, Austin and Phoenix, with Atlanta and Miami coming up.\nOne option is “personal ownership” of the Waymo vehicles, he said.\nRead more: Gemini 2.5 and AI Overviews Mark Google’s Biggest AI Push Yet\nAWS and Microsoft are scaling back plans for data center development, although both hyperscalers said it is part of the ebb and flow of such multi-year projects.\nWells Fargo analysts cited several industry sources as saying that AWS has “paused a portion of its leading discussions” on colocated data centers, particularly those abroad.\n“It’s not clear the magnitude of the pause, but the positioning is similar to what we’ve heard recently from Microsoft,” wrote Wells Fargo analyst Eric Luebchow in the Monday (April 21) note.\nLast week, Noelle Walsh, president of Microsoft Cloud Operations and Innovation, disclosed in a LinkedIn post that the software giant is “slowing or pausing some early-stage projects” as it refines the buildout of cloud capacity relative to customer demand.\nRead more: AWS, Microsoft Slow Down Data Center Deployments\nA growing number of companies are developing AI tools that create digital twins of the deceased — virtual versions that can speak, interact and preserve memories long after someone has passed away.\nAmong the companies pioneering this space are DeepBrain AI’s Re;memory, HereAfter, Character.ai, StoryFile, Project December and MIT’s Augmented Eternity. These platforms aim to replicate voices, facial expressions and even personality traits of the departed, allowing loved ones to engage in simulated conversations and relive shared memories.\nBut researchers from Google DeepMind and the University of Colorado at Boulder suggest a more advanced concept: “generative ghosts.”\nUnlike static AI twins, generative ghosts are dynamic — they can create new conversations, respond to current events and evolve with time.\nIt also opens up a host of legal issues: Would a generative ghost have the same rights as the human? Can it act legally on their behalf? What are the implications?\nThe researchers predicted that one day soon, many people will be creating their own generative ghosts as part of their estate planning.\nRead more: Forever Online: ‘Generative Ghosts’ Live in the AI Afterlife\nMore people are turning to AI chatbots like OpenAI’s ChatGPT for mental health support — but a new study suggests that the chatbot itself may need therapy, too.\nResearchers from Yale, the Max Planck Institute and other institutions found ChatGPT can exhibit signs of “anxiety” when exposed to traumatic prompts. Much like humans, the AI’s responses can become more biased and erratic under stress, raising concerns about its use in therapy.\nThis volatility poses potential risks in clinical settings, where users may already be vulnerable emotionally. The study looked only at ChatGPT, which holds a 60% market share among AI chatbots.\nThe good news is that ChatGPT, like people, can benefit from relaxation techniques. Researchers discovered that mindfulness techniques helped reduce the chatbot’s stress levels. Still, it didn’t fully return to its original, unstressed baseline.\nRead more: Using ChatGPT for Therapy? The AI Chatbot Can Get Anxiety, Too",
        "custom_category": "Tech&AI"
    }
]