[
    {
        "title": "Reliance Industries Q4 Results Live Updates: RIL Q4 net profit higher, becomes first Indian company with over Rs 10 lakh crore networth; announces Rs 5.50 dividend",
        "description": "RIL Q4 Results Earnings Live Updates: Reliance Industries Limited (RIL) declares fourth quarter earnings. Topline, bottomline beat estimates.",
        "content": "RIL Q4 Results, Earnings 2025 Live Updates: The fourth quarter earnings season is in full swing now and RIL has reported net profit of Rs 19,407 crore. This is higher than street estimates. Hits milestone of Rs 10 lakh crore networth. Company announc... [1462 chars]",
        "url": "https://www.financialexpress.com/business/industry-ril-q4-results-live-updates-reliance-industries-q4-earnings-revenue-net-profit-loss-dividend-3821930/",
        "image": "https://www.financialexpress.com/wp-content/uploads/2025/03/Reliance-Industries-Mukesh-Ambani-Reuters.jpg",
        "publishedAt": "2025-04-25T15:36:30Z",
        "source": {
            "name": "The Financial Express",
            "url": "https://www.financialexpress.com"
        },
        "scrap_content": "RIL Q4 Results, Earnings 2025 Highlights: The fourth quarter earnings season is in full swing now and RIL has reported net profit of Rs 19,407 crore. This is higher than street estimates. Hits milestone of Rs 10 lakh crore net worth. Company announces Rs 5.50 dividend for FY25.\nReliance Industries posted record annual consolidated revenues at Rs 1,071,174 crore ($125.3 billion), up 7.1% YoY. Revenue growth in consumer businesses and O2C helped revenue. Adding subscribers in telecom business. Total subscribe base increased to 488 million as of March, 2025. Reliance Jio also clocked healthy improvement in ARPU Rs 206.20 on the back of flow through of tariff hike.\nJio continues to invest in innovation, focusing on AI capabilities\nMukesh Ambani, Chairman and Managing Director, Reliance Industries said: “FY2025 has been a challenging year for the global business environment, with weak macro-economic conditions and a shifting geo-political landscape. The Oil to Chemicals business posted a resilient performance despite considerable volatility in energy markets. The Retail segment also delivered consistent growth. The quick hyperlocal deliveries initiative has also gained significant traction in the market, connecting strongly with the users. Jio continues to invest in innovation, focusing on AI capabilities and next generation technologies, which will shape India’s digital future.”\nFor the third quarter of FY25, Reliance Industries had reported a consolidated revenue of Rs 2.4 lakh crore, up 6.7 per cent year-on-year. Its net profit rose to Rs 18,540 crore, reflecting a 7 per cent increase from the previous year.\nRIL Q4 Results Live Updates: Mukesh Ambani on renewable energy\nMukesh D Ambani, Chairman and Managing Director, Reliance Industries, said, “During FY25, we have laid a strong foundation for our projects in renewable energy and battery operations. In the coming quarters, we will see the transition of this business from incubation to operationalization. I firmly believe that the New Energy growth engine will create significant value for Reliance, for India and for the world.”\nRIL Q4 Results Live Updates: Mukesh Ambani on O2C segment\nMukesh D Ambani, Chairman and Managing Director, Reliance Industries, said, “The Oil to Chemicals business posted a resilient performance despite considerable volatility in energy markets. Significant demand-supply imbalances in downstream chemicals markets have led to multi-year low margins. Our business teams ensured optimization of integrated operations and feedstock costs to enhance margin capture across value chains. The Oil & Gas business recorded its highest ever annual EBITDA led by higher production from our KGD6 and CBM blocks.”\nRIL Q4 Results Live Updates: JioStar performance (since merger)\n• JioStar reported revenues of Rs 10,006 crore with EBITDA (including other income) of Rs 774 crore.\n• The launch of JioHotstar on 14th February created an OTT platform in the country. Within five weeks of launch, JioHotstar crossed 100 million paid users.\n• JioHotstar served 503 million MAUs in the month of Mar ‘25 driven by key sporting events such as ICC Champions Trophy, IPL and India’s largest digital content library of greater than 320K Hours.\n• JioStar TV network occupied 34% market share across TV Entertainment and reached over 760 million monthly viewers across the country.\nRIL Q4 Results Live Updates: RIL’s Oil and Gas biz FY25 update\nRIL’s Oil and Gas (Exploration and Production) segment posted revenue growth of 3.2 per cent during FY25 as compared to FY24 mainly on account of higher volumes of KGD6 and CBM. This was partly offset by lower gas and condensate price realizations. The segment EBITDA increased by 4.9 per cent to Rs 21,188 crore on YoY basis tracking high revenues with improvement in EBITDA margins.\nRIL Q4 Results Live Updates: RIL’s Oil and Gas biz posts revenue decline of 0.4%\nRIL’s Oil and Gas (Exploration and Production) segment Q4 revenue dropped 0.4 per cent YoY mainly on account of lower gas production and lower oil offtake from KGD6, partly offset with improved KGD6 gas price realisation and higher CBM production. The average price realized for KGD6 gas was $ 10.09/MMBTU in Q4FY25 vis-à-vis $ 9.53/MMBTU in Q4FY24. The average price realised for CBM gas was $ 10.36/MMBTU in Q4FY25 vis-à-vis $ 14.34/MMBTU in Q4FY24. EBITDA for the segment stood at Rs 5,123 crore, down 8.6 per cent YoY following higher operating cost due to onetime maintenance activity and a natural decline in KGD6 volumes.\nRIL Q4 Results Live Updates: Reliance BP Mobility Q4 update\nReliance BP Mobility Limited (RBML) (operating under brand Jio-bp), operates a country-wide network of 1,916 outlets vs 1,729 in Q4FY24). RBML quarterly sales for HSD and MS grew at 24.4% / 35.4% on YoY basis as against industry sales volume growth rate of (0.5%) / 5.8%.\nRBML (operating under brand air-bp Jio) continued its robust growth trajectory in ATF sales with 46.8% growth vs industry rate of 6.4% on YoY basis. Under Jio-bp Pulse, RBML has grown the network to over 5,750 live charging points at 701 unique sites with industry leading charger uptime.\nRIL Q4 Results Live Updates: RIL’s O2C segment posts FY25 revenue growth of 11%\nReliance Industries’ Oil to Chemicals (O2C) segment posts FY25 revenue growth of 11.0% YoY to Rs 626,921 crore ($73.4 billion) primarily on account of higher volumes and increased domestic product placement - Gasoline (+42%), Gasoil (+33%), ATF (+62%). Segment EBITDA for FY25 was lower at Rs 54,988 crore ($6.4 billion) due to significant weakness in transportation fuel cracks and subdued downstream chemical deltas. “Earnings were supported by higher operating rates, operational flexibility, efficient feedstock sourcing and better margin capture for domestic sales,” the company said.\nRIL Q4 Results Live Updates: RIL’s O2C biz posts revenue growth of 15.4%\nReliance Industries’ Oil to Chemicals (“O2C”) segment posted Q4FY25 went up by 15.4 per cent YoY to Rs 164,613 crore ($19.3 billion) due to higher volumes and increased domestic product placement. Segment EBITDA dropped by 10.0 per cent on-year to Rs 15,080 crore ($1.8 billion) due to sharp fall in transportation fuel cracks and lower polyester chain margins partially offset by higher volume, feedstock cost optimization and higher PP and PVC delta.\nRIL Q4 Results Live Updates: Mukesh Ambani on Reliance Retail Q4 performance\nMukesh D Ambani, Chairman and Managing Director, Reliance Industries, said, “The Retail segment also delivered consistent growth. In FY25, the business focused on a strategic recalibration of our store network, aimed at improving operational efficiencies and long-term sustainability. Our enhanced product catalogue and user experience across all formats, strengthened customer engagement. The quick hyperlocal deliveries initiative has also gained significant traction in the market, connecting strongly with the users. Our suite of omni-channel offerings and wide-spread presence will enable Reliance Retail to continue delivering superior value to all its customers.”\nRIL Q4 Results Live Updates: Isha Ambani on Reliance Retail Q4 performance\nIsha M Ambani, Executive Director, Reliance Retail Ventures Limited, said, “Reliance Retail delivered strong growth in revenue and profits, powered by improved efficiencies, innovative formats, a sharper product mix, and continued investments in technology and customer experience. We remain focused on shaping the future of retail with agility and purpose.”\nRIL Q4 Results Live Updates: Reliance Retail’s FY25 update\nThe retail business continued to grow its store footprint, opening 2,659 stores during the year. However, with store rationalisation, total store count was at 19,340 with a total area of 77.4 million sqft. JioMart scaled up its quick hyper local deliveries benefiting from its wide store network presence.\nReliance Retail maintained that the quick hyper local exit daily gross orders in Q4FY25 grew 2.4x QoQ. Consumer Brands became the fastest growing FMCG company in India and achieved around Rs 11,450 crore sales in its 2nd year of operations. The registered customer base stood at 349 million, up 14.8 per cent YoY. Total transactions recorded were at 1.39 billion, up 10.6 per cent YoY.\nRIL Q4 Results Live Updates: Reliance Retail posts revenue growth of 14.3%\nReliance Retail Ventures Limited (RRVL) posted Q4 FY25 revenue at Rs 88,620 crore, posting a growth of 15.7 per cent YoY. EBITDA for the period stood at Rs 6,711 crore, up 14.3 per cent on-year. EBITDA margin from operations was recorded at 8.3 per cent.\nRIL Q4 Results Live Updates: Mukesh Ambani on Jio Q4 performance\nMukesh D Ambani, Chairman and Managing Director, Reliance Industries, said, “Our Digital Services business achieved record revenue and profit numbers. Steady increase in subscriber base, with an improving mix and increasing user engagement metrics boosted earnings. Strong adoption of our 5G services and our home broadband offerings continues with accelerated addition in subscribers and in the number of home-connects. Jio continues to invest in innovation, focusing on AI capabilities and next generation technologies, which will shape India’s digital future.”\nRIL Q4 Results Live Updates: Akash Ambani on Jio Q4 performance\nAkash M Ambani, Chairman of Reliance Jio Infocomm, said, “Jio continues to drive consistent outperformance in customer engagement with best-in-the-world network technologies and a wide bouquet of digital services for all Indians. Jio is proud to have served millions of users at the world's largest congregation of people, the Mahakumbh mela where its network scalability and flexibility was well demonstrated. Jio is working on enabling large scale AI infrastructure and services that will add an intelligence layer to all Jio services.”\nRIL Q4 Results Live Updates: Jio posts revenue growth of 17.8%\nReliance Jio posted Q4 revenue at Rs 39,853 crore, up 17.8 per cent YoY. The business vertical reported Q4 EBITDA at Rs 17,016 crore, up 18.5 per cent YoY. Jio recorded a total subscriber base of over 488 million as of Mar ’25, including 191 million true 5G subscribers. ARPU, meanwhile, increased further to Rs 206.2 with continued impact of the tariff hike and better subscriber mix partly impacted by lower number of days in the quarter. Jio said that monthly churn was 1.8 per cent, the lowest in the industry. Net subscriber addition was 6.1 million during the quarter. New additions were driven by the rebound of mobility additions post tariff hike and the steady ramp-up of connected home.\nRIL Q4 Results Live Updates: Mukesh Ambani on RIL performance\nMukesh D Ambani, Chairman and Managing Director, Reliance Industries, said, “FY2025 has been a challenging year for the global business environment, with weak macro-economic conditions and a shifting geo-political landscape. Our focus on operational discipline, customer-centric innovation and fulfilling India’s growth requirements has helped Reliance deliver a steady financial performance during the year.”\nRIL Q4 Results Live Updates: RIL’s revenue update across business verticals\no Gross Revenue increased by 7.1% YoY to Rs 1,071,174 crore ($ 125.3 billion)\no JPL revenue increased by 16.9% YoY led by higher ARPU on account of tariff revisions for mobility services and improving subscriber mix. Strong growth in home connects and scale up of digital services also contributed to revenue growth.\no RRVL revenue increased by 7.9% YoY led by growth in consumer electronics and grocery consumption baskets.\no Oil to Chemicals (O2C) revenue improved by 11.0% Y-o-Y with higher volumes and increased domestic product placement - Gasoline (+42%), Gasoil (+33%), ATF (+62%).\no Oil and Gas segment revenue increased by 3.2% due to higher volumes from KGD6 and CBM blocks.\nRIL Q4 Results Live Updates: Approval to raise funds worth Rs 25,000 crore\nReliance Industries announced that the company board has approved raising of funds through issuance of listed, secured / unsecured, redeemable non-convertible debentures up to Rs. 25,000 crore, in one or more tranches, on private placement basis.\nRIL Q4 Results Live Updates: Revenue across key business verticals\nOil to chemicals: Rs 164,613 crore\nOil & Gas: Rs 6,440 crore\nRetail: Rs 88,637 crore\nDigital Services: Rs 40,861 crore\nThe company board has recommended a dividend of Rs. 5.50 per equity share of Rs. 10/- each for the financial year ended March 31, 2025. In a regulatory filing, RIL said, \"We shall inform you in due course the date on which the Company will hold its Annual General Meeting for the financial year ended March 31, 2025 and the date from which dividend, if approved by the shareholders, will be paid.\"\nRIL Q4 Results Live Updates: Consolidated profit rises by 2.41% to Rs 19,407crore\nMukesh Ambani-led Reliance Industries Limited (RIL) on Friday announced its fiscal fourth quarter earnings with consolidated profit at Rs 19,407crore, reporting a growth of 2.41 per cent in comparison to Rs 18,951crore recorded during the corresponding quarter of FY24. It posted revenue from operations at Rs 2,64,573 crore, up 9.91 per cent as against Rs 2,40,715crore reported during the fourth quarter of previous financial year\nReliance Jio earnings: The recent tariff hike is expected to help Reliance Jio's Q4 performance. The Higher tariff rates are expected to help the company post a higher ARPU growth. The margins too are likely to show improvement and may remain above 50%.\nRIL Q4 Results Live Updates: Reliance Retail to post sales growth of 6.5% YoY, says Goldman Sachs\nAccording to Goldman Sachs, Reliance Retail is expected to post Q4 sales growth (ex-connectivity) of 6.5 per cent YoY. “We note that Q4FY25 sales growth is likely to have a slight drag for all companies because the quarter has one fewer day than Q4FY24. The improving sales growth trend for Reliance Retail is driven by (1) re-structuring of Grocery business largely behind (B2B business rationalization and streamlining of store portfolio through closures of low-profitability stores), and (2) focus in Fashion business on trendier designs and better value proposition (launch of new fast fashion formats like Yousta).” The brokerage firm forecasted a slight improvement in margins sequentially.\nRIL Q4 Results Live Updates: RIL share performance in Q4\nReliance Jio is expected to continue benefitting from the July 2024 tariff hikes in Q4, analysts said. The telecom major is likely to add around four million subscribers. According to the average of estimates from five brokerages as calculated by Financial Express, Jio’s subscriber base is expected to come in at 488 million at the end of the March 2025 quarter, and ARPU at Rs 204.76. Its Q3FY25 subscriber base was 482 million, and ARPU was Rs 203.\nRIL Q4 Results Live Updates: Jio Financial Services posted 1.6% growth in Q4 profit\nEarlier last week, Jio Financial Services reported a marginal 1.6 per cent rise in its consolidated net profit in the March quarter at Rs 316 crore, compared with Rs 311 crore registered in Q4FY24. For the full year, the net profit rose from Rs 1,605 crore to Rs 1,613 crore. The company’s total income rose from Rs 418 crore to Rs 518 crore in previous year. For the entire financial year, income went up from Rs 1,855 crore to Rs 2,079 crore.\nRIL Q4 Results Live Updates: Estimates on Q4 numbers\nAccording to a Moneycontrol survey of eight analysts, Reliance’s Q4 revenue is expected to be at Rs 2.38 lakh crore. EBITDA is estimated to be around Rs 43,491.6 crore and net profit is projected at Rs 18,820 crore.",
        "custom_category": "India"
    },
    {
        "title": "7 surprising things that change in our body when we quit sugar, explains US doctor",
        "description": "Dr. Eric Berg explains that eliminating added sugar for just two weeks can lead to surprising health benefits. This isn’t about punishment or strict d",
        "content": "Here are the lesser-known changes the body goes through in just two sugar-free weeks.\nThe craving monster shrinks\nHunger doesn’t knock every 2 hours anymore\nEnergy that feels more natural, more lasting\nWeight loss without starving or counting calorie... [3053 chars]",
        "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/us-doctor-explains-7-things-that-change-in-our-body-if-we-stop-eating-sugar-for-just-2-weeks/articleshow/120620465.cms",
        "image": "https://static.toiimg.com/thumb/msid-120621304,width-1070,height-580,imgsize-142204,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-25T15:30:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    },
    {
        "title": "Neeraj Chopra breaks silence on inviting Pakistan's Arshad Nadeem for NC Classic 2025, says...",
        "description": "Neeraj Chopra breaks silence on inviting Pakistan's Arshad Nadeem for NC Classic 2025, says... - In this collection of pictures we shall know Neeraj Chopra's reaction over inviting Pakistan's Arshad Nadeem. Let's dive in., Explore latest photo galleries of at India.com PhotoGallery.",
        "content": "Image credit: X (Formerly Twitter)\nNeeraj Chopra breaks silence over inviting Pakistan's Arshad Nadeem\n\"There has been so much talk about my decision to invite Arshad Nadeem to compete in the Neeraj Chopra Classic, and most of it has been hate and ab... [399 chars]",
        "url": "https://www.india.com/photos/sports/neeraj-chopra-breaks-silence-on-inviting-pakistans-arshad-nadeem-for-nc-classic-2025-says-i-am-both-hurt-and-angry-at-what-has-taken-place-439843/",
        "image": "https://st1.photogallery.ind.sh/wp-content/uploads/indiacom/Neeraj-Chopra-breaks-silence-on-inviting-Pakistan's-Arshad-Nadeem-for-NC-Classic-2025,-says...-202504-1745592805.jpg",
        "publishedAt": "2025-04-25T14:57:26Z",
        "source": {
            "name": "India.Com",
            "url": "https://www.india.com"
        },
        "scrap_content": "By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts Cookies Policy.",
        "custom_category": "India"
    },
    {
        "title": "Reliance Retail Q4 Results: Net profit rises 29% to ₹ 3,545 crore, revenue up 16.3% YoY; 1,085 new stores added",
        "description": "Reliance Retail Q4 Results: Net profit rises 29% to ₹3,545 crore, revenue up 16.3% YoY; 1,085 new stores added",
        "content": "Reliance Retail Q4 Results: Reliance Retail announced its January-March quarter results for fiscal 2024-25 (Q4FY25) on Friday, April 25, reporting a rise of 29.1 per cent in consolidated net profit to ₹3,545 crore, compared to ₹2,746 crore in the cor... [3431 chars]",
        "url": "https://www.livemint.com/market/stock-market-news/reliance-retail-q4-results-net-profit-rises-29-to-rs-3-545-crore-revenue-up-16-3-yoy-1-085-new-stores-added-11745588440812.html",
        "image": "https://www.livemint.com/lm-img/img/2025/04/25/1600x900/2-0-445002230-Reliance-Trends-0_1680886558303_1745588483464.jpg",
        "publishedAt": "2025-04-25T14:53:14Z",
        "source": {
            "name": "Mint",
            "url": "https://www.livemint.com"
        },
        "scrap_content": "Reliance Retail Q4 Results: Reliance Retail announced its January-March quarter results for fiscal 2024-25 (Q4FY25) on Friday, April 25, reporting a rise of 29.1 per cent in consolidated net profit to ₹3,545 crore, compared to ₹2,746 crore in the corresponding period last year.\nIts gross revenue for the financial year ended March 2025 was up 7.85 per cent to ₹3,30,870 crore and profit after tax was up 11.33 per cent to ₹12,388 crore.\nThe company had reported a gross income of ₹76,627 crore and profit after tax of ₹2,746 crore in the January-March quarter a year ago, according to the regulatory filing of Reliance Industries Ltd (RIL).\nReliance Retail's revenue from operation in the latest March quarter was up 16.3 per cent to ₹78,622 crore. It was at ₹67,610 crore in the year-ago quarter.\nMoreover, digital commerce and new commerce contributed to 18 per cent of the total revenue of Reliance Retail in March quarter as it continued to scale these new-age channels.\nThe pre-tax profit (EBITDA) of the country's leading retailer was also up 14.3 per cent in the March quarter of FY25 to ₹6,711 crore.\nReliance Retail continued to grow its store footprint and opened 2,659 new stores in FY25. However, with store rationalisation, total store count was at 19,340 with total area of 77.4 million sq ft as on March 31.\nRIL Chairman and Managing Director Mukesh Ambani said: \"The retail segment also delivered consistent growth. In FY25, the business focused on a strategic recalibration of our store network, aimed at improving operational efficiencies and long-term sustainability.\n\"Our enhanced product catalogue and user experience across all formats, strengthened customer engagement. The quick hyperlocal deliveries initiative has also gained significant traction in the market, connecting strongly with the users,\" he said.\nIn FY25, Reliance Retail's registered customer base stood at 349 million, registering a growth of 14.8 per cent year-on-year. Total transactions recorded at 1.39 billion, up 10.6 per cent annually.\nIn the March quarter, Reliance Retail opened 1,085 new stores and recorded 361 million total transactions, which was 16.1 per cent higher from corresponding period a year ago.\nIn consumer electronics segment, Reliance stores maintained their growth momentum, driven by a 26 per cent Y-o-Y growth in average bill value and a 200-basis point improvement in conversions.\nMoreover, early onset of summer boosted air-conditioner and cooler sales. Its 'Digital Chill Fest' for air-conditioners delivered a 21 per cent Y-o-Y growth.\nIts 'Fashion and Lifestyle' business maintained growth in March quarter helped by local festivals and weddings. In the segment, Reliance-owned brands continued to show strong growth, reporting 9 per cent growth over their contribution. Brands as Netplay and Avaasa delivered particularly strong performance.\nReliance's online fashion platform AJIO delivered a steady performance in March quarter and added 1.9 million new customers.\n\"The portfolio was strengthened to 2.4 million options, marking a 44 per cent Y-o-Y growth,\" it said.\nIts jewels business recorded a steady growth driven by an increase in average bill value due to increasing prices and wider product offerings.\nIn the grocery segment, Reliance business continued to scale up FreshPik and GoFresh by offering differentiated assortments and enhanced shopping experience.\nIt cash & carry business, Metro also reported a 37 per cent Y-o-Y increase in sales led by an uptick in staples, processed foods, confectionery, and beverages categories.\nReliance's consumer brands delivered ₹11,450 crore revenue in FY25, becoming fastest growing FMCG company in India.\n\"Reliance Retail delivered strong growth in revenue and profits, powered by improved efficiencies, innovative formats, a sharper product mix, and continued investments in technology and customer experience. We remain focused on shaping the future of retail with agility and purpose,\" said RRVL Executive Director Isha Ambani.\nCatch all the Business News , Market News , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates.",
        "custom_category": "India"
    },
    {
        "title": "Unique record! Mohammed Shami makes IPL history as first bowler to ...",
        "description": "Mohammed Shami etched his name in IPL record books by becoming the first bowler to claim a first-ball wicket for the fourth time, dismissing Shaik Ras",
        "content": "Mohammed Shami celebrates after taking the wicket of Shaik Rasheed. (Pic credit: IPL)\nAlso visit:\nGo Beyond The Boundary with our YouTube channel.\nPoll How do you feel about the trend of younger players making an impact in IPL? I don't follow IPL clo... [1847 chars]",
        "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/unique-record-mohammed-shami-makes-ipl-history-as-first-bowler-to-/articleshow/120623164.cms",
        "image": "https://static.toiimg.com/thumb/msid-120623354,width-1070,height-580,imgsize-50292,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "publishedAt": "2025-04-25T14:42:00Z",
        "source": {
            "name": "Times of India",
            "url": "https://timesofindia.indiatimes.com"
        },
        "scrap_content": null,
        "custom_category": "India"
    },
    {
        "title": "TATA IPL Live Score, Chennai Super Kings vs Sunrisers Hyderabad Live Full Scorecard",
        "description": "IPL 2025 Live Cricket Score, CSK vs SRH Live Score Online Today Match Updates: Pat Cummins-led Sunrisers Hyderabad won the toss and elected to bowl first against MS Dhoni's Chennai Super Kings in the Indian Premier League 2025 Match No. 43 at the MA Chidambaram Stadium in Chennai on Friday.",
        "content": "CSK vs SRH LIVE Score, IPL 2025: Captain's corner at toss\nPat Cummins: We gonna have a bowl first. Chennai is always a big game, coming off a couple of loses but it is a new venue and boys are up for it. If the wicket is good, backing them to get a b... [764 chars]",
        "url": "https://indianexpress.com/article/sports/cricket/csk-vs-srh-live-score-2025-ipl-43th-match-live-cricket-score-updates-chennai-super-kings-vs-sunrisers-hyderabad-ms-dhoni-travis-head-9965292/",
        "image": "https://images.indianexpress.com/2025/04/IPL-2025_New_Match-43-01.jpg",
        "publishedAt": "2025-04-25T14:36:00Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        },
        "scrap_content": "IPL 2025 Live Score, CSK vs SRH Live Cricket Score Online: Chennai Super Kings were bundled out for just 154 in 19.5 overs after being invited to bat first by Pat Cummins-led Sunrisers Hyderabad in the Indian Premier League 2025 Match No. 43 at the MA Chidambaram Stadium in Chennai on Friday. The match coincided with MS Dhoni’s milestone 400th T20 match.\nBoth teams have had contrasting make-ups for the 2025 season, with SRH primed to dominate the batting charts this season. Pitted at the far end of that spectrum with a weary-looking batting unit, CSK have struggled to put on the big runs consistently through the league. And yet, both times are riding the same boat, with another defeat fatal to their respective Playoffs hopes.\nCSK and SRH enter the contest after defeats to the Mumbai Indians, who have interestingly regrouped and stormed off the bottom half of the table into the top four. It is that sort of inspiration and performance that CSK and SRH will be looking for tonight, despite the obvious visible cracks in their respective line-ups.\nFollow CSK vs SRH IPL 2025 Live Score updates below:\nChennai Super Kings\n154 (19.5)Sunrisers Hyderabad\n155/5 (18.4)Sunrisers Hyderabad beat Chennai Super Kings by 5 wickets",
        "custom_category": "India"
    },
    {
        "title": "RIL Q4 Results: Profit rises 2% YoY to Rs 19,407 crore; beats street estimates",
        "description": "India's leading conglomerate Reliance Industries Ltd (RIL) reported 2% growth in its consolidated net profit at Rs 19,407 crore for the fourth quarter ended March 2025. Revenue from operations in the same period increased 10% year-on-year (YoY) to Rs 2.64 lakh crore.",
        "content": "ETMarkets.com\nLive Events\nO2C business\nJio Platforms\nReliance Retail\nOil and Gas business (exploration and production)\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nIndia's leading conglomerate Reliance Indust... [4524 chars]",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q4-results-profit-rises-2-yoy-to-rs-19407-crore-rs-5-5-per-share-dividend-declared/articleshow/120623131.cms?from=mdr",
        "image": "https://img.etimg.com/thumb/msid-120623107,width-1200,height-630,imgsize-234469,overlay-etmarkets/articleshow.jpg",
        "publishedAt": "2025-04-25T14:32:37Z",
        "source": {
            "name": "The Economic Times",
            "url": "https://m.economictimes.com"
        },
        "scrap_content": "The profit was well above the Street expectation of Rs 18,471 crore.\nThe company's board has recommended a dividend of Rs 5.50 per equity share for FY25.\nApart from the dividend and results, the Board has approved raising Rs 25,000 crore through bonds in one or more tranches.\nOn a sequential basis, net profit increased 5% from Rs 18,540 crore reported in the preceding December quarter. Revenues, meanwhile, were up 8% quarter-on-quarter.\nEBITDA for the fourth quarter increased by 4% YoY to Rs 48,737 crore.\n\"FY25 has been a challenging year for the global business environment, with weak macro-economic conditions and a shifting geo-political landscape. Our focus on operational discipline, customer-centric innovation and fulfilling India’s growth requirements has helped Reliance deliver a steady financial performance during the year,\" said Mukesh Ambani, Chairman and MD, RIL.\nAlso Read: Reliance Jio Q4 Results: Cons PAT jumps 26% YoY to Rs 7,022 crore, ARPU rises to Rs 206\nFor the fourth quarter, finance costs increased 7% YoY to Rs 6,155 crore, primarily due to higher average liability balances. Tax expenses rose 1% YoY to Rs 6,669 crore. Capital expenditure for the quarter ended March 2025 stood at Rs 36,041 crore.\nO2C business\nSegment wise, O2C business recorded a weak operational performance with EBITDA dropping 10% YoY to Rs 15,080 crore. This was because of sharp fall in transportation fuel cracks and lower polyester chain margins partially offset by higher volume, feedstock cost optimization and higher PP and PVC delta.However, revenues for the segment jumped 15% YoY to Rs 1.64 lakh crore due to higher volumes and increased domestic product placement.\nThe total throughput during the fourth quarter rose 2.5% to 20.3 mmt.\nAlso Read: Reliance Retail Q4 Results: Cons PAT jumps 29% YoY to Rs 3,545 crore, revenue rises 16%\n\"The oil to chemicals business posted a resilient performance despite considerable volatility in energy markets. Significant demand-supply imbalances in downstream chemicals markets have led to multi-year low margins,\" said Ambani\nThe company said optimization of integrated operations and feedstock costs is underway to enhance margin capture across value chains.\nJio Platforms\nJio Platforms recorded a revenue growth of 18% YoY to Rs 39,853 crore while EBITDA grew 18% to Rs 17,016 crore. Net profit for the quarter stood at Rs 7,022 crore, up 26% YoY.The double-digit operating revenue growth was driven by tariff increase for mobility services, improving subscriber mix due to scale up of home connects and growth in digital service.\nARPU for the quarter rose to Rs 206.2, aided by the flow-through of tariff hikes and better subscriber mix. Data traffic surged 24% YoY to 184.5 exabytes, while the subscriber base crossed 488 million, including 191 million 5G users.\nAlso read: RIL board approves raising Rs 25,000 crore via NCDs\n\"Jio continues to drive consistent outperformance in customer engagement with world-class network technologies and a wide bouquet of digital services,” said Akash Ambani, Chairman, Reliance Jio.\nReliance Retail\nRevenue for Q4FY25 came in at Rs 88,620 crore, up 16% YoY, led by strong performance across consumer electronics and grocery segments. EBITDA stood at Rs 6,711 crore, up 14% YoY, while net profit rose 29% YoY to Rs 3,519 crore.For the full year, gross revenue grew 8% YoY to Rs 3.3 lakh crore, while PAT for FY25 stood at Rs 12,392 crore, up 12%. The company added 1,085 stores during the quarter, taking the total to 19,340 stores. Customer base expanded to 349 million, with 361 million transactions in Q4 alone.\nAlsoe Read: JioStar posts Rs 229 crore net profit in first post-merger results\nReliance Retail delivered strong growth in revenue and profits, powered by improved efficiencies, innovative formats, and continued tech investments,” said Isha Ambani, Executive Director, RRVL.\nOil and Gas business (exploration and production)\nThe oil and gas business' fourth quarter revenue rising fell 0.4% YoY to Rs 6,440 crore. EBITDA for the quarter declined 9% to Rs 5,123 crore.FY25 revenue is higher by 3.2% as compared to FY24 mainly on account of higher volumes of KGD6 and CBM. This was partly offset by lower gas and condensate price realizations.\nProduction volumes from the KG-D6 block stood at 26.73 MMSCMD of gas and 20,300 bbl per day.\nOn Friday, RIL shares closed marginally lower at Rs 1,301 on NSE.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nRead More News on\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price",
        "custom_category": "India"
    },
    {
        "title": "Reliance Q4 Results 2025: From profit, revenue to EBITDA- 5 key takeaways from March quarter earnings",
        "description": "Reliance Q4 Results 2025: Reliance reported a 6% YoY rise in its consolidated profit for the March quarter of the last financial year (Q4FY25). Revenue from operations jumped 10% YoY.",
        "content": "Reliance Q4 Results 2025: Mukesh Ambani-led oil-to-telecom-to-retail conglomerate Reliance Industries, on Friday, April 25, reported a 6 per cent year-on-year (YoY) rise in its consolidated profit for the March quarter of the last financial year (Q4F... [5781 chars]",
        "url": "https://www.livemint.com/market/stock-market-news/reliance-q4-results-2025-from-profit-revenue-to-ebitda-5-key-takeaways-from-reliance-q4-earnings-11745585571512.html",
        "image": "https://www.livemint.com/lm-img/img/2025/04/25/1600x900/PTI02-25-2025-000196A-0_1743064072543_1745597185300.jpg",
        "publishedAt": "2025-04-25T14:29:47Z",
        "source": {
            "name": "Mint",
            "url": "https://www.livemint.com"
        },
        "scrap_content": "Reliance Q4 Results 2025: Mukesh Ambani-led oil-to-telecom-to-retail conglomerate Reliance Industries, on Friday, April 25, reported a 6 per cent year-on-year (YoY) rise in its consolidated profit for the March quarter of the last financial year (Q4FY25). Reliance's Q4FY25 consolidated profit stood at ₹22,434 crore compared to ₹21,143 crore in the corresponding quarter of FY24.\nReliance's revenue from operations for Q4FY25 stood at ₹2,64,573 crore, up nearly 10 per cent YoY, compared to ₹2,40,715 crore in the same quarter of the previous financial year.\nEBITDA for the quarter grew 3.6 per cent YoY to ₹48,737 crore from ₹47,050 crore in Q4FY24. EBITDA margin for the quarter came at 16.9 per cent, down 90 bps from 17.8 per cent YoY.\nFor the financial year 2025 (FY25), the company's consolidated revenue came at a record ₹10,71,174 crore, which was up 7.1 per cent YoY.\nConsolidated profit after tax (PAT) for FY25 grew 2.9 per cent YoY to ₹81,309 crore.\nConsolidated EBITDA also grew 2.9 per cent YoY to ₹1,83,422 crore for the last financial year.\n“FY25 has been a challenging year for the global business environment, with weak macro-economic conditions and a shifting geo-political landscape. Our focus on operational discipline, customer-centric innovation and fulfilling India’s growth requirements has helped Reliance deliver a steady financial performance during the year,\" said Mukesh D. Ambani, Chairman and Managing Director, Reliance Industries.\n\"During FY25, we have laid a strong foundation for our projects in renewable energy and battery operations. In the coming quarters, we will see the transition of this business from incubation to operationalisation. I firmly believe that the New Energy growth engine will create significant value for Reliance, for India and for the world,\" he said.\nMeanwhile, India's largest company by market capitalisation announced a dividend of ₹5.5 for the financial year 2025 (FY25).\nMoreover, Reliance's board approved a fundraising plan to raise up to ₹25,000 crore through the issuance of listed, secured/unsecured, redeemable non-convertible debentures in one or more tranches on a private placement basis.\nThe telecom division of the behemoth exhibited healthy growth in the last quarter, with PAT jumping 25.7 per cent YoY to ₹7,022 crore. Revenue from operations increased 17.7 per cent YoY to ₹33,986 crore.\nEBITDA of Jio Platforms jumped 18.5 per cent YoY to ₹17,016 crore, while EBITDA margin increased 40 bps YoY to 50.1 per cent.\nJio's ARPU (average revenue per user) increased to ₹206.2 with the continued impact of the tariff hike and a better subscriber mix, partly impacted by a lower number of days in the quarter. Net subscriber addition was 6.1 million during the quarter. As of March 2025, the total subscriber base of Jio was 488.2 million.\nData and voice traffic increased 19.5 per cent and 3.8 per cent YoY, respectively, in Q4FY25. The company said that growing 5G subscriber mix and accelerated home connects drive industry-leading traffic growth.\n\"Our digital services business achieved record revenue and profit numbers. Steady increase in subscriber base, with an improving mix and increasing user engagement metrics boosted earnings,\" said Reliance Chairman.\n\"Strong adoption of our 5G services and our home broadband offerings continues with accelerated addition in subscribers and in the number of home-connects. Jio continues to invest in innovation, focusing on AI capabilities and next-generation technologies, which will shape India’s digital future,\" he added.\nReliance Retail Ventures saw its Q4 revenue from operations growing 16.3 per cent YoY to ₹78,622 crore, while PAT increased 29.1 per cent YoY to ₹3,545 crore.\nEBITDA also increased 14.3 per cent YoY to ₹6,711 crore. However, EBITDA margin declined 20 bps YoY to 8.5 per cent during the quarter.\nReliance Retail opened 2,659 stores in FY25, with a total store count of 19,340, and a 77.4 million square feet area.\n\"The business continued to grow its store footprint, opening 2,659 stores during the year. However, with store rationalisation, the total store count was at 19,340 with a total area of 77.4 million sq. ft..,\" said the company.\nRevenue for the segment increased 15.4 per cent YoY to ₹1,64,613 crore due to higher volumes and increased domestic product placement.\nHowever, EBITDA decreased by 10 per cent YoY to ₹15,080 crore. EBITDA margin of the segment shrank by 260 bps YoY to 9.2 per cent.\nThe company said EBITDA of the O2C segment declined due to a sharp fall in transportation fuel cracks and lower polyester chain margins, which was partially offset by higher volume, feedstock cost optimisation and higher PP and PVC delta.\n\"The oil to chemicals business posted a resilient performance despite considerable volatility in energy markets. Significant demand-supply imbalances in downstream chemicals markets have led to multi-year low margins,\" said the chairman and managing director of the company.\nThe oil and gas segment of Reliance Industries remained under pressure during Q4FY25. Its revenue slipped 0.4 per cent YoY to ₹6,440 crore primarily due to lower gas production and lower oil offtake from KGD6.\nEBITDA declined 8.6 per cent YoY to ₹ 5,123 crore after higher operating cost due to one-time maintenance activity and a natural decline in KGD6 volumes. Consequently, EBITDA margin dropped 720 bps to 79.5 per cent.\nReliance said the launch of JioHotstar has created the biggest OTT platform in the country.\n\"Within five weeks of launch, JioHotstar crossed 100 million paid users. JioStar reported revenues of ₹10,006 crore with EBITDA (including other income) of ₹774 crore,\" said the company.\nDisclaimer: This story is based on exchange filings by Reliance Industries and is for educational purposes only. The views and recommendations above, if any, are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions, as market conditions can change rapidly and circumstances may vary.\nCatch all the Business News , Market News , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates.",
        "custom_category": "India"
    },
    {
        "title": "Indigenous HPV tests to strengthen cervical cancer screening launched",
        "description": "Mylab and Molbio's validated HPV test kits aim to revolutionize cervical cancer screening in India.",
        "content": "Jitendra Singh, Union Minister of State for Science and Technology, officially launched indigenously developed HPV test kits for cervical cancer screening at a high-profile event in Delhi on Thursday. The launch marks the culmination of the national ... [1788 chars]",
        "url": "https://www.thehindubusinessline.com/companies/indigenous-hpv-tests-to-strengthen-cervical-cancer-screening-launched/article69491137.ece",
        "image": "https://bl-i.thgim.com/public/incoming/klxjxv/article69491371.ece/alternates/LANDSCAPE_1200/IMG_cervical_cancer_2_1_KLAMB9EI.jpg",
        "publishedAt": "2025-04-25T14:21:13Z",
        "source": {
            "name": "BusinessLine",
            "url": "https://www.thehindubusinessline.com"
        },
        "scrap_content": "Jitendra Singh, Union Minister of State for Science and Technology, officially launched indigenously developed HPV test kits for cervical cancer screening at a high-profile event in Delhi on Thursday. The launch marks the culmination of the national program titled “Validating Indigenous Human Papilloma Virus (HPV) Tests for Cervical Cancer Screening in India”, a strategic initiative supported by GCI-BIRAC-DBT.\nAs part of the program, two HPV test kits developed by Mylab Discovery Solutions and Molbio Diagnostics were validated through multicentric clinical studies conducted across leading research institutions in India. The initiative aims to create cost-effective, accurate, and accessible diagnostic solutions tailored to India’s public health needs.\nAmong the validated kits, Mylab’s Pathodetect HR HPV Hi-Res DNA test, designed to run on its automated Compact platform, enables high-throughput, accurate screening that can be scaled across healthcare settings, including primary care facilities. The kit was noted for its integration of automation and ease of use in decentralized environments.\nCervical cancer remains the second most common cancer among Indian women, and India accounts for one of the highest global burdens. The availability of validated, indigenous HPV testing solutions is a major milestone toward enhancing early detection and prevention strategies.\nMylab’s RTPCR-based HPV diagnostic test kit offers rapid, point-of-care testing capabilities, critically important for deployment in various healthcare settings, particularly in underserved areas where access to advanced laboratory facilities may be limited.\nThe domestically produced test kits are expected to be deployed through national healthcare programs, with officials suggesting this could fundamentally transform cervical cancer detection and management in the country. The successful development and validation of these kits also represents a major step forward for India’s healthcare self-reliance initiatives.\n====\nPublished on April 25, 2025",
        "custom_category": "India"
    },
    {
        "title": "CSK vs SRH LIVE Score, IPL 2025: Chennai Super Kings 45/2 (5 overs); Mhatre attacks after early wickets",
        "description": "CSK vs SRH: Catch the live score updates from the IPL 2025 match between Chennai Super Kings and Sunrisers Hyderabad at the M.A. Chidambaram Stadium in Chennai.",
        "content": "CSK in 6 overs\nCummins for his second over. A yorker to Mhatre, digs it out to mid off for one run. Cummins bowls back-of-a-length to Jadeja, who pulls this, gets an under edge and takes a single to short fine leg.\nWICKET! Mhatre would be upset with ... [397 chars]",
        "url": "https://sportstar.thehindu.com/cricket/ipl/ipl-news/csk-vs-srh-live-score-chennai-super-kings-v-sunrisers-hyderabad-ipl-2025-match-updates-highlights-streaming-info-25-april/article69490505.ece",
        "image": "https://ss-i.thgim.com/public/incoming/7bmpy9/article69490508.ece/alternates/LANDSCAPE_1200/IPL%20Blog%207.png",
        "publishedAt": "2025-04-25T14:20:50Z",
        "source": {
            "name": "Sportstar",
            "url": "https://sportstar.thehindu.com"
        },
        "scrap_content": "- April 25, 2025 23:16Updated Points Table\n- April 25, 2025 23:12SRH 155/5 in 18.4 overs\nJadeja with his final over. Mendis misses his attempted sweep. Connects the pull shot off the next but an excellent effort from Brevis in the deep keeps it to two. Another sweep into the gap in the legside, another couple. Short ball, Mendis pulls it through wide mid on to complete a double. And that seals a five-wicket win for SRH, their first win at this ground!\n- April 25, 2025 23:07SRH 149/5 in 18 overs\nKhaleel back into the attack. Mendis turns a full ball towards midwicket and picks up a couple. Inside edge as he looks to punch, a single to deep fine leg. Full toss on the pads, clipped on the bounce to deep square. Slower short ball, flat batted to the right of mid off for a single. Reddy pushes a length ball to midwicket and picks up a couple.\n- April 25, 2025 23:004SRH 142/5 in 17 overs\nAnother wide from Pathirana. Mendis punches one to mid off and picks up a single. Yorker on the stumps, jammed down to deep fine for a couple more. Four!! Slower ball into the wicket, pulled through the gap at midwicket for a boundary. Full on the pads, clipped past short midwicket for a double. Four!! Reddy gives himself space. Pathirana bowls a full toss on the stumps and is cut past point for a boundary. Dot ball to finish the over. 15 off it.\n- April 25, 2025 22:554SRH 127/5 in 16 overs\nNoor with his last over. Miscued shot from Mendis over the offside, falls in between extra cover and deep cover. Reddy pushes one to long off for a single. No ball signalled. Mendis takes a swing on the free hit ball and misses. Four!! Full on the stumps, swept past deep midwicket for a boundary. Another miscue as he looks to punch, a single to midwicket. Another no ball and free hit. Reddy’s slog goes on the bounce to long on for a single. Another miscue that lands safely, trickling away to long off. Reddy punches one to cover for a couple. 13 from the over.\n- April 25, 2025 22:504SRH 114/5 in 15 overs\n49 needed of six overs. The wickets column a bigger issue for SRH rather than the required RR.\nKamindu defends the first ball of Pathirana’s over to short midwicket. Four!! Full outside off, driven through the gap at cover for a boundary. Jams the next one to point. Yorker length on the stumps, clipped through midwicket for a couple. Eight from the over.\n- April 25, 2025 22:42WSRH 106/5 in 14 overs\nNoor again. Fired in wide down leg, beats Dhoni and short fine leg to run away for five wides. Noor gets one to beat Mendis with one that turns away. Batter had no clue. Picks up a couple with a reverse sweep over point. Four!! Gets down on his knees and sweeps a full one through square leg for four more. WICKET!! Noor gets the breakthrough! Aniket looks to go big down the ground, holes out to long off.\nNitish in at 7. Defends the first ball he faces to slip.\n- April 25, 2025 22:37SRH 94/4 in 13 overs\nPathirana into the attack. Starts off with a wide. Back of a length outside off, beats Aniket’s outside edge as he looked to take a swipe. Length outside off, Aniket guides through wide third man for a couple. Full outside off, beats Aniket’s attempted slog. Slower short ball, Aniket is too early into the pull. Beaten all ends up. Yorker on middle stump, batter manages to jam it out.\n- April 25, 2025 22:32WSRH 90/4 in 12 overs\nNoor returns. Khaleel’s misfield at short third allows Kishan a single. Aniket cuts a short ball to point for one. Back of a length, Kishan rolls his wrists to guide it to midwicket. Another single to point for Aniket. Six!! A touch short, Kishan rocks back and pulls over midwicket for six! WICKET!! Short again but wider, Kishan pulls again and Curran takes a great catch falling backwards at deep midwicket.\nMendis in at 6.\n- April 25, 2025 22:276SRH 80/3 in 11 overs\nJadeja again. Kishan drags one to long on, on the bounce, for a single. Inside edge to short fine gives Aniket a single. Change of ball for the bowling side. Indication of dew. Kishan steps down and misses his legside heave, is hit on the pads but he had taken quite a few steps down the track. Six! Aniket goes down the track and manages to clear the fence.\n- April 25, 2025 22:226SRH 69/3 in 10 overs\nCurran again. On the pads to Aniket from over the wicket, a leg bye collected to fine leg.\nFOUR! A much needed boundary for SRH. Too full and Ishan chips this over covers. Curran drags his length back on the third, Ishan punches to long on for one.\nSIX! The wrong line to Aniket, on the pads, and the batter picks it up with the angle over fine leg. A single to deep covers for one run with a punch off his back foot. Ishan clips off his pads, gets one run on the last ball.\n- April 25, 2025 22:18WSRH 55/3 in 9 overs\nWICKET! Jadeja removes the dangerous Klaasen. This is a length ball, at the middle-and-leg stump line, turns towards the off stump, Klaasen has made up his mind to hit this down the ground, gets to the pitch off it but still ends up not middling it. Deepak Hooda gets under this and completes the catch at long on.\nHeinrich Klaasen c Hooda b Jadeja 7(8)\nAniket Verma at No. 5. He gets off the mark on the final delivery of the over, drives to deep covers for a single.\n- April 25, 2025 22:124SRH 54/2 in 8 overs\nSam Curran into the attack now. He starts outside the off stump to Ishan, who gets on his front foot, gets a single through covers.\nFOUR! A gift, really. A length ball on the pads, going down leg, uses the pace to send it past short fine leg. Klaasen drives the third to long on for a single.\nFOUR more! This time for Ishan, and off an edge. This is too wide, Ishan chases this with a cut and gets a thick edge between the keeper and the short third fielder. BEATEN on the fifth. Outside off, the right length, confuses Ishan whether to get on his front foot or not, he ends up jabbing at it with no footwork.\nAn overthrow off the last delivery allows Ishan a couple.\n- April 25, 2025 22:08SRH 42/2 in 7 overs\nRavindra Jadeja to bowl the seventh. He starts with a length ball at the stumps to Ishan, defends it. The second is slightly wider, Ishan slashes this down to long off off his back foot, one run. Jadeja goes on the pads to Klaasen, plays with soft hands and works it away to deep midwicket, one.\nThe fourth delivery is flatter, straight outside off, Ishan rocks onto his backfoot again, punches to long onfor one. Klaasen plays the fifth to deep midwicket again, single taken. Ishan cuts the final delivery to deep covers for another single.\nA good start for Jadeja, just five runs from this over.\n- April 25, 2025 22:03BSRH 37/2 in 6 overs\nKamboj for his third over. Ishan tries to run the first delivery past short third man, hits it straight at the fielder but escapes as the ball bounces right in front of the fielder.\nInto the body of Ishan on the second, gets on his toes and works it away to midwicket for one.\nBOWLED HIM! Kamboj gets Head. Back-of-a-length ball, Head tries to swing across the line at this, he’s not even looking at the ball as he swings, the ball holds up off the surface and clips the top of off.\nTravis Head b Kamboj 19(16)\nHeinrich Klaasen at crease now. He drives the first to mid off, no run. A silly mid off in place for the fourth ball. BEATEN! Klaasen is mindful of that fielder, he wants to drive through covers despite this being a straighter delivery, misses.\n- April 25, 2025 21:584SRH 36/1 in 5 overs\nNorr Ahmad to Ishan, on the pads, Ishan works it away from deep in his crease towards deep backward square leg, one run. The second delivery is angling down the leg to Head, plays it off his backfoot to deep square leg, one run.\nIshan makes room on the third ball, Noor bowls a googly to cramp him but Ishan flat bats it right back at the bowler. Noor gets a hand to it which keeps the shot down to just one run but he has injured himself in doing that. The physio is out having a look at Noor.\nNoor again cramps Head for room, plays it straight to covers, dot ball. FOUR! Too full, Head backs away and this time gets it in the slot, lofts it over mid off.\n- April 25, 2025 21:534SRH 29/1 in 4 overs\nKamboj to Head, FOUR! At the stumps, in the slot and Head thrashes this with a flat bat through mid on. Head is struck on the pad on the second, but Kamboj is coming from over the wicket which means this is pitching outside leg.\nHead tries to drive the fourth, gets on his toes, plays it on the up but cannot beat the fielder. The third is a length ball, slightly slower, Head plays across the line and misses.\nA fourth straight dot ball, back-of-a-length on the leg stump, Head tries to pick up off his pads, misses. FOUR! A full delivery tailing away from the leftie, Head stays in his crease and drives this through extra covers.\n- April 25, 2025 21:494SRH 21/1 in 3 overs\nKhaleel to Ishan, FOUR! Khaleel bowls at a length, the ball nips in into the off-stump after pitching, Ishan gets his bat to block it but the timing takes it between point and covers.\nThe second is short and wide, Ishan cuts but into the ground, no run. A bouncer from Khaleel which Ishan is able to sway away from.\nFOUR! A glorious drive. Full outside off, Ishan goes onto his front foot, leans in and drives this over covers. Khaleel closes the over with a bouncer, Ishan tries to ramp but misses.\n- April 25, 2025 21:444SRH 13/1 in 2 overs\nAnshul Kamboj from the other end. He comes over the wicket to Ishan. No run off the first ball, angling across the left-hander, Ishan blocks this to point. Kamboj bowls the second on the pads, Ishan clips, midwicket fields this, again no run.\nFOUR! Full and outside off stump, Ishan lofts this over the mid off region. Ishan taps the fourth delivery and completes a run by the time mid off cuts this off.\nKamboj is again full and outside off, Head goes for a swing, miscues it as the bat turns in his hands, no run. Two runs to deep square leg off the final delivery.\n- April 25, 2025 21:37WSRH 6/1 in 1 over\nTravis Head comes in as Impact Player for SRH. He will open the innings with Abhishek Sharma. Khaleel Ahmed to bowl the first over.\nKhaleel starts with a bouncer to Abhishek who misses the pull shot. WICKET! A soft dismissal! Abhishek drives this length ball straight to extra covers. It holds up after pitching which causes the miscue.\nAbhishek Sharma c Mhatre b Khaleel 0(2)\nIshan Kishan at No. 3. The first delivery to him is a wide. Khaleel follows up with a length ball outside off, Ishan nudges this to deep third for one. Khaeel to Head, no run as Head defends this from outside the off stump to covers. FOUR! Head slashes hard at this, gets a thick edge over the cordon.\n- April 25, 2025 21:17WCSK 154 all out in 19.5 overs\nUnadkat to bowl the last over. Hooda on strike. Four!! Hooda moves offside and scoops the first ball through fine leg for four. Length ball outside off, punched to cover but he refuses a single. Another heave over the offside, Hooda finds the gap to pick up a couple. Another drive through cover on a slower ball, another run refused. Slower ball well outside off, wide given. WICKET!! Hooda looks to loft a length ball over long off, holes out to he fielder at long off.\nJust the third instance of CSK getting all out at home in the IPL, our reporter Pranay Rajiv notifies.\n- April 25, 2025 21:10WCSK 147/9 in 19 overs\nWICKET!! Low full toss on the stumps, Noor looks to heave. The outside edge lobs up gleefully for Shami to catch at short third. Wicket number four for Harshal.\nKhaleel the last man in. Scampers across for a single after turning one to the keeper. Hooda refuses a single after pushing one to long off. Six!! Full toss on the body, guided over short fine for six! No ball called as well. Full outside off, lofted over cover. Kishan manages to keep it inside the confines of the boundary. Just a single taken.\n- April 25, 2025 21:03WCSK 137/7 in 18 overs\nCummins to bowl out. Slower ball on the pads, Hooda fails to get bat on it. Leg bye taken. WICKET!! Length ball on the stumps, Kamboj looks to heave one down the ground, edges it to the keeper.\nNoor Ahmad in at 10. Slammed down the ground to long on for a single. Hooda punches a full one to long on for a single. Noor jams his bat down on a full ball, gets a single to mid off.\n- April 25, 2025 20:57WCSK 133/7 in 17 overs\nHarshal to Hooda, length ball on the pads, defended to the legside for one. Short ball outside off, takes the inside edge on Dhoni’s pull and goes on the bounce to the keeper. WICKET!! Full and wide, Dhoni looks to cut but hits it straight at the backward point fielder. No Dhoni power at the death today.\nAnshul Kamboj in as the impact player. Shivam Dube makes way. Kamboj miscues one towards long off and picks up a couple. Slower ball on the stumps, Hooda defends.\n- April 25, 2025 20:50CSK 130/6 in 16 overs\nCummins with his third. Hooda guides a length ball to point for a single. Slower ball, full on the stumps, defended back. Full on the pads again, clipped to midwicket for a single. Back of a length outside off, Hooda misses his waft. Hooda defends to long on and picks up a single.\n- April 25, 2025 20:484CSK 126/6 in 15 overs\nZeeshan back into the attack. Dhoni steps down and defends. Four!! Aggression from Dhoni. Steps down and whips one through the legside for a boundary. Hooda picks up a couple to midwicket.\n- April 25, 2025 20:41WCSK 119/6 in 14 overs\nUnadkat in. Hooda punches a length ball to point for a single. Slower ball angled into Dube, fails to make contact and the ball thuds into his pads. Picks up a single to deep midwicket. Hooda follows suit. WICKET!! Full on the stumps, Dube looks to loft it straight down the ground, doesn’t connect. Easy catch for Abishek at long on.\nSkipper MS gets off the mark with a single to point.\n- April 25, 2025 20:36WCSK 115/5 in 13 overs\nHarshal to Dube. Slower ball outside off, defended to the offside. Back of a length on the pads, defended to midwicket for one. Back of a length outside off, Brevis cuts straight to backward point. Six!! Unbelievable shot! Short slower ball wide outside off, Brevis lofts it over cover and manages to clear the fence. WICKET!! Even better catch! Brevis lofts a quick full ball over long on. Mendis dives full length to his left and holds on with two hands. Slower ball on the stumps to Hooda, defended legside for one.\n- April 25, 2025 20:316CSK 107/4 in 12 overs\nSix!! Mendis continues. Brevis steps legside and lofts one straight down the ground for six. Shorter and wider, Brevis wafts at it. Falls in no man’s land for a single. Full toss outside off to Dube, opts to push it to long off for a single. Six!! A touch short, Brevis goes back and pulls it over midwicket for six. Tossed up outside off, mistimed back to the bowler. Six!! Full and wide, lofted over long off for another six. Excellent over for the host.\n- April 25, 2025 20:264CSK 87/4 in 11 overs\nShami returns. Starts off with a wide. Quick double to square leg on a back of a length ball on the pads. Full outside off, pummeled to long on for a single. Didn’t get the timing he was looking for. Four!! Full toss outside off, Dube punches past mid off for a boundary. Four!! Full outside off again, creams the drive past mid on and finds the gap.\n- April 25, 2025 20:21WCSK 76/4 in 10 overs\nKamindu Mendis with his second. Full outside off, punched to short extra cover. Slapped down the ground by Brevis for a single. WICKET!! Mendis gets a full one to skid on and beats Jadeja’s defence before crashing into the stumps.\nShivam Dube in at 6. Pushes one to long off to get off the mark. Brevis caresses one through cover for one. Just three from the over.\n- April 25, 2025 20:156CSK 73/3 in 9 overs\nSix!! Jadeja lofts Zeeshan’s first ball down the ground. Not the best connection but enough to clear the fence at long on. Wide outside off, slapped to deep cover for one. Brevis moves legside and looks to slog, gets it off the inside half of the bat and will get a single to long on. Wide outside off, driven to the offside sweeper for one. A single to backward point for Brevis. Jadeja sweeps a full ball through wide mid on. A good effort at the deep keeps it to two.\n- April 25, 2025 20:12CSK 61/3 in 8 overs\nKamindu Mendis into the attack. He will start with right-arm off break to Jadeja.\nA single off the fourth delivery of the over, Kamindu fires into the pads, Jadeja whips this to deep midwicket for one.\nKamindu now goes left-arm orthodox to Brevis, cuts to deep covers for one. The final delivery is again on the pads to Jadeja, clips to deep midwicket for the third single of the over.\n- April 25, 2025 20:074CSK 58/3 in 7 overs\nZeeshan Ansari into the attack. He begins with a slider into the pads to Brevis, cannot bring his bat down on time, this one hits the pads but going down leg.\nFOUR! A length ball outside off, Brevis goes into his crease and whacks this down the ground. Brevis cuts the third delivery and a misfield at backward point gets him two.\nThe fourth delivery is a leg spinner on the off stump, Brevis makes room and cuts this to deep point for a single. Jadeja now facing Ansari. He gets the first ball outside off, taps to point, no run.\nPUT DOWN! Harshal Patel has put down a sitter. Jadeja skies this one while going down the ground, Harshal gets under it, has ample time to settle under it but somehow pops this out of his hands.\n- April 25, 2025 20:01WCSK 50/3 in 6 overs\nCummins for his second over. A yorker to Mhatre, digs it out to mid off for one run. Cummins bowls back-of-a-length to Jadeja, who pulls this, gets an under edge and takes a single to short fine leg.\nWICKET! Mhatre would be upset with himself. This is in the slot, Mhatre wants to chip this over mid off, does not clear the fielder and Ishan Kishan takes a comfortable catch.\nAyush Mhatre c Kishan b Cummins 30(19)\nFinally, Dewald Brevis walks in at No. 5. On the off stump to him, Brevis drives off his front foot, gets a run before mid off cuts this off. Cummins bowls into the pads to Jadeja, clips it to deep square leg for one. An inside edge onto the pads for Brevis, runs one to point.\n- April 25, 2025 19:53WCSK 45/2 in 5 overs\nHarshal Patel to bowl the next. Curran gets a length ball angling into his off stump first up, drives down the ground for a single to mid off.\nHarshal to Mhatre, a slower ball on the off-stump line, Mhatre hits across the line, but there’s a deep midwicket in place which keeps it down to one.\nGONE! Curran picks the deep midwicket fielder. A bumper from Harshal, Curran pulls but only into the hands of the fielder.\nSam Curran c Aniket b Harshal 9(10)\nRavindra Jadeja walks in at 4. He, or rather his bat, fails the measuring test and he needs to get in a replacement. FOUR! A floater outside off, Jadeja drives hard at this and gets an edge past short third. Another slower ball, wide outside off, Jadeja slashes this down the ground but cannot get it past the bowler due to lack of pace.\nTwo runs off the final delivery, Cummins misfields at mid off which allows the batting pair a couple.\n- April 25, 2025 19:484CSK 37/1 in 4 overs\nJaydev Unadkat into the attack. Mahtre on strike. He starts with a slower one on the off stump line, Mhatre is wanting to heave this over covers, does not get enough power behind it, lands just short of covers and the batters run a single.\nUnadkat bowls on the pads to Curran, clips it to deep square leg for one run. FOUR! Another slower delivery, predictable! Mhatre waits for it to reach him and swats it back over the bowler’s head.\nFOUR more! A full toss, Mhatre does not go for power this time, places this between extra covers and covers. There are five fielders on the off side from mid on to point yet Mhatre manages to pick the gap. Mhatre tries to chip the final delivery over covers again, bumps it into the ground and the fielder cuts it off.\n- April 25, 2025 19:434CSK 27/1 in 3 overs\nShami again. A mix up between the batters. Curran hits the first delivery to mid on, Mhatre wants a single but Curran is not too sure. The fielder fumbles the ball which eventually allows the single.\nShami goes wider on the second, Mhatre tries to but hits it into the ground, no run. FOUR! Shami tries a bouncer, Mhatre gets on top of the bounce and pummels this over midwicket. Mhatre makes room on the fourth delivery, tries to place this between the fielders at covers and extra covers, cannot do it, dot ball.\nThe fifth is a slower bouncer, Mhatre pulls, gets an under edge onto his body, gets through to the other end before the slip fielder collects this.\nFOUR for Curran! He reads the off-cutter, sets himself up for this delivery outside off, pulls this away past mid on.\n- April 25, 2025 19:374CSK 17/1 in 2 overs\nPat Cummins to bowl the second over. FOUR! Mhatre gives this length ball a proper whack through covers, does not move his feet, does not need to given the width. Cummins bowls the second slightly fuller, on the off-stump line, Mhatre taps this through the off side for a single.\nCummins to Curran, a length ball going across him, Curran drives and then denies a single to his partner. Another dot ball, the fourth is straighter, into the midrif of Curran, flicks it towards midwicket.\nCummins goes around the wicket now, he goes full on the fifth and fires it into the pads, Curran clips to mid on for one run.\nFOUR! Mhatre closes the over with a boundary. A back-of-a-length ball, Mhatre heaves this down the ground, Ishan Kishan takes a couple of steps back from mid off to try and grab this but the ball beats him and runs to the fence.\n- April 25, 2025 19:30WCSK 7/1 in 1 over\nShami to Rasheed, WICKET! Shami strikes first ball. Rasheed departs for a golden duck! He pitches this outside off at a length, the ball moves away from the right-hander, Rasheed pokes at it on the up, gets his edge to first slip.\nShaik Rasheed c Abhishek b Shami 0(1)\nSam Curran at No. 3. A No Ball! Shami distrubs the stumps at the non-striker’s end while loading up for that delivery. A Free Hit coming up! A yorker from Shami, Curran digs it out to point and runs one.\nShami to Mhatre now, another length delivery that shapes away from Mhatre, who punches this to point, no run. Shami pulls his length back on the fourth delivery, Mhatre punches through covers, no run. FOUR! Shami strays in line and Mhatre punishes it. Cuts this away past covers. Mhatre gets the last delivery on his stumps, turns the bat face towards mid on and gets a single.\n- April 25, 2025 19:29Mhatre and Rasheed to open for CSK\nSo Ayush Mhatre is the only one who makes it to the top two. He will join Shaik Rasheed. Dewald Brevis should be batting at one drop.\nMohammed Shami to bowl the first over.\n- April 25, 2025 19:20A new opening salvo for CSK?\nWith Brevis making it into the CSK playing XI, the side might see the new pair of Brevis and Mhatre start the proceedings. The latter was a breath of fresh air against Mumbai Indians, especially for a side struggling at the top for impetus, and the addition of the Protea only solidifies it up front.\n- April 25, 2025 19:09Impact Player options\nCSK: Anshul Kamboj, Ravichandran Ashwin, Kamlesh Nagarkoti, Ramakrishna Ghosh, Jamie Overton\nSRH: Travis Head, Abhinav Manohar, Sachin Baby, Rahul Chahar, Wiaan Mulder\n- April 25, 2025 19:08Playing XIs\nCSK: Shaik Rasheed, Ayush Mhatre, Sam Curran, Ravindra Jadeja, Dewald Brevis, Shivam Dube, MS Dhoni(WK/ C), Deepak Hooda, Noor Ahmad, Khaleel Ahmed, Matheesha Pathirana\nSRH: Abhishek Sharma, Ishan Kishan, Nitish Kumar Reddy, Heinrich Klaasen(WK), Aniket Verma, Kamindu Mendis, Pat Cummins (C), Harshal Patel, Jaydev Unadkat, Zeeshan Ansari, Mohammed Shami\n- April 25, 2025 19:06400 T20 appearances for MS Dhoni\n- April 25, 2025 19:01Toss - SRH\nSRH wins the toss, opts to bowl first.\n“We are coming off a couple of losses but its a new venue. We need a couple of partnerships to consolidate after early wickets.,” Pat Cummins says.\n“Wanted to bowl first. There was a lot of dew last night during practice. When you’re not playing good cricket, you transfer pressure to the young players. We need to enjoy cricket. It is important to take one game at a time rather than look at six games.\nWe have not been sure of the wicket since it was relaid in 2010. The older red soil wicket was good. Brevis for Rachin and Hooda for Vijay Shankar,” says MS Dhoni.\nSam Curran too finds a place in the XI.\n- April 25, 2025 18:45CSK record at M.A. Chidambaram Stadium in IPL\nMatches played: 75\nWon: 51\nLost: 23\nTied: 1\nHighest score: 246/5 vs Rajasthan Royals (April 2010)\nLowest score: 103/9 vs Kolkata Knight Riders (April 2025)\n- April 25, 2025 18:35CSK vs SRH head-to-head record in IPL\nMatches played: 21\nCSK won: 15\nSRH won: 6\nLast result: CSK won by 78 runs (April 2024)\n- April 25, 2025 17:57Sunrisers Hyderabad predicted XI\nBatting 1st: Abhishek Sharma, Travis Head, Ishan Kishan, Nitish Kumar Reddy, Aniket Verma, Heinrich Klaasen (wk), Abhinav Manohar, Pat Cummins (c), Harshal Patel, Zeeshan Ansari, Mohammed Shami/Jaydev Unadkat.\nBowling 1st: Abhishek Sharma, Travis Head, Ishan Kishan, Nitish Kumar Reddy, Aniket Verma, Heinrich Klaasen (wk), Pat Cummins(c), Harshal Patel, Mohammed Shami/ Jaydev Unadkat, Zeeshan Ansari, Eshan Malinga.\nImpact Player options: Abhinav Manohar/Eshan Malinga, Rahul Chahar, Wiaan Mulder, Sachin Baby.\n- April 25, 2025 17:40Chennai Super Kings predicted XI\nBatting 1st: Rachin Ravindra, Shaik Rasheed, Ayush Mhatre, Shivam Dube, Vijay Shankar, Ravindra Jadeja, MS Dhoni (c&wk), Jamie Overton/Dewald Brevis, Ravichandran Ashwin, Noor Ahmad, Matheesha Pathirana.\nBowling 1st: Rachin Ravindra, Shaik Rasheed, Ayush Mhatre, Vijay Shankar, Ravindra Jadeja, MS Dhoni (c&wk), Jamie Overton/Dewald Brevis, Ravichandran Ashwin, Noor Ahmad, Matheesha Pathirana, Khaleel Ahmed.\nImpact Player options: Shivam Dube/Khaleel Ahmed, Kamlesh Nagarkoti, Devon Conway, Andre Siddarth.\n- April 25, 2025 17:22Here’s how the teams are stacked up after the RCB v RR encounter\n- April 25, 2025 16:59PREVIEW\nFor much of Indian Premier League (IPL) 2025, Sunrisers Hyderabad (SRH) and Chennai Super Kings (CSK) have been in the same boat, caught in a whirlpool of inconsistencies and shortcomings, circling further and further away from a playoff spot most had earmarked for them going into the tournament.\nOn Friday, the two sides will meet at the M. A. Chidambaram Stadium in a game that is realistically the final chance for either team to break free of the choppy waters and make an improbable, late push for a top-four spot.\nAt the very least, a win would go a long way for CSK and SRH to avoid the ignominy of finishing at the bottom of the standings — a fate yet to befall the former, while having happened just once for the latter.\nThe wounds are fresher for SRH, which succumbed to its sixth defeat of the season on Wednesday to Mumbai Indians, giving it an unenviable task of regrouping in under 48 hours for the Chennai game.\n- Pranay Rajiv\n- April 25, 2025 16:36Good evening!\nHello and welcome to the live coverage of the IPL 2025 encounter between Chennai Super Kings and Sunrisers Hyderabad at the M. A. Chidambaram Stadium in Chennai. Stay tuned for live updates and scores from the game.",
        "custom_category": "India"
    }
]