[
    {
        "title": "Six teams set for Division I Group A in Romania",
        "description": "Two spots in the 2026 IIHF World Championship are up for grabs this week in Sfantu Gheorghe.",
        "content": "Sfantu Gheorghe, a city of 50,000 people located in a valley between two mountain ranges in Transylvania, is the site of the 2025 IIHF World Championship Division I Group A tournament. This year’s field of six teams includes one – Ukraine – that was ... [4696 chars]",
        "url": "https://www.iihf.com/en/events/2025/wmia/news/66720/six_teams_set_for_division_i_group_a_in_romania",
        "image": "https://blob.iihf.com/iihf-media/iihfmvc/media/2024/wm/wmia/games/game03_rou_v_ita/rou-ita-25.jpg",
        "publishedAt": "2025-04-25T17:19:52Z",
        "source": {
            "name": "IIHF",
            "url": "https://www.iihf.com"
        },
        "scrap_content": "Sfantu Gheorghe, a city of 50,000 people located in a valley between two mountain ranges in Transylvania, is the site of the 2025 IIHF World Championship Division I Group A tournament. This year’s field of six teams includes one – Ukraine – that was promoted by winning Division I Group B last year, two – Great Britain and Poland – that were relegated from the elite division of last year’s Worlds, and three – Italy, Japan and host Romania – that are returnees from last year’s Group A in Bolzano.\nBetween 27 April and 3 May, the six teams will play a round-robin tournament – one game against each of the other teams. After five games, the top two teams will earn advancement to the 2026 IIHF World Championship in Switzerland, teams three through five will return to Group A next year and the sixth-place team will be relegated to Group B.\nGreat Britain, Italy and Poland will be considered among the favourites to advance, Japan and Ukraine will set their sights on avoiding relegation and, based on past results, host Romania could figure into either of those groups or fall somewhere in the middle. While some teams will be favoured more than others, it’s important to remember that this group is always very competitive and there always seems to be at least one team that surprises, so nothing is for sure.\nOrdered according to the IIHF World Ranking, here are the six teams:\nGreat Britain\nOnce a regular participant in Division I, the Brits have played four of their last five World Championships in the elite division, and anything less than earning a return trip next year will be a bitter disappointment. The good news is they have won their last three Division I tournaments – either Group A or B – dating back to 2017. This team is full of high-level international experience led by netminder Ben Bowns, defenceman Ben O’Connor and captain Robert Dowd. If Eisbaren Berlin wrap up the DEL title on Friday, Liam Kirk might be able to join Team GB for the start of the tournament.\nItaly\nThe Italians had high hopes of advancing last year on home ice but fell just short in a tight race. Having qualified for next year’s Winter Olympics as hosts, they would dearly love to improve upon last year’s showing and return to the elite division for the first time since 2022. To that end, the hiring of three-time World Champion Finnish coach Jukka Jalonen should be a step in the right direction. Returning in goal is 20-year-old Anaheim Ducks prospect Damian Clara, who plays in Sweden, and British-born captain Thomas Larkin, who was the Top Defenceman at last year’s Group A tournament.\nPoland\nIn 2023, after just advancing up from Division I Group B, Poland surprisingly finished second in Group A and was promoted to the elite-level World Championship last year. Now back in Group A, the Poles will aim to prove their accomplishment two years ago was no fluke. The team is led offensively by captain Krystian Dziubinski, who was the top scorer and Top Forward of the Group A tournament two years ago, and 20-year-old ex-WHLer Krzysztof Maszias, who has just signed with Vitkovice of the Czech Extraliga.\nRomania\nRomania was the surprise team of last year’s tournament in Bolzano. After appearing in danger of being relegated in their first two games, the Romanians then won three straight and just missed advancing on a tiebreaker. Now, playing on home ice, they aim to return to return to the elite division for the first time since 1977. At the same time, this team coached by Dave MacQueen that is concentrated almost entirely on three clubs in the Hungarian-Romanian Erste Liga knows that its whole is greater than the sum of its parts, and it won’t beat anyone this week on talent alone.\nJapan\nLast year in Bolzano, playing in Division I-A for the first time since 2016, the Japanese accomplished their goal by remaining in the group. And although their only win last year was over relegated Korea, they took Italy to overtime and didn’t lose any game by more than two goals. Therefore, adding to their points total and moving up the standings is certainly dobale, but by no means are they safe from relegation either. As was the case last year, they might be without their top scoring threat, former AHLer Yushiroh Hirano, who finished the season in the DEL.\nUkraine\nMoving up into this group is Ukraine, which won Group B last year with a perfect 5-0 record, outscoring its opponents 31-2. Obviously, the Ukrainians will find Group A much more difficult, but this won’t be a team to take lightly. With their homeland still in turmoil, most of this roster plays abroad, spread across 10 different countries. The team’s leader is captain Igor Merezhko, who plays in the Czech Extraliga for Plzen, who was named Top Defenceman of last year’s Division B tournament in Lithuania. Staying in this group will be the primary goal of this team, but there’s always the dream of a return to the elite division for the first time since 2007.",
        "custom_category": "Sports"
    },
    {
        "title": "Updates from morning skate - Apr. 25",
        "description": "Game-time decisions ahead of Friday’s playoff contest",
        "content": "During his pregame press conference, head coach Martin St-Louis mentioned that a few players are battling some ailments and we should expect to see more players than usual taking part in warmups ahead of puck drop. There will likely be some game-time... [755 chars]",
        "url": "https://www.nhl.com/canadiens/news/updates-from-morning-skate-apr-25-2025",
        "image": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/prd/j6sc7myw6x8qnrnqkgq0.jpg",
        "publishedAt": "2025-04-25T17:15:00Z",
        "source": {
            "name": "NHL.com",
            "url": "https://www.nhl.com"
        },
        "scrap_content": "MONTREAL – With Game 3 between the Habs and Caps coming up later tonight, the Canadiens held a morning skate at the Bell Centre on Friday.\nTwenty-two players hit the ice. Patrik Laine took a maintenance day and did not participate in the session.\nGame-time decisions ahead of Friday’s playoff contest",
        "custom_category": "Sports"
    },
    {
        "title": "Barcelona vs Real Madrid: Copa del Rey final will define trophies & trajectories",
        "description": "Saturday's Copa del Rey final between Barcelona and Real Madrid is about more than just the trophy, writes Guillem Balague.",
        "content": "Any antipathy that Barcelona may have had for Real Madrid in the past does not preclude the fact that for years it seemed that they wanted to be them. Ruthless, serial winners, immune to failure. In the past few years that search has been fruitless.\n... [1608 chars]",
        "url": "https://www.bbc.com/sport/football/articles/c5yp9264qlqo",
        "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c25b/live/245ace40-214b-11f0-9c65-a5c3dc449bf3.png",
        "publishedAt": "2025-04-25T17:03:51Z",
        "source": {
            "name": "BBC",
            "url": "https://www.bbc.com"
        },
        "scrap_content": "Football is theatre. Triumph or tragedy, fantasy or farce. But there's a moment just before the curtain rises, when the stage is still, the lights dim, and there's a silence that crackles with a mixture of tension and anticipation.\nThat's where Barcelona and Real Madrid find themselves now.\nAs the season winds toward its decisive final act, the two great rivals prepare for a double collision.\nSaturday's Copa del Rey final in Seville will be the first, while El Clasico will follow at Montjuic on 11 May. The outcomes will define not only trophies, but trajectories.\nFor Barcelona, a chance to complete a remarkable renewal, a chance to show their critics yet again that rumours about their death truly were exaggerated. For Madrid, perhaps a closing chapter, the end of this particular rodeo.\nBarca know who they are again\nAny antipathy that Barcelona may have had for Real Madrid in the past does not preclude the fact that for years it seemed that they wanted to be them. Ruthless, serial winners, immune to failure. In the past few years that search has been fruitless.\nBut something changed this season. With Hansi Flick at the helm, Barca have rediscovered that sometimes football isn't just about the result but also about the importance and value of the journey.\nThe football is still ambitious. Flick has instilled a kind of emotional clarity, guiding a group of hungry, youthful players with the calm of a manager who knows that the desire to grow and the need to win need not be mutually exclusive. Against Mallorca at the weekend, even with seven changes and a depleted XI, Barca delivered their most statistically dominant performance in years - 40 shots on goal.\nOnly one went in, but what mattered was the general idea did not change - they all think the same in that team right now. With key starters like Frenkie de Jong, Jules Kounde, Pau Cubarsi and Raphinha rested, Flick effectively revealed his starting line-up for Saturday's final.\nWhat makes this Barca different isn't just the tactical framework, it's the emotional one. Flick has shown an ability to manage expectations and egos with diplomacy.\nWhen Ferran Torres, Hector Fort and Ansu Fati reacted poorly to being benched against Celta two games ago, Flick didn't scold - he started all three against Mallorca. It wasn't a punishment or a reward. It was a reminder, a statement of intent. The team is a place for responses, not reactions. In that gesture, he transformed disappointment with purpose.\nWith several core players fresh and a day more to prepare than their rivals, Barca travel to Seville without excuses. They know what's at stake, and perhaps more importantly, they know who they are again.\nWith Lewandowski out, others can shine\nNo one embodies this rebirth better than Dani Olmo, their only real signing this summer. Forgotten through injury and bureaucratic fog, his season began in silence.\nOnly injuries have stopped him making an even bigger impression, but he always finds his moment, involved in 13 goals this season in 27 games (10 goals and three assists). Flick must now decide whether to use him from the start in Seville or hold him back as a decisive second-act character. With Lewandowski out, Olmo's clever movement and invention may be essential.\nThe spotlight also now falls on Ferran Torres. He is not a classic number nine but, in Flick's system, he doesn't need to be. He's dynamic, he presses well, and he's the competition's joint top scorer with five goals.\nThis is no longer the tentative Torres of old, desperate to impress; this is a striker who is happy to take on all the responsibility.\nThe final will also be another chance to enjoy 17-year-old Lamine Yamal, key in big games and someone who plays with something much more than mere confidence -total fearlesness. He gives Barca something few clubs have: unpredictability rooted in joy.\nAnd also a chance for Raphinha to claim his place among the best this season, a clear candidate for the Ballon D'Or with 27 goals and 16 assists in La Liga and the Champions League.\nFor Real, this final is a chance to save face\nBellingham's adaptation has entered a new phase at Real Madrid. He is no longer merely Madrid's star - he has become its standard.\nYet Ancelotti's frequent reminders about the need to show defensive efforts and the meetings he has called to talk about it with him, Rodrygo, Vinicius Jnr and Kylian Mbappe would suggest something is not working. Or make that someone, because Real Madrid cannot play at their best when at least two forward players (Mbappe and Vinicius Jr) - and sometimes three when Rodrygo also goes missing – decide that defending is the job of others and not them.\nIt also means Bellingham then has to do the work of two.\nIt has been a confusing season for Vinicius Jr, who is set to renew until at least 2029 after turning down astronomical sums from Saudi Arabia, matching Mbappe's wages and ensuring that he can continue to scatter his stardust in the white of Real Madrid.\nOn the pitch, he remains Madrid's eternal risk-taker - capable of brilliance, chaos, and sometimes both in the same play. Although he has impressed much less than last season, he has shown his ability to raise his game when needed.\nOnly four points separate both teams in the league, but this is not a Madrid at ease as they look back at the clubs' previous two meetings so far this season. Barcelona didn't just beat them – they destroyed them. The first time, 4-0 in the league at the Bernabeu on 26 October, and the second 5-2 on 12 January in the final of the Spanish Super Cup in Saudi Arabia.\nFor a club obsessed with image, results like these cut deep. This final is a chance to save face, to gain some kind of redemption.\nBehind Ancelotti's serenity lies frustration\nCarlo Ancelotti, with his future delicately poised, has spent the past months preaching balance and commitment. The expectation - unconfirmed but widespread - is that he will leave after the league campaign concludes to finalise his agreement with the Brazil national team.\nUntil then, he has to manage the final metres of this marathon.\nSantiago Solari is expected to take over for the Club World Cup in the summer. The long-term vision, as it stands, points toward Xabi Alonso beginning pre-season in July.\nBut one thing he will not do is negotiate what has brought him to where he is today and how he is perceived throughout the world of football. Publicly, Ancelotti insists: \"I'm not a coach who uses the whip. If that's what you want, hire someone else.\"\nHe is, by his own admission, a soft power.\n\"There's been talk of too much softness. But I've been angry plenty of times,\" Ancelotti said this week. \"Still, that doesn't mean I become authoritarian. I work with people, not robots.\"\nBut behind his serenity lies frustration this season. The mentioned calls for more intensity have largely gone unheeded and he considers this season has been one of the hardest of his career to balance egos.\nDefensively, the numbers reflect this drift. Only 12 clean sheets in 32 league games. No more than five consecutive wins in all competitions. If they are to salvage this season, it must begin now - with eight victories in a row, Copa included.\nWhatever happens in Seville, the season won't end there. El Clasico at Montjuic on 11 May may still crown the league champion.\nBarca will likely arrive with the advantage. Madrid, depending on the outcome of Saturday's final, may arrive as either reborn heroes or wounded guests.\nBut that is for another night.",
        "custom_category": "Sports"
    },
    {
        "title": "Ajith Kumar watches CSK vs SRH match in Chepauk stadium with wife and son, Sivakarthikeyan joins them too. See pic",
        "description": "Ajith Kumar, Sivakarthikeyan were all smiles as they attended the IPL match at Chepauk Stadium on Friday evening. Check out more pictures below.",
        "content": "Actor Ajith Kumar stole the show at the Chepauk Stadium as he was spotted attending the CSK vs SRH match on Friday evening. The actor is basking in the success of his latest release Good Bad Ugly, which performed very well in theatres globally. Ajith... [1801 chars]",
        "url": "https://www.hindustantimes.com/entertainment/tamil-cinema/ajith-kumar-watches-csk-vs-srh-match-in-chepauk-stadium-with-wife-and-son-sivakarthikeyan-joins-them-too-see-pic-101745598040453.html",
        "image": "https://www.hindustantimes.com/ht-img/img/2025/04/25/1600x900/ajith_1745598128926_1745598129385.jpg",
        "publishedAt": "2025-04-25T16:38:02Z",
        "source": {
            "name": "Hindustan Times",
            "url": "https://www.hindustantimes.com"
        },
        "scrap_content": "Ajith Kumar watches CSK vs SRH match in Chepauk stadium with wife and son, Sivakarthikeyan joins them too. See pic\nAjith Kumar, Sivakarthikeyan were all smiles as they attended the IPL match at Chepauk Stadium on Friday evening. Check out more pictures below.\nActor Ajith Kumar stole the show at the Chepauk Stadium as he was spotted attending the CSK vs SRH match on Friday evening. The actor is basking in the success of his latest release Good Bad Ugly, which performed very well in theatres globally. Ajith was present with son Advaik, who sat on his lap. (Also read: 'Couple goals': Ajith Kumar feeds cake to wife Shalini in cute video as they celebrate 25 years of togetherness. Watch)\nAjith watches IPL match with family\nSeveral pictures from the match coverage, which had Ajith watching the tournament intently was shared on X (Formerly Twitter). Ajith looked dapper in a black shirt, and in one picture he was seen with his wife Shalini and son Advaik. Their son sat on Ajith's lap as the whole family concentrated on the match and see MS Dhoni in action.\nA few moments later, actor Sivakarthikeyan was also seen in the same strand, seated right beside Ajith. Both stars bonded over cricket and were seen chatting in between.\nMore details\nAjith celebrated 25 years of marriage with his wife Shalini on April 24. Shalini took to Instagram and shared a video from their 25th wedding anniversary celebration. The couple indulged in a simple cake-cutting ceremony and were seen feeding cake to each other in the sweet video.\nAjith began dating Shalini during the shoot of Saran’s Amarkalam in 1999. The two tied the knot in an intimate wedding ceremony in April 2000 in Chennai. They welcomed their daughter in 2008 and their son in 2015.\nAjith’s latest release was the action-comedy Good Bad Ugly, which was directed by Adhik Ravichandran and produced by Mythri Movie Makers. The film follows a retired gangster who returns to his violent ways after his son is wrongfully convicted. Alongside Ajith, the film features Trisha Krishnan, Arjun Das, Sunil, Karthikeya Dev, Priya Prakash Varrier, Prabhu, Prasanna, Tinnu Anand and Raghu Ram in key roles. It emerged as the highest-grossing Tamil film of 2025, earning ₹227 crore worldwide.",
        "custom_category": "Sports"
    },
    {
        "title": "TATA IPL Live Score, Chennai Super Kings vs Sunrisers Hyderabad Live Full Scorecard",
        "description": "IPL 2025 Live Cricket Score, CSK vs SRH Live Score Online Today Match Updates: Chennai Super Kings were bundled out for just 154 in 19.5 overs after being invited to bat first by Sunrisers Hyderabad at Chepauk on Friday.",
        "content": "CSK vs SRH LIVE Score, IPL 2025: Captain's corner at toss\nPat Cummins: We gonna have a bowl first. Chennai is always a big game, coming off a couple of loses but it is a new venue and boys are up for it. If the wicket is good, backing them to get a b... [764 chars]",
        "url": "https://indianexpress.com/article/sports/cricket/csk-vs-srh-live-score-2025-ipl-43th-match-live-cricket-score-updates-chennai-super-kings-vs-sunrisers-hyderabad-ms-dhoni-travis-head-9965292/",
        "image": "https://images.indianexpress.com/2025/04/IPL-2025_New_Match-43-01.jpg",
        "publishedAt": "2025-04-25T16:33:00Z",
        "source": {
            "name": "The Indian Express",
            "url": "https://indianexpress.com"
        },
        "scrap_content": "IPL 2025 Live Score, CSK vs SRH Live Cricket Score Online: Chennai Super Kings were bundled out for just 154 in 19.5 overs after being invited to bat first by Pat Cummins-led Sunrisers Hyderabad in the Indian Premier League 2025 Match No. 43 at the MA Chidambaram Stadium in Chennai on Friday. The match coincided with MS Dhoni’s milestone 400th T20 match.\nBoth teams have had contrasting make-ups for the 2025 season, with SRH primed to dominate the batting charts this season. Pitted at the far end of that spectrum with a weary-looking batting unit, CSK have struggled to put on the big runs consistently through the league. And yet, both times are riding the same boat, with another defeat fatal to their respective Playoffs hopes.\nCSK and SRH enter the contest after defeats to the Mumbai Indians, who have interestingly regrouped and stormed off the bottom half of the table into the top four. It is that sort of inspiration and performance that CSK and SRH will be looking for tonight, despite the obvious visible cracks in their respective line-ups.\nFollow CSK vs SRH IPL 2025 Live Score updates below:\nChennai Super Kings\n154 (19.5)Sunrisers Hyderabad\n155/5 (18.4)Sunrisers Hyderabad beat Chennai Super Kings by 5 wickets",
        "custom_category": "Sports"
    },
    {
        "title": "NBA Fantasy: 2024-25 total blocks leaders",
        "description": "Looking back at who topped the charts in total blocks for the 2024-25 NBA season.",
        "content": "• Play Fantasy Basketball on Yahoo! >\nThe rarity of blocks make them extremely impactful for fantasy purposes, and many of the league’s top shot-blockers are excellent players to roster. This list is stocked with big men once again, but it appears th... [7062 chars]",
        "url": "https://www.nba.com/news/nba-fantasy-2024-25-total-blocks-leaders",
        "image": "https://cdn.nba.com/manage/2025/04/GettyImages-2197888188-scaled-e1745596857338.jpg",
        "publishedAt": "2025-04-25T16:32:29Z",
        "source": {
            "name": "NBA",
            "url": "https://www.nba.com"
        },
        "scrap_content": "The rarity of blocks make them extremely impactful for fantasy purposes, and many of the league’s top shot-blockers are excellent players to roster. This list is stocked with big men once again, but it appears the Frenchman at the top will lead this group for the next decade.\n1. Victor Wembanyama, Spurs (176 Blocks)\nThis sophomore didn’t even play the final two months of the season, and he still took the blocks crown. Wembanyama led the league with 3.8 blocks per game and seems primed to hold the top spot for the next decade. He was elite in all facets too, averaging 24.3 points, 11 rebounds and 3.7 assists per game. This 21-year-old is only scratching the surface of what he could become.\n2. Brook Lopez, Bucks (148 Blocks)\nLopez landing second on this list is truly remarkable. The 16-year vet continues to showcase his blocking ability, ranking sixth with 1.9 blocks per game. Being able to play 80 games got him up to second in total blocks, but Lopez has finished in the top 10 in total blocks in six of the last seven seasons, finishing in the top 3 in five of those. He also leads all active players with 2,060 career blocks and ranks 20th in NBA history.\n3. Myles Turner, Pacers (144 Blocks)\nTurner has been one of the best shot-blockers in the NBA since he was drafted. The big man has led the league in blocks per game twice over the last seven years, finishing top 10 in total blocks in nine straight seasons. All of that has happened since his rookie campaign, with Turner averaging 15.6 points, 6.5 rebounds, 1.5 assists and 2.0 blocks per game this year.\n4. Walker Kessler, Jazz (138 Blocks)\nPlaying time is the only thing keeping Kessler from being in contention with Wembanyama for the blocks crown. The big man ranked second in the NBA with 2.4 blocks per game this year, his third season with at least 2.3 blocks per game. That’s all three seasons Kessler has been in the NBA, playing 25 minutes a night throughout his career. Those per-minute block numbers are some of the highest in NBA history, and a 30-minute role could have him battling Wemby for that top spot in the future.\nT5. Evan Mobley, Cavaliers (113 Blocks)\nThe Cavs were the best team in the Eastern Conference, and Mobley’s progression is a major reason why. The defensive stud was named the 2024-25 Kia NBA Defensive Player of the Year, averaging 18.5 points, 9.3 rebounds, 3.2 assists, 0.9 steals and 1.6 blocks per game. That blocking average got Mobley in the top 5 in total blocks, playing in 71 games in what developed into a breakout campaign.\nT5. Jaren Jackson Jr., Grizzlies (113 Blocks)\nJackson is always a threat to be in the Kia NBA Defensive Player of the Year discussion. The big man is one of the most versatile defensive players in the NBA, averaging 22.2 points, 5.6 rebounds, 2.0 assists, 1.2 steals and 1.5 blocks this season. Not many players can average a steal and block per game, but it showcases how special of a defender JJJ has been over recent years. This is the third time in five years that JJJ has finished top 6 in total blocks.\nT6. Anthony Davis, Mavericks (110 Blocks)\nMany fans consider Davis the best defender over the last decade, and he has another top 10 finish in blocks under his belt. The Brow ranked third in the NBA with 2.2 blocks per game. The big man has at least 1.6 blocks in all 13 seasons in the NBA and is second all-time with 1,815 career blocks. In 51 games this year, AD averaged 24.7 points, 11.6 rebounds, 3.5 assists, 1.2 steals and 2.2 blocks per game.\nT6. Donovan Clingan, Trail Blazers (110 Blocks)\nThere wasn’t much opportunity for this rookie early on when he played behind Deandre Ayton, so this was quite the accomplishment. Clingan started the final 27 games of the season, averaging 1.8 blocks per game in that span. That’s a flash of what we could see in the future because Clingan was one of the best shot-blockers during his college days at UConn.\n9. Rudy Gobert, Timberwolves (104 Blocks)\nThis is actually a low mark for Gobert, but finishing top 10 in blocks is nothing to complain about. The Frenchman averaged 12 points, 10.9 rebounds and 1.4 blocks in another solid season. Gobert has been top 10 in total blocks 10 times while ranking third among active players with 1,718 career swats.\n10. Daniel Gafford, Mavericks (102 Blocks)\nGafford has always been one of the best per-minute producers in the NBA. Seeing him start for Dallas led to a major bump in production. He averaged 13.8 points, 7.7 rebounds, and 2.2 blocks in his 31 starts this year. The emergence of Dereck Lively II reduced Gafford’s workload in the second half, but Gafford still averaged 1.8 blocks per game. That’s the second-best average of his career, and he will always be a threat for 100 blocks as long as he’s playing 25 minutes a night.\nRemaining top 100\nAlex Sarr, Wizards (101)\nIsaiah Stewart, Pistons (101)\nNic Claxton, Nets (100)\nGoga Bitadze, Magic (98)\nYves Missi, Pelicans (98)\nPeyton Watson, Nuggets (93)\nIvica Zubac, Clippers (90)\nAmen Thompson, Rockets (89)\nJalen Duren, Pistons (89)\nZach Edey, Grizzlies (85)\nDerrick White, Celtics (80)\nJonathan Isaac, Magic (80)\nGiannis Antetokounmpo, Bucks (78)\nKevin Durant, Suns (77)\nShai Gilgeous-Alexander, Thunder (77)\nMatas Buzelis, Bulls (75)\nJaden McDaniels, Timberwolves (74)\nJarrett Allen, Cavaliers (73)\nNaz Reid, Timberwolves (72)\nChet Holmgren, Thunder (71)\nJakob Poeltl, Raptors (71)\nKel’el Ware, Heat (71)\nLuke Kornet, Celtics (71)\nDraymond Green, Warriors (70)\nAdem Bona, 76ers (69)\nKeegan Murray, Kings (69)\nOnyeka Okongwu, Hawks (68)\nOG Anunoby, Knicks (65)\nKeon Ellis, Kings (63)\nKristaps Porziņģis, Celtics (63)\nScottie Barnes, Raptors (63)\nIsaiah Hartenstein, Thunder (62)\nAlperen Sengun, Rockets (61)\nP.J. Washington, Mavericks (60)\nTobias Harris, Pistons (57)\nDereck Lively II, Mavericks (56)\nJay Huff, Grizzlies (56)\nDyson Daniels, Hawks (55)\nJames Harden, Clippers (55)\nNick Richards, Suns (55)\nMark Williams, Hornets (54)\nBam Adebayo, Heat (53)\nCade Cunningham, Pistons (53)\nClint Capela, Hawks (53)\nNikola Vučević, Bulls (52)\nAl Horford, Celtics (51)\nAnthony Edwards, Timberwolves (51)\nJaxson Hayes, Lakers (51)\nAndrew Wiggins, Heat (50)\nKarl-Anthony Towns, Knicks (50)\nKyshawn George, Jazz (50)\nTari Eason, Rockets (50)\nToumani Camara, Trail Blazers (50)\nTyrese Haliburton, Pacers (49)\nAnthony Black, Magic (48)\nMason Plumlee, Suns (47)\nJalen Williams, Thunder (46)\nJerami Grant, Trail Blazers (46)\nJonas Valančiūnas, Kings (46)\nJosh Giddey, Bulls (45)\nMiles Bridges, Hornets (45)\nNikola Jokić, Nuggets (45)\nJalen Smith, Bulls (44)\nMikal Bridges, Knicks (43)\nDay’Ron Sharpe, Nets (42)\nNeemias Queta, Celtics (42)\nPascal Siakam, Pacers (42)\nPrecious Achiuwa, Knicks (42)\nBilal Coulibaly, Wizards (41)\nJabari Smith Jr., Rockets (41)\nKarlo Matković, Jazz (41)\nThomas Bryant, Pacers (41)\nWendell Carter Jr., Magic (41)\nAusar Thompson, Pistons (40)\nJohn Collins, Jazz (40)\nMoussa Diabaté, Hornets (40)\nRyan Dunn, Suns (40)\nDeandre Ayton, Trail Blazers (39)\nDrew Eubanks, Clippers (39)\nJustin Champagnie, Wizards (39)\nLeBron James, Lakers (39)\nLuguentz Dort, Thunder (39)\nTrey Murphy III, Pelicans (39)\nJayson Tatum, Celtics (38)\nMalik Monk, Kings (38)\nMichael Porter Jr., Nuggets (38)\nTrayce Jackson-Davis, Warriors (38)\nZeke Nnaji, Nuggets (38)\nChristian Braun, Nuggets (37)\nRussell Westbrook, Nuggets (37)",
        "custom_category": "Sports"
    },
    {
        "title": "How FA Cup results could affect European qualification",
        "description": "Who wins this season's FA Cup could have an impact on which Premier League clubs qualify for Europe",
        "content": "Related Articles\nThe FA Cup semi-finals take place at Wembley Stadium this weekend, and it's worth noting that the winners of this season's competition could impact how Premier League clubs qualify for Europe.\nFA Cup semi-finals\n26 Apr: Crystal Palac... [4131 chars]",
        "url": "https://www.premierleague.com/news/4293112",
        "image": "https://resources.premierleague.pulselive.com/premierleague/photo/2025/04/23/0be809fe-142f-45b8-aac8-89bbdf329907/FotoJet-2025-04-23T101846.763.jpg",
        "publishedAt": "2025-04-25T16:32:10Z",
        "source": {
            "name": "Premier League",
            "url": "https://www.premierleague.com"
        },
        "scrap_content": "The FA Cup semi-finals take place at Wembley Stadium this weekend, and it's worth noting that the winners of this season's competition could impact how Premier League clubs qualify for Europe.\nFA Cup semi-finals\n26 Apr: Crystal Palace v Aston Villa (17:15 BST)\n27 Apr: Nottingham Forest v Man City (16:30 BST)\nBefore we explain how, it's important to lay out exactly how clubs qualify for European competition.\nUEFA Champions League\nThe top five teams in the Premier League will qualify for next season’s Champions League. Thanks to the performances of Premier League clubs in all of UEFA’s competitions this season, England is now guaranteed a top-two spot in UEFA's association club coefficient rankings, which earns a \"European Performance Spot\" (EPS).\nIt means the Premier League could potentially have as many as SIX clubs in next season's Champions League - the top five teams in the league, plus the Europa League winners if they finish outside the top five.\nUEFA Europa League\nEnglish football receives two Europa League places.\nOne is awarded to the fifth-placed finisher in the Premier League (or the sixth-placed team in the case of England receiving an additional fifth Champions League spot). The other Europa League place goes to the winners of the FA Cup (more on that below).\nUEFA Conference League\nThe winners of the EFL Cup qualify for the Conference League. This season, Newcastle United secured this spot when they triumphed over Liverpool at Wembley, ending their 56-year wait for a trophy in the process.\nHow else can clubs make it to Europe?\nIn addition to booking European berths by virtue of domestic performances, clubs can also do so through their showings in Europe.\nThe winners of the Champions League and Europa League qualify for the following season’s Champions League, while the winners of the Conference League book a spot in next year’s Europa League.\nThis is where the FA Cup results become important.\nIf the FA Cup winners qualify for the Champions League or the Europa League via their Premier League position, or by winning the Champions League (although it is impossible for a team to win the FA Cup AND Champions League this season), their (FA Cup-won) Europa League place is then transferred to the next-highest Premier League finisher not already qualified for UEFA competitions.\nLikewise, if the EFL Cup winners qualify for the Champions League or Europa League via other means - their league position, or by winning the FA Cup or either of those European competitions - their Conference League place will go to the next-highest Premier League side who have not qualified for Europe. That is what Newcastle are hoping for, to finish high enough in the Premier League to trade their Conference League spot from winning the EFL Cup this season for a place in one of the other European competitions.\nThis all means there is a chance that European competitions will feature 10 English clubs next season. Here is one scenario where this could happen:\n- Liverpool, Arsenal, Nottingham Forest, Newcastle and Man City finish in the top five and qualify for the Champions League\n- Aston Villa or Brighton finish sixth and qualify for the Europa League\n- Bournemouth finish seventh and take the Conference League place passed down by EFL Cup winners Newcastle\n- Chelsea finish eighth and qualify for the Europa League by winning this season’s Conference League\n- Crystal Palace finish 10th and qualify for the Europa League by winning this season’s FA Cup\n- Manchester United or Tottenham Hotspur finish 11th and qualify for the Champions League by winning this season’s Europa League\nSuch an improbable outcome would mean SIX English clubs playing in next year’s Champions League, THREE in the Europa League, and ONE in the Conference League.\nSo, the remaining four sides in the FA Cup could aid the quest for 10 teams qualifying for Europe next season.\nForest, Man City and Villa are all in the race to qualify for the Champions League via their Premier League position. If any of those clubs were to achieve that AND win the FA Cup, their reward for the latter - a Europa League place - would be passed to the next-highest team that have not already qualified for Europe.\nIf Palace were to lift the FA Cup, and remain outside the top five, they would take the Europa League place awarded to the winning side at Wembley Stadium.",
        "custom_category": "Sports"
    },
    {
        "title": "Veisten sees positive signs for Norway",
        "description": "All men’s programs now in the top",
        "content": "The last quarter century of men’s hockey in Norway have been erratic. Some great years, some disappointing ones. But now, in 2025, all things seem to be pointed in the right direction. Since the Men’s U18 was introduced by the IIHF in 1999, Norway ha... [2875 chars]",
        "url": "https://www.iihf.com/en/events/2025/wm18/news/66719/veisten_sees_positive_signs_for_norway",
        "image": "https://blob.iihf.com/iihf-media/iihfmvc/media/2025/wm18/wm18/games/g03_nor_v_lat/gm_03_173038_nor_lat_ta_013.jpg",
        "publishedAt": "2025-04-25T16:29:21Z",
        "source": {
            "name": "IIHF",
            "url": "https://www.iihf.com"
        },
        "scrap_content": "And what makes 2025 perhaps something special and a sign of things to come is that this marks the first time ever that all three teams (WM, WM20, WM18) have played in the top pool in consecutive years. Men's U18 coach Kim Veisten is optimistic the program is developing talent that will be around for a good long time.\n“We will be much better in the coming years,” he enthused. “We have a good program and a good system now. We need some sponsors to help with funding, however, because we've had some money issues. We don't have the ability to have long training camps like the other teams, and that means only a short time to get ready for important tournaments like this. But we do what we can.”\nAs is the case for any nation that has played up and down, funding is much easier to come by when you play with the world’s elite teams. But in Norway, there is no favourtism for senior events, which can only help the junior teams and players.\n“In the federation, the funding is equal for all events,” Veisten explained. “In the community, we have school programs which are heading in the right direction, and our clubs and national team are also on the right track. We have some good young prospects now, and this will help our senior team in a few years.”\nVeisten also sees a “type” of player that will be important for Norway to develop if it is to continue playing among the top 16 of the Men’s Worlds. “The key for us is to find hard-working players who will battle every shift,” he explained. “If we don't have that, we can't win and can't compete. We need to be physical and play with confidence.”\nNorway’s troubles at every level revolve around scoring. Defence can be taught. Great goaltending can be developed. But putting the puck in the net? That’s not as simple as drawing x’s and o’s on a whiteboard.\n“We've been working a lot on our play in the defensive zone,” Veisten elaborated of the national program's priorities. “And we've been trying to play with the puck rather than just throwing the puck away. But it's difficult sometimes. We are talking about being more clinical. We have to get pucks on the net and be happy sometimes to get dirty goals.”\nThis is Veisten’s second year as WM18 coach. The 35-year-old was with the U18 team for the previous three years as an assistant, and moved into the head-coaching job last year, finishing ninth an earning a spot in Frisco this year. So far, so good for the affable bench boss with a positive attitude.\n“I have to do a good job, too, or someone else will take my place. We have to prepare and do our best, but my future is up to the federation. But I like the group of guys we have here, and I like coaching the U18 national team. For me, I like to compete with the best. It's a lot of learning.”",
        "custom_category": "Sports"
    },
    {
        "title": "STRONG SPEED QUALIFICATIONS SHOW FOR HOME NATION CHINA",
        "description": "Wujiang opens the IFSC Speed World Cup season and some familiar names are turning up the heat",
        "content": "Shortly after the Lead season opened in Wujiang, China, it was time for the Speed climbers to make their bow in the 2025 season with both the men and women completing qualification for their first final line-ups of the new year.\nSpeed climbing throws... [1232 chars]",
        "url": "https://www.ifsc-climbing.org/events/ifsc-world-cup-wujiang-2025/news/strong-speed-qualifications-show-for-home-nation-china",
        "image": "https://images.ifsc-climbing.org/ifsc/image/private/t_ratio16_9-size50-c_pad/v1700230474/prd/assets/brand/ifsc_placeholder.webp",
        "publishedAt": "2025-04-25T16:18:19Z",
        "source": {
            "name": "ifsc climbing",
            "url": "https://www.ifsc-climbing.org"
        },
        "scrap_content": "Wujiang opens the IFSC Speed World Cup season and some familiar names are turning up the heat\nShortly after the Lead season opened in Wujiang, China, it was time for the Speed climbers to make their bow in the 2025 season with both the men and women completing qualification for their first final line-ups of the new year.\nSpeed climbing throws up surprises all the time, and that’s why we love it.\nWorld record holder Sam Watson from the USA goes into the finals in first position with the fastest time of the day, a 4.76s.\nThen comes the surprise. Olympic champion Veddriq Leonardo misses out on finals in 17th position with a time of 5.165 compared to 16th place finisher Shi Zechuan of China who clocked a 5.162.\nThe men’s Speed is so competitive that you need to break the previous magic mark of five seconds just to crack the top five of qualification.\nHome nation China have the numerical advantage for medals with six finalists, but with the likes of Watson, former world record holder Kiromal Katibin of Indonesia and world champion Matteo Zurloni of Italy through, the finals are sure to be a spectacle.\nMen’s finals competitors\n- Samuel WATSON (USA) 4.76\n- LONG Jianguo (CHN) 4.87\n- Kiromal KATIBIN (INA) 4.96\n- Zach HAMMER (USA) 4.96\n- CHU Shouhong (CHN) 4.99\n- ZHANG Dingfeng (CHN) 5.05\n- Yaroslav TKACH (UKR) 5.09\n- LI Xu (CHN) 5.10\n- Amir MAIMURATOV (KAZ) 5.11\n- Sebastian LUCKE (GER) 5.11\n- Matteo ZURLONI (ITA) 5.11\n- YANG Jie (CHN) 5.12\n- Hryhorii ILCHYSHYN (UKR) 5.13\n- Erik NOYA CARDONA (ESP) 5.13\n- OMASA Ryo (JPN) 5.14\n- SHI Zechuan (CHN) 5.16\nFull men’s Speed results can be found here\nThe women’s finals line-up will be heavily dominated by the home nation as China have a massive ten of the last 16 into the final.\nOdds will be well on the side of China for the podium places, but climbers like Polish Olympic gold medallist and world record holder Aleksandra Miroslaw, alongside teammate Natalia Kalucka, will be looking to spoil the party.\nIt’s South Korean climber Jeong Jimin who actually leads the way though, clocking the fastest qualification time of 6.36s with world champion Desak Dewi of Indonesia just behind with 6.37s. Jeong’s time is both a personal best and national record for South Korea.\nThe time needed to make finals for the women was 7.11s with Italy’s Beatrice Colli and China’s Xie Guizhen on the threshold.\nWomen’s finals competitors\n- JEONG Jimin (KOR) 6.36\n- Desak MADE RITA KUSUMA DEWI (INA) 6.37\n- DENG Lijuan (CHN) 6.42\n- Aleksandra MIROSLAW (POL) 6.43\n- Emma HUNT (USA) 6.47\n- Natalia KALUCKA (POL) 6.50\n- ZHANG Shaoqin (CHN) 6.54\n- MENG Shixue (CHN) 6.56\n- ZHOU Yafei (CHN) 6.58\n- QIN Yumei (CHN) 6.63\n- YANG Mi (CHN) 6.74\n- ZHANG Mengli (CHN) 6.94\n- SHI Xinyue (CHN) 7.00\n- YANG Feiyan (CHN) 7.10\n- Beatrice COLLI (ITA) 7.11\n- XIE Guiizhen (CHN) 7.11\nFull women’s Speed results can be found here\nNews and updates about all IFSC events will be available on the IFSC website, and on the Federation’s digital channels: Facebook, Instagram, LinkedIn, Threads, TikTok, X, YouTube, and exclusively for the Chinese audience, Douyin, Weibo, and Xiaohongshu.",
        "custom_category": "Sports"
    },
    {
        "title": "Lewis Hamilton backed for shock early Ferrari exit: 'He's losing it'",
        "description": "Lewis Hamilton is just four months into a multi-year contract with Ferrari, but could be terminate it at the end of this season?",
        "content": "Former F1 driver Ralf Schumacher has backed Lewis Hamilton to make a shock early exit from Ferrari.\nExcept for his sprint pole and win in China, the seven-time F1 champion has endured a troublesome start to life at Ferrari.\nOver the opening five roun... [1125 chars]",
        "url": "https://racingnews365.com/lewis-hamilton-backed-for-shock-early-ferrari-exit-hes-losing-it",
        "image": "https://cdn.racingnews365.com/2025/Hamilton/_1800x945_crop_center-center_75_none/XPB_1340173_HiRes.jpg?v=1745093430",
        "publishedAt": "2025-04-25T16:10:00Z",
        "source": {
            "name": "racingnews365.com",
            "url": "https://racingnews365.com"
        },
        "scrap_content": "Former F1 driver Ralf Schumacher has backed Lewis Hamilton to make a shock early exit from Ferrari.\nExcept for his sprint pole and win in China, the seven-time F1 champion has endured a troublesome start to life at Ferrari.\nOver the opening five rounds, Hamilton has been comfortably adrift of team-mate Charles Leclerc and visibly dejected in the media pen by his current struggles with the SF-25.\nDespite being on a multi-year contract with the Maranello-based team, Schumacher has insisted that he has seen signs in Hamilton that point to retirement.\n\"He just can't handle the car,\" Schumacher told Sky DE's Backstage Boxengasse podcast. \"We talk a lot about Lando, but I think it's almost worse with Lewis.\n\"He's starting to slump, and that worries me. I know what it's like. I used to drive myself, of course. And when you stand there at one point and you run out of aids and are slower and slower...\n\"Think back, for example, to Silverstone [last year], where he cried with joy, because he said, 'I can still do it'. He's just losing it now. I know that from my own experience. If at some point that doesn't stop, then it's not fun anymore.\n\"Then at some point he wakes up in the morning and thinks, 'Why am I doing this to myself? I don't enjoy it anymore. I can't do it anymore. I can't handle it. I'm getting in the way of my team'. And I really see that happening.\"\nViewed by others:\nSummer deadline\nThe saving grace for Hamilton is next year's regulation change, which could offer the 40-year-old a chance to fight for a title.\nFerrari is expected to be in a good place for 2026, leaving the 105-time race winner seemingly needing to get through this season.\nIt has been a difficult campaign for Hamilton and team-mate Charles Leclerc, in what is one of the standout driver pairings in F1 history.\nSchumacher hopes Ferrari can turn its situation around or risk its star signing making a major decision this summer.\nSchumacher continued: \"I know I will get a lot of criticism again, but if it continues like this until the summer break, there is a danger that he will say, 'I don't want to do this anymore. I want to live my life now. I'm 40 and I'm rich. I'm not doing this to myself anymore, because I'm not performing at the [right] sporting level anymore'.\n\"So I hope he gets order in the team soon. I mean, it's a huge project they have planned, but at the moment, he's far from there.\n\"And as for Charles, exactly what I suspected at the beginning of the year has come true. I didn't think it would be so extreme.\n\"But China, of course, was an indicator. If the circuit suits him, he delivers. So there is still something to come.\"\nAlso interesting:\nJoin RacingNews365's Sam Coop and Nick Golding, as they look back on the Saudi Arabian Grand Prix. Max Verstappen's five-second time penalty is a major talking point, as is Oscar Piastri being a potential match for the Dutchman. Lando Norris' title chances are also explored.\nRather watch the podcast? Then click here!\nMost read",
        "custom_category": "Sports"
    }
]