[
    {
        "title": "Nightly Pulse: NBA News & Highlights from April 24",
        "description": "Follow the NBA Playoffs with our Nightly Pulse blog featuring all the latest news, scores and highlights from around the league.",
        "content": "🏆🏀Thursday’s Playoff Schedule🏆🏀\nDetroit Pistons vs. New York Knicks (TNT/League Pass, 7:00 ET)\nMemphis Grizzlies vs. Oklahoma City Thunder (TNT/League Pass, 9:30 ET)\nLos Angeles Clippers vs. Denver Nuggets (NBATV/ League Pass, 10:00 ET)\nEvan Mobley D... [1270 chars]",
        "url": "https://www.nba.com/news/nightly-pulse-nba-news-highlights-from-april-24",
        "image": "https://cdn.nba.com/manage/2025/04/GettyImages-2210417498-scaled.jpg",
        "publishedAt": "2025-04-24T22:44:58Z",
        "source": {
            "name": "NBA",
            "url": "https://www.nba.com"
        },
        "scrap_content": "🏆🏀Thursday’s Playoff Schedule🏆🏀\nKnicks Starting Unit 🗽🏙️🍎🚕🍕\nNew York was lucky to escape in Game 1 after a 21-0 fourth quarter run but they were unable to do that in Game 2.\nThat leaves us with a 1-1 series, but NY has been resilient in these situations all season.\nThey send out their usual starting five in this critical Game 3.\nDetroit Pistons vs. New York Knicks (TNT/League Pass, 7:00 ET)\nfirst five on the floor pic.twitter.com/OFS0HocDy8\n— NEW YORK KNICKS (@nyknicks) April 24, 2025\nPistons Starting Five 🎷🎷🎷🎷🎷\nDetroit just won its first playoff game since 2008 in Game 2, and they could easily be up 2-0 in this series.\nA 21-0 fourth quarter run in Game 1 helped NY escape with a win, but Detroit has been the better of the two teams.\nThey are tied with the Knicks at 1-1 and will surely be hungry in their home building.\nDetroit Pistons vs. New York Knicks (TNT/League Pass, 7:00 ET)\nTonight's starting five. @Kia pic.twitter.com/ACwXn8jF49\n— Detroit Pistons (@DetroitPistons) April 24, 2025\nEvan Mobley DPOY 💪🛑\nMobley was the catalyst to the top-seeded Cavs stout defense, earning him the Defensive Player of the Year Award.\nHe’s the first player in franchise history to win that award.\nMobley averaged 18.5 points, 9.3 rebounds, 3.2 assists, 0.9 steals and 1.6 blocks in a career year.\nDyson Daniels finished second while Draymond Green finished third in voting.\nALL-STAR, 1-SEED, DPOY 🔒\nEvan Mobley is the 2024-25 Defensive Player of the Year! pic.twitter.com/6MPAE5wLQj\n— NBA on ESPN (@ESPNNBA) April 24, 2025",
        "custom_category": "Sports"
    },
    {
        "title": "Scott McLaughlin Gets Biggest Boost, Alex Palou Fastest in Race Trim",
        "description": "2024 Indy 500 pole winner Scott McLaughlin (photo) was fastest Thursday in the Indianapolis 500 Open Test with a top lap of 232.686 mph, run with extra turbo boost for his Chevrolet engine.",
        "content": "The two names atop the speed charts Thursday came as little surprise on the final day of the Indianapolis 500 Open Test, which featured two segments with distinct engine performance setups.\nLast year’s Indy 500 pole winner Scott McLaughlin was fastes... [4792 chars]",
        "url": "https://www.indycar.com/news/2025/04/04-24-indy-open-test-day2",
        "image": "https://digbza2f4g9qo.cloudfront.net/-/media/IndyCar/News/Standard/2025/04/04-24-McLaughlin-IC.jpg?vs=1&d=20250424T215914Z",
        "publishedAt": "2025-04-24T22:00:25Z",
        "source": {
            "name": "INDYCAR.com",
            "url": "https://www.indycar.com"
        },
        "scrap_content": "Scott McLaughlin Gets Biggest Boost, Alex Palou Fastest in Race Trim\n1 HOUR AGO\nThe two names atop the speed charts Thursday came as little surprise on the final day of the Indianapolis 500 Open Test, which featured two segments with distinct engine performance setups.\nLast year’s Indy 500 pole winner Scott McLaughlin was fastest during the morning session at Indianapolis Motor Speedway, which featured the same elevated turbo boost levels as “Fast Friday” practice May 16 and PPG Presents Armed Forces Qualifying on May 17-18. McLaughlin’s top lap was 232.686 mph in the No. 3 Pennzoil Team Penske Chevrolet, the fastest trip around the 2.5-mile oval in two days of testing this week.\nSEE: ‘Boosted’ Results | ‘Race Trim’ Results | ‘Boosted’ No-Tow Results | Overall Test Results\n“We had a really good day, a good couple of days,” McLaughlin said. “(I) felt like we got through a lot from a hybrid perspective.\n“Then I felt like the morning qualifying session – the high-boost session – was a bit of a crapshoot. (There were a) couple yellows. When the track got better, it was a bit dirty from some of the shunts, as well. Then everyone was trying to cram a lot into 40 minutes. But overall, a really solid (car) balance to kick off the Month of May.”\nThree-time and two-time reigning NTT INDYCAR SERIES champion Alex Palou topped the speed charts during the afternoon session, which featured boost levels reduced to the same levels that will be used on Race Day for the 109th Indianapolis 500 presented by Gainbridge on Sunday, May 25. Current championship leader Palou’s top lap in the afternoon was 223.993 in the No. 10 DHL Chip Ganassi Racing Honda.\n“You need to keep on always chasing it and trying to make it better,” Palou said. “Trying to make it more comfortable when running in traffic, trying to make it faster when you're alone. That’s the car that gives me a chance (to win), for sure.”\nTwo-time Indianapolis 500 winner Takuma Sato was second fastest in the “boosted” session in the morning with his lap of 232.565 mph in the No. 75 AMADA Honda of Rahal Letterman Lanigan Racing. Sato’s lap also was the fastest of the test without the benefit of an aerodynamic “tow” from the slipstream of a leading car.\nBut Sato’s glory was short-lived and showed the risks of living on the edge of a lightning bolt with cars in tricky, low-downforce, high-boost qualifying setups. Sato had completed just eight laps in the morning session, with his best lap on Lap 3, when his car made heavy contact with the SAFER Barrier in Turn 1 and came to a stop in Turn 2 with heavy damage.\n2017 and 2020 Indy winner Sato was uninjured, but the sight of his crumpled race car specifically built and massaged for the “500\" was painful.\n“I lost it; I simply lost it,” Sato said. “It’s hard. My body is fine. It’s just the car … I lost the car. That’s heartbreaking.”\n2018 Indianapolis 500 winner Will Power was third in the “boosted” session at 232.278 in the No. 12 Verizon Team Penske Chevrolet, followed by Felix Rosenqvist at 232.100 in the No. 60 SiriusXM Honda fielded by Meyer Shank Racing. Palou rounded out the top five at 231.843.\nAll but two of the 34 cars on track returned to running in thickets of traffic in the afternoon session to simulate Race Day. Palou and Rosenqvist were the only drivers in the top five in both sessions today, as Rosenqvist backed up his strong performance with extra boost by ending up second in the afternoon with a best lap of 223.366.\nLong Beach winner Kyle Kirkwood was third in the afternoon session at 223.362 in the No. 27 Andretti Global Honda. Conor Daly was fourth at 223.298 in the No. 76 Juncos Hollinger Racing Chevrolet, while two-time reigning “500” winner Josef Newgarden rounded out the top five at 223.255 in the No. 2 Shell V-Power NiTRO+ Team Penske Chevrolet.\nSato wasn’t the only driver to contact the SAFER Barrier Thursday. 2024 Indianapolis 500 Rookie of the Year Kyle Larson also crashed in the morning session, hitting the SAFER Barrier in Turn 1 in the No. 17 Hendrickcars.com Arrow McLaren Chevrolet before secondary contact in Turn 2.\n2021 NASCAR Cup Series champion Larson was unhurt, but like Sato, he didn’t return to the track for the rest of the day. Larson is attempting May 25 to race the “double” of the Indianapolis 500 and the Coca-Cola 600 NASCAR race at Charlotte Motor Speedway.\nChevrolet enjoyed a solid rebound Thursday, as Chevy-powered drivers took two of the top five spots in each of the sessions. Honda engines powered nine of the 10 fastest drivers Wednesday.\nOver two days of testing, the 34 drivers combined to turn 5,804 laps, or 14,510 miles.\nUp next for the NTT INDYCAR SERIES is the Month of May, highlighted by three points races. May racing starts with the Children’s of Alabama Indy Grand Prix on Sunday, May 4 at Barber Motorsports Park in Birmingham, Alabama. Then action shifts to the IMS road course for the Sonsio Grand Prix on Saturday, May 10 before “The Greatest Spectacle in Racing” on Sunday, May 25 on the IMS oval. FOX, the FOX Sports app and the INDYCAR Radio Network are providing live coverage of all three races.",
        "custom_category": "Sports"
    },
    {
        "title": "Zhang Mingyang | All Gas, No Brakes",
        "description": "With 18 First-Round Finishes, Zhang Mingyang Carries His Relentless Style Into The Toughest Test Of His Career At UFC Fight Night: Machado Garry vs Prates",
        "content": "It’s a remarkable feat at any level of mixed martial arts — but once he brought that success into the Octagon, the MMA world took notice.\nZhang has competed in the Octagon three times, including a bout on Road to UFC. Altogether, it’s taken the 26-ye... [713 chars]",
        "url": "https://www.ufc.com/news/zhang-mingyang-all-gas-no-brakes-ufc-kansas-city",
        "image": "https://ufc.com/images/styles/card/s3/2025-04/042225-Zhang-Mingyang-HERO.jpg?itok=AqwYa_ol",
        "publishedAt": "2025-04-24T21:45:00Z",
        "source": {
            "name": "UFC.com",
            "url": "https://www.ufc.com"
        },
        "scrap_content": "Rising Chinese star Zhang Mingyang has a stat line straight out of a video game: 18 wins, 18 first-round finishes.\nIt’s a remarkable feat at any level of mixed martial arts — but once he brought that success into the Octagon, the MMA world took notice.\nZhang has competed in the Octagon three times, including a bout on Road to UFC. Altogether, it’s taken the 26-year-old just over eight minutes to secure those three victories, with the longest of them lasting only three minutes and 57 seconds.\nRELATED: Fighters On The Rise\n“What I found out is you need to study more about your opponent, and then you can find the holes in their game,” he said. “Then, when you get into the fight against him, you can read and find where the opening is and catch it and finish him.”\nRiding a nine-fight win streak into his UFC debut, Zhang was matched up with Dana White’s Contender Series standout Brendson Ribeiro and made it look easy, stopping the Brazilian in under two minutes. He picked up right where he left off last November in Macau, finishing Ozzy Diaz in less than half a round.\n“I think what people can see from the fight is only one side,” Zhang said. “They may think oh, it’s easy, but what you didn’t see is how hard I trained. So, to be honest, the first two fights in the UFC were very hard because I trained very hard to be ready for those two fights.\n“Two wins in the UFC, two Performance of the Night bonuses, which is not what I expected before entering the UFC. Just like what my coach said: hard training, easy fight.”\nThose dominant showings earned Zhang a high-profile test against one of the UFC’s most seasoned veterans: Anthony Smith, who’s shared the Octagon with current and former champions like Jon Jones, Magomed Ankalaev and Glover Teixeira, not to mention a Who’sWho of top contenders over the last nine years.\n“I am the guy still climbing up the mountain, but he is the guy who’s already been on the top,” hesaid. “I should respect his experience and also, to me, this is a very challenging fight, but I think both of us are going to bring our best to the audience.”\nThis fight surprised Zhang for two reasons. First, he sees Smith as a major step up in competition. While he’s entirely ready for the challenge, he didn’t expect it to come this early in his UFC career. Second, Smith has already announced this will be the final fight of his career,regardless of the outcome. Zhang didn’t expect Smith to take such a dangerous challenge against an unranked prospect for his retirement fight.\n“This matchup is kind of out of our plan or even surprised us a little bit because I know that I’m a dangerous guy so, to me, it surprised me Anthony Smith would take this fight because I know I’m a hard guy to match up [with],” Zhang said.\n“I anticipate this fight is going to be a three-round, bloody war,” Zhang said. “Anthony wants a perfect retirement fight, he wants to win, but I also need the win, so I think both of us are going to give everything. I don’t want to leave any regret in the Octagon. But, if I see any opening, I will definitely finish him as soon as possible.”\nEighteen first-round finishes speak for themselves, but if Zhang can add another early stoppage to his record against Smith, it’ll send a clear message to the rest of the light heavyweight divisionthat he’s no longer a prospect, but a serious contender everyone needs to pay attention to.\nDon't miss a moment of UFC Fight Night: Machado Garry vs Prates, live from T-Mobile Center in Kansas City, Missouri On April 26, 2025. Prelims start at 6pm ET/3pm PT, while the main card kicks off at 9pm ET/6pm PT.",
        "custom_category": "Sports"
    },
    {
        "title": "Islamabad United black armbands in PSL 10 clash against Sultans",
        "description": "Fans were left curious after seeing Islamabad United players wearing black armbands during their clash against Multan Sultans in the PSL 10.",
        "content": "Fans were left curious after seeing Islamabad United players wearing black armbands during their clash against Multan Sultans in the Pakistan Super League (PSL) 10 on Wednesday.\nThe defending champions’ players were seen fielding while wearing black ... [1731 chars]",
        "url": "https://arynews.tv/islamabad-united-black-armbands-in-psl-10-clash-against-sultans/",
        "image": "https://arynews.tv/wp-content/uploads/2025/04/ezgif.com-resize-2025-04-24T002937.728.webp",
        "publishedAt": "2025-04-24T21:18:36Z",
        "source": {
            "name": "ARY News",
            "url": "https://arynews.tv"
        },
        "scrap_content": "Fans were left curious after seeing Islamabad United players wearing black armbands during their clash against Multan Sultans in the Pakistan Super League (PSL) 10 on Wednesday.\nThe defending champions’ players were seen fielding while wearing black armbands after Multan Sultans won the toss and elected to bat first in the 13th game of the tournament.\nThe franchise, on its social media accounts, revealed that the move was aimed at extending solidarity with fast bowling coach Rumman Raees over the passing of his sister.\nIn an Instagram post, Islamabad United players were seen applying black tape on their arms before their clash against Multan Sultans in the PSL 10.\n“Islamabad United will wear black armbands today in solidarity with @rumman5550 and his family, following the tragic passing of his sister. Our thoughts and prayers are with Rumman during this incredibly difficult time,” the caption of the post read.\nView this post on Instagram\nMeanwhile, Islamabad United continued their winning streak in the PSL 10 as they beat Multan Sultans by seven wickets in the 13th game of the tournament at the Multan Cricket Stadium.\nRead more: Shadab Khan becomes first spinner to take 100 wickets in PSL\nChasing 169, the defending champions got over the line on the first ball of the 18th over, with seven wickets in hand and 17 balls to spare.\nWith five wins in as many games, Islamabad United sit at the top of the points table of the ongoing PSL 10.\nThe 10th edition of the Pakistan Super League kicked off on April 11 and will run till May 18.\nThe six-team tournament will consist of 34 matches with Lahore’s Gaddafi Stadium hosting 13 matches, including the two Eliminators and the final.\nRawalpindi Cricket Stadium will host 11 PSL 10 matches, including the first Qualifier on May 13, while Multan Cricket Stadium will host five matches.\nKarachi’s National Bank Stadium has hosted five games of the ongoing edition.",
        "custom_category": "Sports"
    },
    {
        "title": "Amorim cancels signing with faith put in youngster instead",
        "description": "Ruben Amorim won't make a signing in a key position despite two players from that area of the squad leaving Manchester United this summer, with the manager placing his faith in a youngster instead.",
        "content": "Ruben Amorim won’t make a signing in a key position despite two players from that area of the squad leaving Manchester United this summer, with the manager placing his faith in a youngster instead.\nMan Utd’s summer transfer plans are already in full ... [3086 chars]",
        "url": "https://www.teamtalk.com/manchester-united/amorim-cancels-man-utd-signing-with-faith-put-in-youngster",
        "image": "https://images.teamtalk.com/content/uploads/2025/02/12121958/man-utd-manager-ruben-amorim1.jpg",
        "publishedAt": "2025-04-24T21:16:42Z",
        "source": {
            "name": "TEAMtalk",
            "url": "https://www.teamtalk.com"
        },
        "scrap_content": "Manchester United\nPremier League • England\nRuben Amorim won’t make a signing in a key position despite two players from that area of the squad leaving Manchester United this summer, with the manager placing his faith in a youngster instead.\nMan Utd’s summer transfer plans are already in full swing, with the club intending to activate the release clauses in Matheus Cunha and Liam Delap’s deals with Wolves and Ipswich Town respectively.\nCunha can be signed for £62.5m, while Delap – once Ipswich’s relegation is confirmed – will cost £30m.\nBoth players are forwards, with Man Utd aiming to add much greater firepower in the very early stages of the window.\nMoves in other positions will come later, with goalkeeper, right wing-back and central midfield under the microscope.\nA new signing at centre-back has also been rumoured to be on the agenda given Jonny Evans and Victor Lindelof are both leaving via free agency.\nBut according to The Sun, Amorim will inform the club’s recruitment team there is no need to sign a new centre-half despite the fact he’ll be two men light next season.\nThe report claimed Amorim is ‘understood to believe there is no need for further recruitment at centre-half, despite the imminent departures of out of contract Jonny Evans and Victor Lindelof.’\nAmorim puts faith in Man Utd youngster\nMan Utd operate with a back three in Amorim’s 3-4-2-1 formation. As such, the need for excellent strength in depth at centre-back is greater at Man Utd than at clubs who only feature two centre-backs in their starting line-up.\nOnce Evans and Lindelof depart, Amorim’s specialist options will narrow to Harry Maguire, Matthijs De Ligt, Leny Yoro and Lisandro Martinez. The latter is currently sidelined after suffering an ACL injury in early-February.\nFull-back Noussair Mazraoui has occupied the right centre-back berth of late, while Luke Shaw stood up tall in the left centre-back role under previous manager Erik ten Hag at times.\nThere is also a wildcard in the equation in the form of 18-year-old Ayden Heaven who if The Sun are correct, can expect to assume greater responsibility next year.\nUnited pulled off a major coup in the winter window when luring Heaven away from Arsenal. Despite his tender age, Heaven was quickly thrust into Amorim’s starting eleven at a time when United’s defenders were riddled with injuries and the teenager did not disappoint.\nSpeaking after Heaven impressed in the 1-1 draw with Arsenal on March 9, Amorim suggested Heaven is already “quite complete.”\n“If he continues like that he is going to play,” said Amorim. “Of course he is young and he didn’t play much this season, maybe only 45 minutes for the Under-21s, then a few minutes here and now a full game.\n“I really like his confidence. I like his pace, I think he is good in defending the box and I think he is quite complete.\n“But he has a lot of work to do in the Premier League. We will face a different kind of player and he will be tested in a different kind of way, so we are trying to manage all of this because he is still really young.”",
        "custom_category": "Sports"
    },
    {
        "title": "Cork v Tipperary: One change for Rebels as skipper is passed fit",
        "description": "Shane Barrett's suspension following draw with Clare opened up a spot in the Cork attack",
        "content": "Declan Dalton comes into the Cork team as the only change for Sunday’s Munster SHC clash with Tipperary at SuperValu Páirc Uí Chaoimh (4pm).\nCork's Declan Dalton in action against Tipperary in the Munster SHC game at Páirc Uí Chaoimh in 2023. Picture... [2680 chars]",
        "url": "https://www.echolive.ie/corksport/arid-41619826.html",
        "image": "https://www.echolive.ie/cms_media/module_img/9189/4594855_4_seoimageog_3101491.jpg",
        "publishedAt": "2025-04-24T21:15:00Z",
        "source": {
            "name": "echo live",
            "url": "https://www.echolive.ie"
        },
        "scrap_content": "Declan Dalton comes into the Cork team as the only change for Sunday’s Munster SHC clash with Tipperary at SuperValu Páirc Uí Chaoimh (4pm).\nWith Shane Barrett given a one-game suspension following his red card in last week’s provincial championship opener, the draw with Clare, Dalton is selected at right half-forward as Séamus Harnedy switches from number 10 to 12.\nOtherwise, the starting lineup is the same as that which began in Ennis, with captain Robert Downey passed fit after being forced off against Clare with a swelling in his knee.\nJack O’Connor has been selected for the vacancy on the bench created by Dalton’s accession to the first 15, while there is one other alteration among the substitutes. Cormac O’Brien, who started five games in Cork’s successful Allianz HL campaign but missed the Clare game through injury, is fit again and he takes the place of Eoin Roche.\nThe game is a repeat of the league final of three weeks ago, which Cork won by ten points to claim the title for the first time since 1998.\nBoth counties have a point on the board ahead of the sell-out fixture, with Tipp having tied at home to Limerick. Sunday’s other fixture sees Waterford open their campaign with a home game against Clare at Walsh Park (2pm).\nDuring the round-robin era in the provincial championships, the Cork-Tipperary fixture has yet to produce a home winner, with two draws and three away wins.\nIn 2019, Tipp triumphed at Páirc Uí Chaoimh while Cork staged a fightback to earn a draw at the same venue two years ago.\nPatrick Collins (Ballinhassig); Niall O’Leary (Castlelyons), Eoin Downey (Glen Rovers), Seán O’Donoghue (Inniscarra); Ciarán Joyce (Castlemartyr), Robert Downey (Glen Rovers, captain), Mark Coleman (Blarney); Tim O’Mahony (Newtownshandrum), Ethan Twomey (St Finbarr’s); Declan Dalton (Fr O’Neills), Darragh Fitzgibbon (Charleville), Séamus Harnedy (St Ita’s); Patrick Horgan (Glen Rovers), Alan Connolly (Blackrock), Brian Hayes (St Finbarr’s). Subs: Brion Saunderson (Midleton), Cormac O’Brien (Newtownshandrum), Damien Cahalane (St Finbarr’s), Ger Millerick (Fr O’Neills), Tommy O’Connell (Midleton), Luke Meade (Newcestown), Brian Roche (Bride Rovers), Diarmuid Healy (Lisgoold), Robbie O’Flynn (Erin’s Own), Shane Kingston (Douglas), Jack O’Connor (Sarsfields).\nBrion Saunderson (Midleton), Cormac O’Brien (Newtownshandrum), Damien Cahalane (St Finbarr’s), Ger Millerick (Fr O’Neills), Tommy O’Connell (Midleton), Luke Meade (Newcestown), Brian Roche (Bride Rovers), Diarmuid Healy (Lisgoold), Robbie O’Flynn (Erin’s Own), Shane Kingston (Douglas), Jack O’Connor (Sarsfields).",
        "custom_category": "Sports"
    },
    {
        "title": "Browns-Texans make a trade involving third-day picks",
        "description": "The first trade of draft day has happened, and it is anticlimactic.",
        "content": "The first trade of draft day has happened, and it is anticlimactic.\nThe Browns and Texans have worked out a trade, though of much-less value that their trade of Deshaun Watson three years ago. All five picks involved in the deal are third-day picks.\n... [443 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/browns-texans-make-a-trade-for-late-round-picks",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/b092685/2147483647/strip/true/crop/5428x3053+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F7b%2Ff6%2F0f9b7a3345f09c6d1e5046bb085f%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2211827984",
        "publishedAt": "2025-04-24T21:10:36Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "scrap_content": "The first trade of draft day has happened, and it is anticlimactic.\nThe Browns and Texans have worked out a trade, though of much-less value that their trade of Deshaun Watson three years ago. All five picks involved in the deal are third-day picks.\nThe Texans traded a 2025 fifth-round pick (No. 166 overall) and 2027 fifth-round pick to the Browns for a 2025 sixth-round pick (No. 179 overall), a 2025 sixth-round pick (No. 216 overall) and a 2025 seventh-round pick (No. 255 overall). The trade was announced by both teams.\nThe Browns had four sixth-round picks and turned two of those and a seventh-rounder to get into the fifth round. Cleveland now has eight draft picks and Houston nine.",
        "custom_category": "Sports"
    },
    {
        "title": "Williamson joins Karachi Kings in Lahore",
        "description": "LAHORE: Former New Zealand captain and veteran batter Kane Williamson has officially joined the Karachi Kings squad for the ongoing HBL Pakistan Super League . The seasoned cricketer, who was picked...",
        "content": "Former New Zealand captain and veteran batter Kane Williamson. — AFP/File\nLAHORE: Former New Zealand captain and veteran batter Kane Williamson has officially joined the Karachi Kings squad for the ongoing HBL Pakistan Super League (PSL 10). The seas... [1011 chars]",
        "url": "https://www.thenews.com.pk/print/1304833-williamson-joins-karachi-kings-in-lahore",
        "image": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-04-25/l_1304833_021004_updates.jpg",
        "publishedAt": "2025-04-24T21:10:04Z",
        "source": {
            "name": "The News International",
            "url": "https://www.thenews.com.pk"
        },
        "scrap_content": "LAHORE: Former New Zealand captain and veteran batter Kane Williamson has officially joined the Karachi Kings squad for the ongoing HBL Pakistan Super League (PSL 10). The seasoned cricketer, who was picked in the supplementary category during the PSL 10 draft, arrived in Lahore on Thursday and checked into the team hotel upon arrival.\nWilliamson is set to participate in the team’s training session later today at the Lahore City Cricket Association (LCCA) ground as he gears up for Karachi Kings’ upcoming match against Quetta Gladiators, scheduled for Friday, April 25.\nAfter their clash with Quetta Gladiators, Karachi Kings will face Multan Sultans on May 1. They are set for an intense showdown with arch-rivals Lahore Qalandars on May 4, followed by matches against Peshawar Zalmi on May 8 and defending champions Islamabad United on May 10, concluding their group stage campaign.\nLed by Australia’s David Warner, Karachi Kings have been in strong form, winning three out of their five matches so far in PSL 10. Their latest victory came in a nail-biting encounter against Peshawar Zalmi on April 22, where they secured a two-wicket win in the last over at the National Stadium.\nMehidy Hasan Miraz celebrates with teammates after taking a wicket during the first Test against Zimbabwe at Sylhet...\nSports Minister Malik Faisal Ayub Khokhar chairing a meeting on April 24, 2025. — Facebook@mpafaisal161LAHORE: In a...\nThis image shows athletes during an event by the Athletics Federation of Pakistan. — Athletics Federation of...\nView of PCB headquarters in Lahore. — PCB/FileLAHORE: In a major step toward revitalising domestic cricket, the...\nJames Vince and Irfan Khan Niazi during Pakistan Super League 10 match between Karachi Kings and Quetta Gladiators at...\nMichael Bracewell from the New Zealand. — BCCI/FileLAHORE: Multan Sultans’ New Zealand all-rounder, Michael...",
        "custom_category": "Sports"
    },
    {
        "title": "Kinder-Ramsay rivalry lights up Australian Swimming Championships",
        "description": "Ella Ramsay and Tara Kinder could barely be separated all week, lining up in four finals across the Australian Open Swimming Championships in Brisbane, sharing four golds and four silvers between them.",
        "content": "Sport is nothing without rivalries.\nWhen the thrill of a head-to-head race trumps all else, the surrounding competitors almost fading into little more than background noise.\nAt the Australian Open Swimming Championships this week, spectators have bee... [7725 chars]",
        "url": "https://www.abc.net.au/news/2025-04-25/tara-kinder-ella-ramsay-medley-breaststoke-rival/105208930",
        "image": "https://live-production.wcms.abc-cdn.net.au/91b099ea83d2f4e6838020c4d1d23bd0?impolicy=wcms_watermark_news&cropH=450&cropW=800&xPos=0&yPos=75&width=862&height=485&imformat=generic",
        "publishedAt": "2025-04-24T20:59:29Z",
        "source": {
            "name": "Australian Broadcasting Corporation",
            "url": "https://www.abc.net.au"
        },
        "scrap_content": "Sport is nothing without rivalries.\nWhen the thrill of a head-to-head race trumps all else, the surrounding competitors almost fading into little more than background noise.\nAt the Australian Open Swimming Championships this week, spectators have been treated to a fine, healthy rivalry between 21-year-old Tara Kinder and 20-year-old Ella Ramsay.\nOver, and over, and over, and over again.\nRamsay and Kinder could have been auditioning for a synchronised spot, entwined as they were in a tremendous dance of finals swimming that took place on all four days at the Brisbane Aquatic Centre.\nThe 200m individual medley. The 400m individual medley. The 200m breaststroke. The 100m breaststroke. Even the B final of the 200m freestyle.\nUp on the blocks, if either one of these swimmers looked to their side, they'd lock eyes with the other.\nGame on.\n\"We've somehow ended up in the lanes next to each other, every final,\" Kinder laughs when asked about it by ABC Sport.\n\"Even tonight in the 200 free, the B final, I was like, 'hey', but yeah, it's good.\n\"I've raced against her since I was like 14 and we've both really just been medley and she sort of stepped up over breaststroke the last few years.\n\"[At] trials last year, she gave everyone a run for their money in that breaststroke, making that Paris team and I was like, 'I'm gonna step up my game now'.\"\nIpswich swimmer Ramsay had a stunning 2024 Olympic trials, earning a spot on the Olympic team in the 200m breaststroke and both 200 and 400 individual medleys, and went on to win a silver medal in the 4x100m medley relay.\nBut she acknowledged the benefit of having a close rival in Brisbane this past week.\n\"It's nice to have someone there pushing you,\" Ramsay tells ABC Sport.\n\"If you didn't have someone there pushing, you wouldn't get to the next step.\n\"So it's really nice having her there to compete with.\"\nAnd it was terrifically evenly matched.\nKinder rediscovering her love for the water\nRamsay, an Olympic finalist from Paris, claimed gold in the 200m IM by 1.24 seconds.\nKinder returned the favour with gold in the 400m medley by 4.13 seconds.\nRamsay edged Kinder in the 100m breaststroke by 0.40 seconds.\nThen Kinder took out the 200m breaststroke by 0.64 seconds.\n\"I've never been on a open national podium before this week,\" Kinder says.\n\"So I will take two gold and two silver any day of the week.\"\nKinder's breakout performance is a credit to her perseverance.\nIn 2021, the now-21-year-old took a break from the sport, burnt out by the relentless pressure of being an athlete at such a young age.\n\"2021 was just a hell of a ride for me,\" Kinder recalls.\n\"I got glandular fever leading into Tokyo Olympic trials, that was also my year 12 year in high school, so off the back of a pretty average trials had to do my exams, ended up getting COVID as well.\n\"I took a bit of a break to do schoolies and everything off the back of the exams and never really felt committed enough to try and get my body back to the fitness that it was at eight months prior.\n\"So the new year rolled around and I wanted to see what life was like outside of school, but also outside of being an elite athlete. I didn't really have anything else.\"\nKinder threw herself into university fulltime — \"hated it\" she said — before the siren call of the pool landed her back in training.\n\"When Fukuoka [world championship 2023] trials rolled around, I saw that they were going to be in Melbourne,\" Kinder says.\n\"So I texted Craig [Jackson] and I was like, 'Hey, do you wanna take me back?'\n\"And I came back.\"\nKinder says the time away, during which she studied, moved out of home and moved back in again, helped focus her mind.\n\"I experienced it all and just realised that I didn't really feel like I had a drive towards something,\" Kinder says.\n\"I wasn't the biggest fan of uni so it wasn't like a career-focused passion, so I thought moving back into swimming could be something to look for.\n\"And then the first few months back swimming it was a lot more fun than it's ever been before. So I thought I'd stick with it.\"\nRamsay thrilled with new coach Marshall\nRamsay too has had to refocus over the past year.\nFollowing her excellent Olympic performance, Ramsay enjoyed a well-earned couple of months off before returning to the pool — and it appears to have paid off.\n\"Coming off the Olympics I had a really big physical and mental break,\" Ramsay explains.\n\"Not that I like to compare, but comparing to this time last year, I'm actually some of my events were fast. So it's so it's nice to see that and reflect on that.\"\nPart of that may be down to new coach Mel Marshall, who has taken over at Griffith University after Michael Bohl stepped away.\n\"We have a good group down there, a good environment and she's [Marshall's] been really good. I can't thank her enough,\" Ramsay says.\n\"Coming off the Olympics, it's hard for anyone, but she's got me back into peak performance I'd say, both mental and physical, so I'm very thankful.\"\nEven if that means doing two extra swims on what is supposed to be a day off, with Ramsay swimming the 200m freestyle and 200m backstroke on Thursday.\n\"Mel gave me heaps of events,\" Ramsay says with a huge grin.\n\"Today was supposed to be a day off, but she gave me the 200 free and 200 back instead, so very nice of her.\"\nNow, both women will focus on qualifying for the world championships at the trials in Adelaide in June.\nThere, they will likely be competing for the same spot on the team, with Olympic medallist Kaylee McKeown a shoo-in for the lead spot.\nMcKeown pulled out of the 200m medley on Easter Monday and withdrew from the championships entirely on Thursday after announcing on Instagram that she would be leaving Griffith University to train back at the USC Spartans club on the Sunshine Coast.\nThe five-time Olympic gold medallist, who won bronze at the 2024 Paris Games in the 200m IM, will almost certainly race the event in Singapore.\nBut with this burgeoning rivalry? Who knows who will join her on the Australian team, with both Ramsay and Kinder achieving the qualifying time.\n\"It's nice to have her [Kinder] there because I can be disappointed in myself and then come back to the drawing board and see what I can do better come next race,\" Ramsay explains.\n\"I do get really excited to race next to Ella because she paces a lot differently to me,\" Kinder says.\n\"Obviously in that 400m IM I had many seconds [to catch up] — backstroke's my weakest stroke, so I like the chase in the breaststroke, then just to try and hold it out and then hope my freestyle is good enough to hold her off.\n\"And then the [200 IM] is not at my strongest, but Kaylee's got that anyway,\" she adds with a laugh.\n\"But just being able to get on top of that podium there [in the 400] and that rivalry with Ella, and try to be as close to her best time from Paris that I could be, was just the drive, because obviously top two qualify for worlds.\n\"And just, yeah, focusing on that.\"",
        "custom_category": "Sports"
    },
    {
        "title": "Chris Eubank Jr admits he is in ‘pain’ after being called a disgrace by father",
        "description": "The pair are said to not have spoken in “years” following the breakdown of their relationship.",
        "content": "Chris Eubank Jr revealed he is in “pain” following his father’s comments where he labelled him a “disgrace” for slapping rival Conor Benn with an egg in their February press conference.\nThe pair are said to not have spoken in “years” following the br... [2368 chars]",
        "url": "https://www.breakingnews.ie/sport/chris-eubank-jr-admits-he-is-in-pain-after-being-called-a-disgrace-by-father-1755721.html",
        "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDRcXFwvMjQyMTQ5NDdcXFwvMi43OTg1MzEyMy1lMTc0NTUyNzgzOTkwMS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjQyZjg3NDNkNDg0M2E3Y2E3OTNkNzE5MjZhODBhNGRhNDNmNTk5YjQifQ==/chris-eubank-jr-admits-he-is-in-pain-after-being-called-a-disgrace-by-father.jpg",
        "publishedAt": "2025-04-24T20:51:03Z",
        "source": {
            "name": "BreakingNews.ie | Irish News | Breaking News from Ireland",
            "url": "https://www.breakingnews.ie"
        },
        "scrap_content": null,
        "custom_category": "Sports"
    }
]